title: OTX URL IOC - https://tribunalukraine.info/article/1251
id: c7d450ce-2cb5-4331-b5fb-1905e8897f11
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Mid-year Doppelganger
  information operations in Europe and the US' (66a8fc31eef230721db4d064).
author: AlienVault
date: '2024-07-30'
references:
- https://harfanglab.io/en/insidethelab/doppelganger-operations-europe-us/
tags:
- redirection
- social media
- russian actors
- disinformation
- elections
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://tribunalukraine.info/article/1251
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
