title: OTX URL IOC - https://lexomnium.com/nouveaux-affrontements-en-nouvelle-caledonie-les-espoirs-de-macron-decus/
id: f092c332-f4ab-417d-a334-6035ec1969ce
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Mid-year Doppelganger
  information operations in Europe and the US' (66a8fc31eef230721db4d064).
author: AlienVault
date: '2024-07-30'
references:
- https://harfanglab.io/en/insidethelab/doppelganger-operations-europe-us/
tags:
- redirection
- social media
- russian actors
- disinformation
- elections
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://lexomnium.com/nouveaux-affrontements-en-nouvelle-caledonie-les-espoirs-de-macron-decus/
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
