title: OTX URL IOC - https://derbayerischelowe.info/groszugigkeit-mit-nebenwirkungen-deutschlands-dilemma-bei-der-ukraine-hilfe
id: a4899bdf-fa8e-4332-b6d4-1d15d774ac78
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Mid-year Doppelganger
  information operations in Europe and the US' (66a8fc31eef230721db4d064).
author: AlienVault
date: '2024-07-30'
references:
- https://harfanglab.io/en/insidethelab/doppelganger-operations-europe-us/
tags:
- redirection
- social media
- russian actors
- disinformation
- elections
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://derbayerischelowe.info/groszugigkeit-mit-nebenwirkungen-deutschlands-dilemma-bei-der-ukraine-hilfe
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
