title: OTX URL IOC - http://ebhmkoohccl45qesdbvrjqtyro2hmhkmh6vkyfyjjzfllm3ix72aqaid.onion
id: 515df5e8-8bb8-4832-af09-27e8de9f039d
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Interlock ransomware
  evolving under the radar' (67ffb7eba715b936a2c4c2a8).
author: AlienVault
date: '2025-04-16'
references:
- https://blog.sekoia.io/interlock-ransomware-evolving-under-the-radar
tags:
- berserkstealer
- clickfix
- interlock rat
- double extortion
- ransomware
- remote access trojan
- interlock ransomware
- credential stealer
- fake updaters
- powershell backdoor
- lumma
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://ebhmkoohccl45qesdbvrjqtyro2hmhkmh6vkyfyjjzfllm3ix72aqaid.onion
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
