title: OTX URL IOC - https://lmfao.su/Bin/ScreenConnect.ClientSetup.msi?e=Access&y=Guest
id: da4d8e1c-289d-4f7a-bab0-cad8dae2f6d5
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'The Solidity Language
  open-source package was used in a $500,000 crypto heist' (6870b25f4c4c81689f7f0c75).
author: AlienVault
date: '2025-07-11'
references:
- https://securelist.com/open-source-package-for-cursor-ai-turned-into-a-crypto-heist/116908/
tags:
- developers
- heur:trojan-psw.msil.purelogs.gen
- blockchain
- open-source
- vmdetector
- solidity
- cursor ai
- cryptocurrency
- quasar
- malicious extension
- data theft
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://lmfao.su/Bin/ScreenConnect.ClientSetup.msi?e=Access&y=Guest
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
