title: OTX URL IOC - https://angelic.su/files/2.txt
id: 8814adc3-1848-4ea3-ae6d-7a722702c5cf
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'The Solidity Language
  open-source package was used in a $500,000 crypto heist' (6870b25f4c4c81689f7f0c75).
author: AlienVault
date: '2025-07-11'
references:
- https://securelist.com/open-source-package-for-cursor-ai-turned-into-a-crypto-heist/116908/
tags:
- developers
- heur:trojan-psw.msil.purelogs.gen
- blockchain
- open-source
- vmdetector
- solidity
- cursor ai
- cryptocurrency
- quasar
- malicious extension
- data theft
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://angelic.su/files/2.txt
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
