title: OTX URL IOC - https://lutianwl.com
id: 2a07e1c1-5eae-4a4f-ab89-cba28aba9223
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Sealed Chain of
  Deception: Actors leveraging Node.JS to Launch JSCeal'' (688b3d58e80e0edcd1cb1e22).'
author: AlienVault
date: '2025-07-31'
references:
- https://research.checkpoint.com/2025/jsceal-targets-crypto-apps/
tags:
- fake apps
- stealer
- cryptocurrency
- malvertising
- multi-stage
- node.js
- evasion
- jsceal
- jsc
- powershell
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://lutianwl.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
