title: OTX URL IOC - http://yuuexutjzjmul7wldcecq6mpr2v5dyblw5n77elnoikttxfk3y54gnad.onion:20247
id: 2b32437a-3e3a-4395-b9f4-88211461373c
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Raspberry Robin:
  Latest Updates and Improvements'' (68920b2a624f32c4343ef884).'
author: AlienVault
date: '2025-08-05'
references: []
tags:
- encryption
- roshtyak
- usb
- privilege-escalation
- obfuscation
- tor
- raspberry robin
- cve-2024-38196
- downloader
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://yuuexutjzjmul7wldcecq6mpr2v5dyblw5n77elnoikttxfk3y54gnad.onion:20247
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
