title: OTX URL IOC - http://g7w5uxhxw5mp5jmshvevd273qvkph2if5xnvrjemthe6ok5q5dtek4ad.onion:58387
id: a6ecb878-3741-41b0-a1ef-113aeffeec9c
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Tracking Updates to
  Raspberry Robin' (6894823cef05b4415dd5032a).
author: AlienVault
date: '2025-08-07'
references:
- https://www.zscaler.com/blogs/security-research/tracking-updates-raspberry-robin
tags:
- tor
- downloader
- raspberry robin
- roshtyak
- encryption
- cve-2024-38196
- obfuscation
- usb-spread
- evasion
- privilege-escalation
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://g7w5uxhxw5mp5jmshvevd273qvkph2if5xnvrjemthe6ok5q5dtek4ad.onion:58387
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
