title: OTX URL IOC - https://srlaptop.com/s/0.7.8/clarity.js
id: 581a898c-de8e-49c7-81cc-510f9564bd4b
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Update WinRAR tools
  now: RomCom and others exploiting zero-day vulnerability'' (689a04b1cf818643f79c1bd3).'
author: AlienVault
date: '2025-08-11'
references:
- https://www.welivesecurity.com/en/eset-research/update-winrar-tools-now-romcom-and-others-exploiting-zero-day-vulnerability
tags:
- rustyclaw
- winrar
- vulnerability
- mythic
- zero-day
- spearphishing
- russia-aligned
- cve-2025-8088
- backdoor
- exploit
- snipbot
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://srlaptop.com/s/0.7.8/clarity.js
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
