title: OTX URL IOC - https://campanole.com/TOfrPOseJKZ
id: 750644e9-007e-44bc-8d10-6a8c74224a54
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Update WinRAR tools
  now: RomCom and others exploiting zero-day vulnerability'' (689a04b1cf818643f79c1bd3).'
author: AlienVault
date: '2025-08-11'
references:
- https://www.welivesecurity.com/en/eset-research/update-winrar-tools-now-romcom-and-others-exploiting-zero-day-vulnerability
tags:
- rustyclaw
- winrar
- vulnerability
- mythic
- zero-day
- spearphishing
- russia-aligned
- cve-2025-8088
- backdoor
- exploit
- snipbot
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://campanole.com/TOfrPOseJKZ
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
