title: OTX URL IOC - http://160.25.232.62/bee/BEE02_H.txt
id: ae53ed6d-7958-4d41-93de-4f8456722c8e
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Noodlophile Stealer
  Evolves: Targeted Copyright Phishing Hits Enterprises with Social Media Footprints''
  (68a4f2609ccc8bd3337dfda6).'
author: AlienVault
date: '2025-08-19'
references:
- https://www.morphisec.com/blog/noodlophile-stealer-evolves-targeted-copyright-phishing-hits-enterprises-with-social-media-footprints/
tags:
- facebook
- select
- morphisec
- ai video
- noodlophile
- dll sideloading
- web data
- new noodlophile
- telegram
- spear
- persistence
- python
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://160.25.232.62/bee/BEE02_H.txt
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
