title: OTX URL IOC - https://trustisimportant.fun/karma/karma.js?karma=bs?nosaj=faster.mo
id: 99092e7d-f62a-4ddd-950c-ad7601a74cf3
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''CryptoJacking is
  dead: long live CryptoJacking'' (68a5a893d0e6cf5fee6c45a2).'
author: AlienVault
date: '2025-08-20'
references:
- https://cside.dev/blog/cryptojacking-is-dead-long-live-cryptojacking
tags:
- cryptojacking
- webassembly
- monero
- stealth mining
- web workers
- obfuscation
- websockets
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://trustisimportant.fun/karma/karma.js?karma=bs?nosaj=faster.mo
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
