title: OTX URL IOC - http://185.218.87.28
id: cf8befca-c1d8-439f-abad-5eab7bb73d3c
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://185.218.87.28
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
