title: OTX URL IOC - https://www.pbfenergy.com/
id: 8b2d19ea-01a4-429a-b67a-5e92fbd216d9
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Inside the 2025
  Energy Phishing Wave: Chevron, Conoco, PBF, Phillips 66'' (68c37a4f61a4eeb53a76aef0).'
author: AlienVault
date: '2025-09-12'
references:
- https://hunt.io/blog/us-energy-phishing-wave-report
tags:
- energy sector
- httrack
- credential harvesting
- phishing
- investment scams
- keitaro
- website cloning
- rhadamanthys
- domain impersonation
- brand abuse
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://www.pbfenergy.com/
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
