title: OTX URL IOC - http://female-disorder-beta-metropolitan.trycloudflare.com/index.php
id: b64adb23-9480-4c48-a5f0-39325ddb30f8
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'August 2025 APT Attack
  Trends Report' (68c968df6d5252f1c44577ea).
author: AlienVault
date: '2025-09-16'
references:
- https://asec.ahnlab.com/en/90152
tags:
- rokrat
- cab files
- rat
- powershell
- south korea
- spear phishing
- xenorat
- lnk files
- apt
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://female-disorder-beta-metropolitan.trycloudflare.com/index.php
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
