title: OTX URL IOC - https://vn1backn.site/Bin/ScreenConnect.Client.application?y=Guest
id: 0eddbbca-a70a-48d6-bce9-7b47ec29c894
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''AsyncRAT Campaigns
  Uncovered: How Attackers Abuse ScreenConnect and Open Directories'' (68cd7f421874e12c34532ccf).'
author: AlienVault
date: '2025-09-19'
references:
- https://hunt.io/blog/asyncrat-screenconnect-open-directory-campaigns#ConnectWise_ScreenConnect_Network_Observables_and_Indicators_of_Compromise_IOCs
tags:
- phishing
- open directories
- screenconnect
- remote access trojan
- powershell rat
- c2 infrastructure
- payload staging
- persistence
- asyncrat
- cve-2025-3935
- obfuscation
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://vn1backn.site/Bin/ScreenConnect.Client.application?y=Guest
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
