title: OTX URL IOC - http://164.68.120.30:550/99/Skype.ps1
id: 94ce347f-849e-44a4-bf64-fc36d50d9a7a
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''AsyncRAT Campaigns
  Uncovered: How Attackers Abuse ScreenConnect and Open Directories'' (68cd7f421874e12c34532ccf).'
author: AlienVault
date: '2025-09-19'
references:
- https://hunt.io/blog/asyncrat-screenconnect-open-directory-campaigns#ConnectWise_ScreenConnect_Network_Observables_and_Indicators_of_Compromise_IOCs
tags:
- phishing
- open directories
- screenconnect
- remote access trojan
- powershell rat
- c2 infrastructure
- payload staging
- persistence
- asyncrat
- cve-2025-3935
- obfuscation
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://164.68.120.30:550/99/Skype.ps1
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
