title: OTX URL IOC - http://176.65.139.119:555/aA/Skype.ps1
id: f3155d67-d9bf-4817-9c47-796724d9dce1
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''AsyncRAT Campaigns
  Uncovered: How Attackers Abuse ScreenConnect and Open Directories'' (68cd7f421874e12c34532ccf).'
author: AlienVault
date: '2025-09-19'
references:
- https://hunt.io/blog/asyncrat-screenconnect-open-directory-campaigns#ConnectWise_ScreenConnect_Network_Observables_and_Indicators_of_Compromise_IOCs
tags:
- phishing
- open directories
- screenconnect
- remote access trojan
- powershell rat
- c2 infrastructure
- payload staging
- persistence
- asyncrat
- cve-2025-3935
- obfuscation
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://176.65.139.119:555/aA/Skype.ps1
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
