title: OTX URL IOC - https://bahelp.top/Bin/ZoomWorkspace.ClientSetup.exe?e=Access&y=Guest
id: 3018b442-3ea5-4336-a688-1d58d0f9ae9e
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''AsyncRAT Campaigns
  Uncovered: How Attackers Abuse ScreenConnect and Open Directories'' (68cd7f421874e12c34532ccf).'
author: AlienVault
date: '2025-09-19'
references:
- https://hunt.io/blog/asyncrat-screenconnect-open-directory-campaigns#ConnectWise_ScreenConnect_Network_Observables_and_Indicators_of_Compromise_IOCs
tags:
- phishing
- open directories
- screenconnect
- remote access trojan
- powershell rat
- c2 infrastructure
- payload staging
- persistence
- asyncrat
- cve-2025-3935
- obfuscation
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://bahelp.top/Bin/ZoomWorkspace.ClientSetup.exe?e=Access&y=Guest
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
