title: OTX URL IOC - https://funtik.clayfenrirhuy.top/login
id: f2e19f68-f8a1-4a3e-a2d8-047219cefe85
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ClayRat: A New Android
  Spyware Targeting Russia'' (68e8c12eb7ebbc52304b33bc).'
author: AlienVault
date: '2025-10-10'
references:
- https://zimperium.com/blog/clayrat-a-new-android-spyware-targeting-russia
tags:
- ClayRat
- Spyware
- phishing
- SMS
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://funtik.clayfenrirhuy.top/login
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
