title: OTX URL IOC - https://rushi.claysrat.top
id: a3af6d0e-a477-458a-ac4c-de5ab408b66f
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ClayRat: A New Android
  Spyware Targeting Russia'' (68e8c12eb7ebbc52304b33bc).'
author: AlienVault
date: '2025-10-10'
references:
- https://zimperium.com/blog/clayrat-a-new-android-spyware-targeting-russia
tags:
- ClayRat
- Spyware
- phishing
- SMS
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://rushi.claysrat.top
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
