title: OTX URL IOC - http://83.252.42.112/rondo.lol
id: 07ef862b-5516-4d7d-adb2-a6b936a45ec0
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'From Targeting Pwn2Own
  Vulnerabilities to Shotgunning Exploits' (68e86b551440846b11a598a1).
author: AlienVault
date: '2025-10-10'
references:
- https://www.trendmicro.com/en_us/research/25/j/rondodox.html
tags:
- cve-2023-1389
- pwn2own
- cve-2024-3721
- cve-2024-12856
- rondodox
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://83.252.42.112/rondo.lol
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
