title: OTX URL IOC - http://1.tcp.us-cal-1.ngrok.io:24521
id: 0b32fa7d-4dd0-43ef-a6e1-9a69561dd042
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Banking Trojan Abusing
  GitHub for Resilience' (68ee1391e202d5db1c015e71).
author: AlienVault
date: '2025-10-14'
references: []
tags:
- guildma
- github abuse
- banking trojan
- cryptocurrency
- steganography
- keylogging
- astaroth
- south america
- phishing
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://1.tcp.us-cal-1.ngrok.io:24521
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
