title: OTX URL IOC - http://9.tcp.ngrok.io:23955
id: 5fa6883f-ce46-4bcf-b35b-6470e51b61d0
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Banking Trojan Abusing
  GitHub for Resilience' (68ee1391e202d5db1c015e71).
author: AlienVault
date: '2025-10-14'
references: []
tags:
- guildma
- github abuse
- banking trojan
- cryptocurrency
- steganography
- keylogging
- astaroth
- south america
- phishing
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://9.tcp.ngrok.io:23955
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
