title: OTX URL IOC - http://1.tcp.sa.ngrok.io:20262
id: 4491099c-ad53-4a1a-9d8a-a86b715ec09e
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Banking Trojan Abusing
  GitHub for Resilience' (68ee1391e202d5db1c015e71).
author: AlienVault
date: '2025-10-14'
references: []
tags:
- guildma
- github abuse
- banking trojan
- cryptocurrency
- steganography
- keylogging
- astaroth
- south america
- phishing
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://1.tcp.sa.ngrok.io:20262
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
