title: OTX URL IOC - http://cloud.givensolutions.online:4443
id: 1434d187-2ce5-4200-ab19-5a5ae4837f96
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Mysterious Elephant
  APT: TTPs and tools'' (68efd379576217166803e5e1).'
author: AlienVault
date: '2025-10-15'
references:
- https://securelist.com/mysterious-elephant-apt-ttps-and-tools/117596/
tags:
- custom tools
- babshell
- stom exfiltrator
- foreign affairs
- memloader hidendesk
- whatsapp exploitation
- memloader edge
- uplo exfiltrator
- government targets
- remcos
- chromestealer exfiltrator
- vrat
- exfiltration
- apt
- asia-pacific
- spear phishing
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://cloud.givensolutions.online:4443
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
