title: OTX URL IOC - https://monsoonconference.com
id: b944c9c3-57db-45c2-99d8-b2d5be3fd040
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Mysterious Elephant
  APT: TTPs and tools'' (68efd379576217166803e5e1).'
author: AlienVault
date: '2025-10-15'
references:
- https://securelist.com/mysterious-elephant-apt-ttps-and-tools/117596/
tags:
- custom tools
- babshell
- stom exfiltrator
- foreign affairs
- memloader hidendesk
- whatsapp exploitation
- memloader edge
- uplo exfiltrator
- government targets
- remcos
- chromestealer exfiltrator
- vrat
- exfiltration
- apt
- asia-pacific
- spear phishing
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://monsoonconference.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
