title: OTX URL IOC - http://e.overallwobbly.ru/era-stc
id: 7a0b3e35-03c4-46e1-990e-f0d5fae711af
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''New Group on the
  Block: UNC5142 Leverages EtherHiding to Distribute Malware'' (68f130fe56a14a2de8f391b4).'
author: AlienVault
date: '2025-10-16'
references:
- https://cloud.google.com/blog/topics/threat-intelligence/unc5142-etherhiding-distribute-malware
tags:
- smart contracts
- blockchain
- cloudflare pages
- bnb smart chain
- atomic
- lummac.v2
- vidar
- infostealers
- radthief
- clearshort
- wordpress
- etherhiding
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://e.overallwobbly.ru/era-stc
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
