title: OTX URL IOC - http://start.cleaning-room-device.shop/sha589.m4a
id: 7da3d174-609d-41cc-b0d4-d012995689e9
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''New Group on the
  Block: UNC5142 Leverages EtherHiding to Distribute Malware'' (68f130fe56a14a2de8f391b4).'
author: AlienVault
date: '2025-10-16'
references:
- https://cloud.google.com/blog/topics/threat-intelligence/unc5142-etherhiding-distribute-malware
tags:
- smart contracts
- blockchain
- cloudflare pages
- bnb smart chain
- atomic
- lummac.v2
- vidar
- infostealers
- radthief
- clearshort
- wordpress
- etherhiding
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://start.cleaning-room-device.shop/sha589.m4a
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
