title: OTX URL IOC - http://discover-travel-agency.pro/1.m4a
id: 77f9a78a-5fd0-40a4-9492-0ba07555094b
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''New Group on the
  Block: UNC5142 Leverages EtherHiding to Distribute Malware'' (68f130fe56a14a2de8f391b4).'
author: AlienVault
date: '2025-10-16'
references:
- https://cloud.google.com/blog/topics/threat-intelligence/unc5142-etherhiding-distribute-malware
tags:
- smart contracts
- blockchain
- cloudflare pages
- bnb smart chain
- atomic
- lummac.v2
- vidar
- infostealers
- radthief
- clearshort
- wordpress
- etherhiding
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://discover-travel-agency.pro/1.m4a
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
