title: OTX URL IOC - http://ads.green-pickle-jo.shop/1.m4a
id: 321692f1-dfe3-4377-bad2-a29f77d1d3d9
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''New Group on the
  Block: UNC5142 Leverages EtherHiding to Distribute Malware'' (68f130fe56a14a2de8f391b4).'
author: AlienVault
date: '2025-10-16'
references:
- https://cloud.google.com/blog/topics/threat-intelligence/unc5142-etherhiding-distribute-malware
tags:
- smart contracts
- blockchain
- cloudflare pages
- bnb smart chain
- atomic
- lummac.v2
- vidar
- infostealers
- radthief
- clearshort
- wordpress
- etherhiding
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://ads.green-pickle-jo.shop/1.m4a
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
