title: OTX URL IOC - http://betiv.fun/7456f63a46cc318334a70159aa3c4291.txt
id: 365b25e8-eda0-481c-a231-c4322e9f5107
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''New Group on the
  Block: UNC5142 Leverages EtherHiding to Distribute Malware'' (68f130fe56a14a2de8f391b4).'
author: AlienVault
date: '2025-10-16'
references:
- https://cloud.google.com/blog/topics/threat-intelligence/unc5142-etherhiding-distribute-malware
tags:
- smart contracts
- blockchain
- cloudflare pages
- bnb smart chain
- atomic
- lummac.v2
- vidar
- infostealers
- radthief
- clearshort
- wordpress
- etherhiding
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://betiv.fun/7456f63a46cc318334a70159aa3c4291.txt
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
