title: OTX URL IOC - https://xunira.cloud/C.GRE'
id: d992de45-a749-4dfe-828c-74461923eed0
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Unpacking NetSupport
  RAT Loaders Delivered via ClickFix' (68fb00e2b2d0361731cc0f7c).
author: AlienVault
date: '2025-10-24'
references:
- https://www.esentire.com/blog/unpacking-netsupport-rat-loaders-delivered-via-clickfix
tags:
- remote administration tools
- clickfix
- netsupport rat
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: https://xunira.cloud/C.GRE'
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
