title: OTX URL IOC - http://nextgen1.net/carrier.broker.agreement.html.
id: ea5febcd-072f-4467-a90c-acc2a820f222
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Remote access, real
  cargo: cybercriminals targeting trucking and logistics'' (6908bc12c65b2822b687ed79).'
author: AlienVault
date: '2025-11-03'
references:
- https://www.proofpoint.com/us/blog/threat-insight/remote-access-real-cargo-cybercriminals-targeting-trucking-and-logistics
tags:
- screenconnect
- lumma stealer
- phishing
- simplehelp
- cargo theft
- fleetdeck
- n-able
- logmein resolve
- danabot
- trucking
- logistics
- cybercrime
- netsupport
- social engineering
- supply chain
- stealc
- remote monitoring tools
- pdq connect
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://nextgen1.net/carrier.broker.agreement.html.
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
