title: OTX URL IOC - http://185.158.113.114:5000/affiliate/builder.
id: 5614cf3a-774e-481b-8bf0-36d125d9d0c7
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The DragonForce
  Cartel: Scattered Spider at the gate'' (690b1a8fb4a0df0cf6a16178).'
author: AlienVault
date: '2025-11-05'
references:
- https://www.acronis.com/en/tru/posts/the-dragonforce-cartel-scattered-spider-at-the-gate/
tags:
- conti
- dragonforce
- social engineering
- global
- scattered spider
- ransomware
- cartel
- byovd
- encryption
- mamona
- devman
- affiliate program
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://185.158.113.114:5000/affiliate/builder.
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
