title: OTX URL IOC - http://z3wqggtxft7id3ibr7srivv5gjof5fwg76slewnzwwakjuf3nlhukdid.onion
id: 8574cb93-aa18-4761-890a-c803d0e3ed4b
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The DragonForce
  Cartel: Scattered Spider at the gate'' (690b1a8fb4a0df0cf6a16178).'
author: AlienVault
date: '2025-11-05'
references:
- https://www.acronis.com/en/tru/posts/the-dragonforce-cartel-scattered-spider-at-the-gate/
tags:
- conti
- dragonforce
- social engineering
- global
- scattered spider
- ransomware
- cartel
- byovd
- encryption
- mamona
- devman
- affiliate program
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://z3wqggtxft7id3ibr7srivv5gjof5fwg76slewnzwwakjuf3nlhukdid.onion
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
