title: OTX URL IOC - http://jsonkeeper.com/b/IXHS4
id: e905d3bd-538c-42ec-9132-3bb1a3f9fe4f
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Contagious Interview
  Actors Now Utilize JSON Storage Services for Malware Delivery' (69171fd18d6bf2d291a8c53e).
author: AlienVault
date: '2025-11-14'
references:
- https://blog.nviso.eu/2025/11/13/contagious-interview-actors-now-utilize-json-storage-services-for-malware-delivery/
tags:
- ottercookie
- json storage
- tsunami payload
- web3
- social engineering
- rat
- north korea
- infostealer
- cryptocurrency
- invisibleferret
- trojanized code
- beavertail
- otx
- threat-intel
logsource:
  category: proxy
detection:
  selection:
    url.full: http://jsonkeeper.com/b/IXHS4
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
