title: OTX FileHash-SHA256 IOC - f983d786f4dc2d1793f6b28907c4035c96b6b5c8765ba12dc4510dab0fceabf5
id: 6483e0aa-df8a-4ce7-86b4-823b72b0d415
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'ITG05 operations leverage
  Israel-Hamas conflict lures to deliver Headlace malware' (6579b53c00375a2dcfaaf952).
author: AlienVault
date: '2023-12-13'
references:
- https://securityintelligence.com/x-force/itg05-ops-leverage-israel-hamas-conflict-lures-to-deliver-headlace-malware/
tags:
- itg05
- september
- ukraine
- azerbaijan
- israel
- razumkov centre
- belarus
- service
- winrar
- nishang
- graphite
- credomap
- gootloader
- wailingcrab
- mocky
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: f983d786f4dc2d1793f6b28907c4035c96b6b5c8765ba12dc4510dab0fceabf5
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
