title: OTX FileHash-SHA256 IOC - 4c8a6ad89c4218507e27ad6ef4ddadb6b507020c74691d02b986a252fb5dc612
id: ab1be8cb-45d8-4ba1-8f3d-850fd28b2636
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Fake Minecraft mods
  distributed by the Stargazers Ghost Network to steal gamers’ data' (6852eaf4e5e37f4bd599c84e).
author: AlienVault
date: '2025-06-18'
references: []
tags:
- Minecraft
- infostealer
- Stargazers Ghost Network
- Java malware
- Minecraft mods
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 4c8a6ad89c4218507e27ad6ef4ddadb6b507020c74691d02b986a252fb5dc612
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
