title: OTX FileHash-SHA256 IOC - 5d80105913e42efe58f4c325ac9b7c89857cc67e1dcab9d99f865a28ef084b37
id: 9fd89dd9-ae42-49d6-b2a2-8882fd2fb48f
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Fake Minecraft mods
  distributed by the Stargazers Ghost Network to steal gamers’ data' (6852eaf4e5e37f4bd599c84e).
author: AlienVault
date: '2025-06-18'
references: []
tags:
- Minecraft
- infostealer
- Stargazers Ghost Network
- Java malware
- Minecraft mods
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 5d80105913e42efe58f4c325ac9b7c89857cc67e1dcab9d99f865a28ef084b37
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
