title: OTX FileHash-SHA256 IOC - 51e423e8ab1eb49691d8500983f601989286f0552f444f342245197b74bc6fcf
id: c36b41b2-7f8b-48ba-a80e-86b7abfa779e
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Fake Minecraft mods
  distributed by the Stargazers Ghost Network to steal gamers’ data' (6852eaf4e5e37f4bd599c84e).
author: AlienVault
date: '2025-06-18'
references: []
tags:
- Minecraft
- infostealer
- Stargazers Ghost Network
- Java malware
- Minecraft mods
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 51e423e8ab1eb49691d8500983f601989286f0552f444f342245197b74bc6fcf
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
