title: OTX FileHash-MD5 IOC - c8c20c56c950eb291ce7902bf1c28485
id: b82b0f8f-1b81-41b7-b151-86c9704787be
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Malware Analysis
  Report: UMBRELLA STAND - Malware targeting Fortinet devices'' (68593bc9c284f1baf4623782).'
author: AlienVault
date: '2025-06-23'
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/umbrella-stand/ncsc-mar-umbrella_stand.pdf
tags:
- process injection
- persistence
- firewall
- shoe rack
- defense evasion
- remote shell
- umbrella stand
- fortinet
- aes encryption
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: c8c20c56c950eb291ce7902bf1c28485
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
