title: OTX FileHash-SHA1 IOC - 8632487a9f19223b20d34c082a3077ca6ac6eac4
id: fcafc0fe-31f3-43f8-9e52-a0804373e8e6
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Malware Analysis
  Report: UMBRELLA STAND - Malware targeting Fortinet devices'' (68593bc9c284f1baf4623782).'
author: AlienVault
date: '2025-06-23'
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/umbrella-stand/ncsc-mar-umbrella_stand.pdf
tags:
- process injection
- persistence
- firewall
- shoe rack
- defense evasion
- remote shell
- umbrella stand
- fortinet
- aes encryption
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 8632487a9f19223b20d34c082a3077ca6ac6eac4
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
