title: OTX FileHash-SHA256 IOC - 190293440fce95f45eb8bf5d40334b41dd68c79578d06fe9b34670298daea7f3
id: 5e5ff3dd-08c5-44da-b2cf-55f7e23c04a3
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Malware Analysis
  Report: UMBRELLA STAND - Malware targeting Fortinet devices'' (68593bc9c284f1baf4623782).'
author: AlienVault
date: '2025-06-23'
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/umbrella-stand/ncsc-mar-umbrella_stand.pdf
tags:
- process injection
- persistence
- firewall
- shoe rack
- defense evasion
- remote shell
- umbrella stand
- fortinet
- aes encryption
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 190293440fce95f45eb8bf5d40334b41dd68c79578d06fe9b34670298daea7f3
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
