title: OTX FileHash-SHA1 IOC - c2a463d5091efb2be590fbfa5dba5a821d5625cf
id: 1edca648-ded6-4d0f-b0b6-950aa1373a0b
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Malware Analysis
  Report: UMBRELLA STAND - Malware targeting Fortinet devices'' (68593bc9c284f1baf4623782).'
author: AlienVault
date: '2025-06-23'
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/umbrella-stand/ncsc-mar-umbrella_stand.pdf
tags:
- process injection
- persistence
- firewall
- shoe rack
- defense evasion
- remote shell
- umbrella stand
- fortinet
- aes encryption
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: c2a463d5091efb2be590fbfa5dba5a821d5625cf
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
