title: OTX FileHash-MD5 IOC - 43f398bfe3eecd5584ebf3321000c3cd
id: 537aaf1a-7d1a-43b4-925f-8006982f8e78
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Malware Analysis
  Report: UMBRELLA STAND - Malware targeting Fortinet devices'' (68593bc9c284f1baf4623782).'
author: AlienVault
date: '2025-06-23'
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/umbrella-stand/ncsc-mar-umbrella_stand.pdf
tags:
- process injection
- persistence
- firewall
- shoe rack
- defense evasion
- remote shell
- umbrella stand
- fortinet
- aes encryption
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 43f398bfe3eecd5584ebf3321000c3cd
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
