title: OTX FileHash-SHA1 IOC - 3a7d09c9ce2ff7f6026cda4a7f80945ee0952c95
id: eb589dce-7c49-47e6-9a86-e31302088817
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Malware Analysis
  Report: UMBRELLA STAND - Malware targeting Fortinet devices'' (68593bc9c284f1baf4623782).'
author: AlienVault
date: '2025-06-23'
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/umbrella-stand/ncsc-mar-umbrella_stand.pdf
tags:
- process injection
- persistence
- firewall
- shoe rack
- defense evasion
- remote shell
- umbrella stand
- fortinet
- aes encryption
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 3a7d09c9ce2ff7f6026cda4a7f80945ee0952c95
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
