title: OTX FileHash-SHA256 IOC - 38801caae26916367dd6cf6e8c55e50ed62526fe242cd0343dfe80a70564c28a
id: 45b9faa3-fcda-46a9-9bd2-008225433643
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Malware Analysis
  Report: UMBRELLA STAND - Malware targeting Fortinet devices'' (68593bc9c284f1baf4623782).'
author: AlienVault
date: '2025-06-23'
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/umbrella-stand/ncsc-mar-umbrella_stand.pdf
tags:
- process injection
- persistence
- firewall
- shoe rack
- defense evasion
- remote shell
- umbrella stand
- fortinet
- aes encryption
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 38801caae26916367dd6cf6e8c55e50ed62526fe242cd0343dfe80a70564c28a
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
