title: OTX FileHash-MD5 IOC - 615521d36644d11f53e17805a1422f29
id: 95baba59-028c-4d7b-bdf1-2a8305300c53
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Malware Analysis
  Report: UMBRELLA STAND - Malware targeting Fortinet devices'' (68593bc9c284f1baf4623782).'
author: AlienVault
date: '2025-06-23'
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/umbrella-stand/ncsc-mar-umbrella_stand.pdf
tags:
- process injection
- persistence
- firewall
- shoe rack
- defense evasion
- remote shell
- umbrella stand
- fortinet
- aes encryption
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 615521d36644d11f53e17805a1422f29
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
