title: OTX FileHash-MD5 IOC - 6bdfac0500e164de8c6bbd13e05b3968
id: 42e05244-871d-4911-ad63-0e0fe7a4e524
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Malware Analysis
  Report: UMBRELLA STAND - Malware targeting Fortinet devices'' (68593bc9c284f1baf4623782).'
author: AlienVault
date: '2025-06-23'
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/umbrella-stand/ncsc-mar-umbrella_stand.pdf
tags:
- process injection
- persistence
- firewall
- shoe rack
- defense evasion
- remote shell
- umbrella stand
- fortinet
- aes encryption
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 6bdfac0500e164de8c6bbd13e05b3968
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
