title: OTX FileHash-SHA1 IOC - d21e46856ffb344ed06a461efb554e5a490a9e3e
id: c77591fb-2f73-4e23-8b41-3c0db323149c
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Malware Analysis
  Report: UMBRELLA STAND - Malware targeting Fortinet devices'' (68593bc9c284f1baf4623782).'
author: AlienVault
date: '2025-06-23'
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/umbrella-stand/ncsc-mar-umbrella_stand.pdf
tags:
- process injection
- persistence
- firewall
- shoe rack
- defense evasion
- remote shell
- umbrella stand
- fortinet
- aes encryption
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: d21e46856ffb344ed06a461efb554e5a490a9e3e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
