title: OTX FileHash-SHA1 IOC - 99dde2df0b8b31fce5807d710c1b8d9018a56f58
id: 18116620-f7fd-4807-b61d-b83af15521e3
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Malware Analysis
  Report: UMBRELLA STAND - Malware targeting Fortinet devices'' (68593bc9c284f1baf4623782).'
author: AlienVault
date: '2025-06-23'
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/umbrella-stand/ncsc-mar-umbrella_stand.pdf
tags:
- process injection
- persistence
- firewall
- shoe rack
- defense evasion
- remote shell
- umbrella stand
- fortinet
- aes encryption
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 99dde2df0b8b31fce5807d710c1b8d9018a56f58
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
