title: OTX FileHash-SHA1 IOC - 28ff882baa02c646bcdddffacb75923490a3dcf7
id: 9599ccb0-37fc-4f9c-80d4-7346f47cf128
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Malware Analysis
  Report: UMBRELLA STAND - Malware targeting Fortinet devices'' (68593bc9c284f1baf4623782).'
author: AlienVault
date: '2025-06-23'
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/umbrella-stand/ncsc-mar-umbrella_stand.pdf
tags:
- process injection
- persistence
- firewall
- shoe rack
- defense evasion
- remote shell
- umbrella stand
- fortinet
- aes encryption
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 28ff882baa02c646bcdddffacb75923490a3dcf7
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
