title: OTX FileHash-SHA256 IOC - d3b88b7f640e478d8d875e12b4561e8c794909e4954aebbc6fd1f5e79f381648
id: e6f47d17-4f62-40ee-a2dd-3684b78b421d
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Malware Analysis
  Report: UMBRELLA STAND - Malware targeting Fortinet devices'' (68593bc9c284f1baf4623782).'
author: AlienVault
date: '2025-06-23'
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/umbrella-stand/ncsc-mar-umbrella_stand.pdf
tags:
- process injection
- persistence
- firewall
- shoe rack
- defense evasion
- remote shell
- umbrella stand
- fortinet
- aes encryption
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: d3b88b7f640e478d8d875e12b4561e8c794909e4954aebbc6fd1f5e79f381648
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
