title: OTX FileHash-SHA1 IOC - 73e2ae5b03e20eaa4e2cafb2000d57321bfa0b5f
id: 8fdc328c-db8b-4db1-b061-a554a7f9705f
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Malware Analysis
  Report: UMBRELLA STAND - Malware targeting Fortinet devices'' (68593bc9c284f1baf4623782).'
author: AlienVault
date: '2025-06-23'
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/umbrella-stand/ncsc-mar-umbrella_stand.pdf
tags:
- process injection
- persistence
- firewall
- shoe rack
- defense evasion
- remote shell
- umbrella stand
- fortinet
- aes encryption
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 73e2ae5b03e20eaa4e2cafb2000d57321bfa0b5f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
