title: OTX FileHash-SHA1 IOC - b9e578217f2b40f846688fd0db0f8330d25c3820
id: 46b9a3ea-4dd6-400b-b6a5-a66ec492b1bc
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Checking all the
  Boxes: LapDogs, The New ORB in Town'' (685db8478a9e8c6ccdbd2255).'
author: AlienVault
date: '2025-06-26'
references:
- https://securityscorecard.com/wp-content/uploads/2025/06/LapDogs-STRIKE-Report-June-2025.pdf
tags:
- orb
- shortleash
- tls certificates
- soho devices
- southeast asia
- cve-2017-17663
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: b9e578217f2b40f846688fd0db0f8330d25c3820
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
