title: OTX FileHash-SHA256 IOC - 02ab315e4e3cf71c1632c91d4914c21b9f6e0b9aa0263f2400d6381aab759a61
id: eaf8ead2-ba6e-4f58-85af-f454bcbeb1be
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Checking all the
  Boxes: LapDogs, The New ORB in Town'' (685db8478a9e8c6ccdbd2255).'
author: AlienVault
date: '2025-06-26'
references:
- https://securityscorecard.com/wp-content/uploads/2025/06/LapDogs-STRIKE-Report-June-2025.pdf
tags:
- orb
- shortleash
- tls certificates
- soho devices
- southeast asia
- cve-2017-17663
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 02ab315e4e3cf71c1632c91d4914c21b9f6e0b9aa0263f2400d6381aab759a61
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
