title: OTX FileHash-SHA256 IOC - 6a9a0a3f0763a359737da801a48c7a0a7a75d6fa810418216628891893773540
id: 1329aa8d-e37b-43d9-a679-38cd31be91f6
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Apache Under the
  Lens: Tomcat''s Partial PUT and Camel''s Header Hijack'' (6866650f9a525176d0fa51dc).'
author: AlienVault
date: '2025-07-03'
references:
- https://unit42.paloaltonetworks.com/apache-cve-2025-24813-cve-2025-27636-cve-2025-29891
tags:
- cve-2025-24813
- exploit
- tomcat
- cve-2025-29891
- vulnerability
- apache
- cve-2025-27636
- remote code execution
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 6a9a0a3f0763a359737da801a48c7a0a7a75d6fa810418216628891893773540
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
