title: OTX FileHash-MD5 IOC - 0f9411596e254d60d181e1c2e79cb2d5
id: 6ba74390-517d-4ccd-afea-dfa7eb7cf247
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Fix the Click: Preventing
  the ClickFix Attack Vector'' (686ffe0f30bfbdfa037e4168).'
author: AlienVault
date: '2025-07-10'
references:
- https://unit42.paloaltonetworks.com/preventing-clickfix-attack-vector
tags:
- latrodectus
- typosquatting
- powershell
- clipboard hijacking
- autoit
- social engineering
- clickfix
- rat
- infostealer
- netsupport rat
- lumma stealer
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 0f9411596e254d60d181e1c2e79cb2d5
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
