title: OTX FileHash-SHA256 IOC - 84d4a4c6d7e55e201b20327ca2068992180d9ec08a6827faa4ff3534b96c3d6f
id: e5dbded8-ea21-421d-90e7-c6f45900a99b
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'The Solidity Language
  open-source package was used in a $500,000 crypto heist' (6870b25f4c4c81689f7f0c75).
author: AlienVault
date: '2025-07-11'
references:
- https://securelist.com/open-source-package-for-cursor-ai-turned-into-a-crypto-heist/116908/
tags:
- developers
- heur:trojan-psw.msil.purelogs.gen
- blockchain
- open-source
- vmdetector
- solidity
- cursor ai
- cryptocurrency
- quasar
- malicious extension
- data theft
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 84d4a4c6d7e55e201b20327ca2068992180d9ec08a6827faa4ff3534b96c3d6f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
