title: OTX FileHash-SHA256 IOC - 2c471e265409763024cdc33579c84d88d5aaf9aea1911266b875d3b7604a0eeb
id: 51adfbd4-8051-4c78-80a2-dbb13ad68d8a
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'The Solidity Language
  open-source package was used in a $500,000 crypto heist' (6870b25f4c4c81689f7f0c75).
author: AlienVault
date: '2025-07-11'
references:
- https://securelist.com/open-source-package-for-cursor-ai-turned-into-a-crypto-heist/116908/
tags:
- developers
- heur:trojan-psw.msil.purelogs.gen
- blockchain
- open-source
- vmdetector
- solidity
- cursor ai
- cryptocurrency
- quasar
- malicious extension
- data theft
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 2c471e265409763024cdc33579c84d88d5aaf9aea1911266b875d3b7604a0eeb
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
