title: OTX FileHash-SHA256 IOC - f4721f32b8d6eb856364327c21ea3c703f1787cfb4c043f87435a8876d903b2c
id: 2ce82e5c-f086-4e85-be2c-c01904943bdd
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'The Solidity Language
  open-source package was used in a $500,000 crypto heist' (6870b25f4c4c81689f7f0c75).
author: AlienVault
date: '2025-07-11'
references:
- https://securelist.com/open-source-package-for-cursor-ai-turned-into-a-crypto-heist/116908/
tags:
- developers
- heur:trojan-psw.msil.purelogs.gen
- blockchain
- open-source
- vmdetector
- solidity
- cursor ai
- cryptocurrency
- quasar
- malicious extension
- data theft
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: f4721f32b8d6eb856364327c21ea3c703f1787cfb4c043f87435a8876d903b2c
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
