title: OTX FileHash-SHA1 IOC - 0c087bbd4a24deff79063ea0994f70a1a10181cd
id: 49b981c1-d5c3-4838-a032-cf50eb038dfc
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'The Solidity Language
  open-source package was used in a $500,000 crypto heist' (6870b25f4c4c81689f7f0c75).
author: AlienVault
date: '2025-07-11'
references:
- https://securelist.com/open-source-package-for-cursor-ai-turned-into-a-crypto-heist/116908/
tags:
- developers
- heur:trojan-psw.msil.purelogs.gen
- blockchain
- open-source
- vmdetector
- solidity
- cursor ai
- cryptocurrency
- quasar
- malicious extension
- data theft
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 0c087bbd4a24deff79063ea0994f70a1a10181cd
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
