title: OTX FileHash-MD5 IOC - 75a26a138783032ee18dcfc713b1b34c
id: 39764c59-6b8e-49d4-b664-2741d23dcf8a
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Rainbow Hyena strikes
  again: new backdoor and shift in tactics'' (6876bc94560fb5bc92a8936f).'
author: AlienVault
date: '2025-07-15'
references:
- https://bi-zone.medium.com/rainbow-hyena-strikes-again-new-backdoor-and-shift-in-tactics-2dd99a10aea9?source=rss-3882bedad280------2
tags:
- phantomremote
- phishing
- backdoor
- lnk files
- Rainbow Hyena
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 75a26a138783032ee18dcfc713b1b34c
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
