title: OTX FileHash-SHA256 IOC - b683235791e3106971269259026e05fdc2a4008f703ff2a4d32642877e57429a
id: 9c387052-79ce-4ff2-804c-f6403b042339
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Rainbow Hyena strikes
  again: new backdoor and shift in tactics'' (6876bc94560fb5bc92a8936f).'
author: AlienVault
date: '2025-07-15'
references:
- https://bi-zone.medium.com/rainbow-hyena-strikes-again-new-backdoor-and-shift-in-tactics-2dd99a10aea9?source=rss-3882bedad280------2
tags:
- phantomremote
- phishing
- backdoor
- lnk files
- Rainbow Hyena
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: b683235791e3106971269259026e05fdc2a4008f703ff2a4d32642877e57429a
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
