title: OTX FileHash-MD5 IOC - 7e52be17fd33a281c70fec14805113a8
id: 537f752a-07bc-4e52-a44a-ad1284ffd542
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Rainbow Hyena strikes
  again: new backdoor and shift in tactics'' (6876bc94560fb5bc92a8936f).'
author: AlienVault
date: '2025-07-15'
references:
- https://bi-zone.medium.com/rainbow-hyena-strikes-again-new-backdoor-and-shift-in-tactics-2dd99a10aea9?source=rss-3882bedad280------2
tags:
- phantomremote
- phishing
- backdoor
- lnk files
- Rainbow Hyena
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 7e52be17fd33a281c70fec14805113a8
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
