title: OTX FileHash-MD5 IOC - 698337a1be374f3ebb9556ccdc794389
id: 903ffc71-b628-4bbe-913b-f8a94464fd86
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Rainbow Hyena strikes
  again: new backdoor and shift in tactics'' (6876bc94560fb5bc92a8936f).'
author: AlienVault
date: '2025-07-15'
references:
- https://bi-zone.medium.com/rainbow-hyena-strikes-again-new-backdoor-and-shift-in-tactics-2dd99a10aea9?source=rss-3882bedad280------2
tags:
- phantomremote
- phishing
- backdoor
- lnk files
- Rainbow Hyena
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 698337a1be374f3ebb9556ccdc794389
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
