title: OTX FileHash-SHA1 IOC - c52d70b92e41db70d4ca342c8dc32eff7883c861
id: fa14b3fb-5335-413f-a76a-0ec11e49a95d
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Rainbow Hyena strikes
  again: new backdoor and shift in tactics'' (6876bc94560fb5bc92a8936f).'
author: AlienVault
date: '2025-07-15'
references:
- https://bi-zone.medium.com/rainbow-hyena-strikes-again-new-backdoor-and-shift-in-tactics-2dd99a10aea9?source=rss-3882bedad280------2
tags:
- phantomremote
- phishing
- backdoor
- lnk files
- Rainbow Hyena
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: c52d70b92e41db70d4ca342c8dc32eff7883c861
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
