title: OTX FileHash-SHA1 IOC - efe10ad0b49e6889597b5c3254139b92ed72064c
id: 81bd9315-e40a-4e48-b5c0-c1ef3d203e2a
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Rainbow Hyena strikes
  again: new backdoor and shift in tactics'' (6876bc94560fb5bc92a8936f).'
author: AlienVault
date: '2025-07-15'
references:
- https://bi-zone.medium.com/rainbow-hyena-strikes-again-new-backdoor-and-shift-in-tactics-2dd99a10aea9?source=rss-3882bedad280------2
tags:
- phantomremote
- phishing
- backdoor
- lnk files
- Rainbow Hyena
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: efe10ad0b49e6889597b5c3254139b92ed72064c
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
