title: OTX FileHash-SHA1 IOC - 775b7e726ba6cf6d9a6463a62797c97612018066
id: 00e1e580-c615-486a-a07a-3e880ddc9ded
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Rainbow Hyena strikes
  again: new backdoor and shift in tactics'' (6876bc94560fb5bc92a8936f).'
author: AlienVault
date: '2025-07-15'
references:
- https://bi-zone.medium.com/rainbow-hyena-strikes-again-new-backdoor-and-shift-in-tactics-2dd99a10aea9?source=rss-3882bedad280------2
tags:
- phantomremote
- phishing
- backdoor
- lnk files
- Rainbow Hyena
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 775b7e726ba6cf6d9a6463a62797c97612018066
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
