title: OTX FileHash-SHA256 IOC - da53c49641b05e00cde09d47260da927ec403f01ac388605b785eac98306f9c2
id: 31e15b1f-310e-4152-bb53-e48718ca9719
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Rainbow Hyena strikes
  again: new backdoor and shift in tactics'' (6876bc94560fb5bc92a8936f).'
author: AlienVault
date: '2025-07-15'
references:
- https://bi-zone.medium.com/rainbow-hyena-strikes-again-new-backdoor-and-shift-in-tactics-2dd99a10aea9?source=rss-3882bedad280------2
tags:
- phantomremote
- phishing
- backdoor
- lnk files
- Rainbow Hyena
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: da53c49641b05e00cde09d47260da927ec403f01ac388605b785eac98306f9c2
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
