title: OTX FileHash-SHA1 IOC - 2a14a9dd1032479ab5bf8ed945ef9a22ebd4999d
id: f370276b-4e8d-4650-8931-4bdc7f8a21f8
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Rainbow Hyena strikes
  again: new backdoor and shift in tactics'' (6876bc94560fb5bc92a8936f).'
author: AlienVault
date: '2025-07-15'
references:
- https://bi-zone.medium.com/rainbow-hyena-strikes-again-new-backdoor-and-shift-in-tactics-2dd99a10aea9?source=rss-3882bedad280------2
tags:
- phantomremote
- phishing
- backdoor
- lnk files
- Rainbow Hyena
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 2a14a9dd1032479ab5bf8ed945ef9a22ebd4999d
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
