title: OTX FileHash-SHA1 IOC - d9a4fd39a55cd20d55e00d3cace3f637b8888213
id: 0fc3ee46-a624-475f-bb32-d0368dc84f1b
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Rainbow Hyena strikes
  again: new backdoor and shift in tactics'' (6876bc94560fb5bc92a8936f).'
author: AlienVault
date: '2025-07-15'
references:
- https://bi-zone.medium.com/rainbow-hyena-strikes-again-new-backdoor-and-shift-in-tactics-2dd99a10aea9?source=rss-3882bedad280------2
tags:
- phantomremote
- phishing
- backdoor
- lnk files
- Rainbow Hyena
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: d9a4fd39a55cd20d55e00d3cace3f637b8888213
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
