title: OTX FileHash-MD5 IOC - 08a92ba1d1d9e5c498dcaf53af7cd071
id: 3bc50e56-0ad2-4e6e-880c-164c53fad84b
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Rainbow Hyena strikes
  again: new backdoor and shift in tactics'' (6876bc94560fb5bc92a8936f).'
author: AlienVault
date: '2025-07-15'
references:
- https://bi-zone.medium.com/rainbow-hyena-strikes-again-new-backdoor-and-shift-in-tactics-2dd99a10aea9?source=rss-3882bedad280------2
tags:
- phantomremote
- phishing
- backdoor
- lnk files
- Rainbow Hyena
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 08a92ba1d1d9e5c498dcaf53af7cd071
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
