title: OTX FileHash-MD5 IOC - 64756bf452baa4da411e3a835c08d884
id: 2aa273f0-a635-4c36-8d01-f86bed1506f0
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''KAWA4096’s Ransomware
  Tide: Rising Threat With Borrowed Styles'' (6879f992f53c24606746d8de).'
author: AlienVault
date: '2025-07-18'
references:
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/kawa4096s-ransomware-tide-rising-threat-with-borrowed-styles
tags:
- multithreading
- ransomware
- shadow copy deletion
- kawa4096
- data leak site
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 64756bf452baa4da411e3a835c08d884
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
