title: OTX FileHash-MD5 IOC - 02b4571470d83163d103112f07f1c434
id: 17a0c0b6-67ac-4dd4-8770-ca36d0b19b05
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Defending Against
  ToolShell: SharePoint''s Latest Critical Vulnerability'' (688170c6105566470aa2189d).'
author: AlienVault
date: '2025-07-23'
references:
- https://www.sentinelone.com/blog/defending-against-toolshell-sharepoints-latest-critical-vulnerability
tags:
- cve-2025-53770
- remote code execution
- threat detection
- zero-day
- sharepoint
- toolshell
- vulnerability
- patch
- cybersecurity
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 02b4571470d83163d103112f07f1c434
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
