title: OTX FileHash-SHA1 IOC - f5b60a8ead96703080e73a1f79c3e70ff44df271
id: ad5c3353-c8f8-47e0-a821-77a9a6ae9060
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Defending Against
  ToolShell: SharePoint''s Latest Critical Vulnerability'' (688170c6105566470aa2189d).'
author: AlienVault
date: '2025-07-23'
references:
- https://www.sentinelone.com/blog/defending-against-toolshell-sharepoints-latest-critical-vulnerability
tags:
- cve-2025-53770
- remote code execution
- threat detection
- zero-day
- sharepoint
- toolshell
- vulnerability
- patch
- cybersecurity
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: f5b60a8ead96703080e73a1f79c3e70ff44df271
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
