title: OTX FileHash-SHA256 IOC - 92bb4ddb98eeaf11fc15bb32e71d0a63256a0ed826a03ba293ce3a8bf057a514
id: 0e82aa92-2ff7-4f97-b7ab-58ec7eb1f30e
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Defending Against
  ToolShell: SharePoint''s Latest Critical Vulnerability'' (688170c6105566470aa2189d).'
author: AlienVault
date: '2025-07-23'
references:
- https://www.sentinelone.com/blog/defending-against-toolshell-sharepoints-latest-critical-vulnerability
tags:
- cve-2025-53770
- remote code execution
- threat detection
- zero-day
- sharepoint
- toolshell
- vulnerability
- patch
- cybersecurity
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 92bb4ddb98eeaf11fc15bb32e71d0a63256a0ed826a03ba293ce3a8bf057a514
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
