title: OTX FileHash-SHA256 IOC - 8d3d3f3a17d233bc8562765e61f7314ca7a08130ac0fb153ffd091612920b0f2
id: 61a1ff29-ab53-47e0-8860-b6444a3ab3cd
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Defending Against
  ToolShell: SharePoint''s Latest Critical Vulnerability'' (688170c6105566470aa2189d).'
author: AlienVault
date: '2025-07-23'
references:
- https://www.sentinelone.com/blog/defending-against-toolshell-sharepoints-latest-critical-vulnerability
tags:
- cve-2025-53770
- remote code execution
- threat detection
- zero-day
- sharepoint
- toolshell
- vulnerability
- patch
- cybersecurity
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 8d3d3f3a17d233bc8562765e61f7314ca7a08130ac0fb153ffd091612920b0f2
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
