title: OTX FileHash-MD5 IOC - 30d11958bfd72fb63751e8f8113a9b04
id: 652c9f56-d537-4010-9502-63204832b135
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Targeted attacks leverage
  accounts on popular online platforms as C2 servers' (688a2f161490dbf0763365ef).
author: AlienVault
date: '2025-07-30'
references:
- https://securelist.com/cobalt-strike-attacks-using-quora-github-social-media/117085/
tags:
- cobalt strike beacon
- cobalt strike
- api obfuscation
- shellcode
- c2 communication
- spear phishing
- targeted attacks
- dll hijacking
- social media
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 30d11958bfd72fb63751e8f8113a9b04
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
