title: OTX FileHash-SHA256 IOC - 3545b3debcfc385f169c92edca55dc5c9d394580fac1482a8394af5806b996b8
id: 5626fc19-f239-4867-812e-899d2fa60058
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Sealed Chain of
  Deception: Actors leveraging Node.JS to Launch JSCeal'' (688b3d58e80e0edcd1cb1e22).'
author: AlienVault
date: '2025-07-31'
references:
- https://research.checkpoint.com/2025/jsceal-targets-crypto-apps/
tags:
- fake apps
- stealer
- cryptocurrency
- malvertising
- multi-stage
- node.js
- evasion
- jsceal
- jsc
- powershell
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 3545b3debcfc385f169c92edca55dc5c9d394580fac1482a8394af5806b996b8
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
