title: OTX FileHash-SHA256 IOC - fb35436322e9429a498f79b9abea24ca419fafab93117582c3e97f9beab3a034
id: eaac1bbe-d38d-419c-b981-5d0f9a1f9383
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Sealed Chain of
  Deception: Actors leveraging Node.JS to Launch JSCeal'' (688b3d58e80e0edcd1cb1e22).'
author: AlienVault
date: '2025-07-31'
references:
- https://research.checkpoint.com/2025/jsceal-targets-crypto-apps/
tags:
- fake apps
- stealer
- cryptocurrency
- malvertising
- multi-stage
- node.js
- evasion
- jsceal
- jsc
- powershell
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: fb35436322e9429a498f79b9abea24ca419fafab93117582c3e97f9beab3a034
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
