title: OTX FileHash-SHA256 IOC - 1d9945ac1a06f5ecef58d75452c898f39c6fa71f91274baf70404104bea63f36
id: 795d8226-710c-4498-9700-11ef7b6ad5ba
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Sealed Chain of
  Deception: Actors leveraging Node.JS to Launch JSCeal'' (688b3d58e80e0edcd1cb1e22).'
author: AlienVault
date: '2025-07-31'
references:
- https://research.checkpoint.com/2025/jsceal-targets-crypto-apps/
tags:
- fake apps
- stealer
- cryptocurrency
- malvertising
- multi-stage
- node.js
- evasion
- jsceal
- jsc
- powershell
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 1d9945ac1a06f5ecef58d75452c898f39c6fa71f91274baf70404104bea63f36
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
