title: OTX FileHash-SHA256 IOC - a22d15afdeeb983d73255e274a8b62b76d267ca1cf943228d17992ceb6fd1643
id: a7dfe030-a0db-4f3a-9948-c82492bed9f5
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Sealed Chain of
  Deception: Actors leveraging Node.JS to Launch JSCeal'' (688b3d58e80e0edcd1cb1e22).'
author: AlienVault
date: '2025-07-31'
references:
- https://research.checkpoint.com/2025/jsceal-targets-crypto-apps/
tags:
- fake apps
- stealer
- cryptocurrency
- malvertising
- multi-stage
- node.js
- evasion
- jsceal
- jsc
- powershell
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: a22d15afdeeb983d73255e274a8b62b76d267ca1cf943228d17992ceb6fd1643
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
