title: OTX FileHash-SHA1 IOC - a5228797c09cee8cccfcddc5a2ace144d5302cc2
id: d8c9894d-7df3-4a57-82ea-80b63f9d85fd
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Sealed Chain of
  Deception: Actors leveraging Node.JS to Launch JSCeal'' (688b3d58e80e0edcd1cb1e22).'
author: AlienVault
date: '2025-07-31'
references:
- https://research.checkpoint.com/2025/jsceal-targets-crypto-apps/
tags:
- fake apps
- stealer
- cryptocurrency
- malvertising
- multi-stage
- node.js
- evasion
- jsceal
- jsc
- powershell
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: a5228797c09cee8cccfcddc5a2ace144d5302cc2
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
