title: OTX FileHash-SHA256 IOC - 146173888f2910ab7e5a8bfb096af6e2b245f049f5b89f53052d509dee2422e5
id: d4e86f3d-dbc0-46ef-8448-7553226af734
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Sealed Chain of
  Deception: Actors leveraging Node.JS to Launch JSCeal'' (688b3d58e80e0edcd1cb1e22).'
author: AlienVault
date: '2025-07-31'
references:
- https://research.checkpoint.com/2025/jsceal-targets-crypto-apps/
tags:
- fake apps
- stealer
- cryptocurrency
- malvertising
- multi-stage
- node.js
- evasion
- jsceal
- jsc
- powershell
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 146173888f2910ab7e5a8bfb096af6e2b245f049f5b89f53052d509dee2422e5
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
