title: OTX FileHash-SHA256 IOC - 27867b97cd0228c773e10c63859c39afcb24966b7b662542a31a24fbb212c754
id: 942e4205-3fb1-4778-bae0-d596ca1c816d
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Sealed Chain of
  Deception: Actors leveraging Node.JS to Launch JSCeal'' (688b3d58e80e0edcd1cb1e22).'
author: AlienVault
date: '2025-07-31'
references:
- https://research.checkpoint.com/2025/jsceal-targets-crypto-apps/
tags:
- fake apps
- stealer
- cryptocurrency
- malvertising
- multi-stage
- node.js
- evasion
- jsceal
- jsc
- powershell
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 27867b97cd0228c773e10c63859c39afcb24966b7b662542a31a24fbb212c754
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
