title: OTX FileHash-SHA256 IOC - 7ee0db8bade12d9861ccf8f43334a217c587d97bc0828238a98a325aaff75f8e
id: 69f0dfc0-0ff6-45ce-ac5b-7eec70d0dcb8
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Sealed Chain of
  Deception: Actors leveraging Node.JS to Launch JSCeal'' (688b3d58e80e0edcd1cb1e22).'
author: AlienVault
date: '2025-07-31'
references:
- https://research.checkpoint.com/2025/jsceal-targets-crypto-apps/
tags:
- fake apps
- stealer
- cryptocurrency
- malvertising
- multi-stage
- node.js
- evasion
- jsceal
- jsc
- powershell
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 7ee0db8bade12d9861ccf8f43334a217c587d97bc0828238a98a325aaff75f8e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
