title: OTX FileHash-SHA256 IOC - c417e37fb42f8b7fa282992a11b1d75840b035b92e0e39891cf153cc373c0c4e
id: 07ef40ce-1d5f-453e-bff9-7ca244ee7b89
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Sealed Chain of
  Deception: Actors leveraging Node.JS to Launch JSCeal'' (688b3d58e80e0edcd1cb1e22).'
author: AlienVault
date: '2025-07-31'
references:
- https://research.checkpoint.com/2025/jsceal-targets-crypto-apps/
tags:
- fake apps
- stealer
- cryptocurrency
- malvertising
- multi-stage
- node.js
- evasion
- jsceal
- jsc
- powershell
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: c417e37fb42f8b7fa282992a11b1d75840b035b92e0e39891cf153cc373c0c4e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
