title: OTX FileHash-SHA256 IOC - de213ebc44c614d0b2324787e267183dbbbbb19e1ad866435a322ee00e24e7b6
id: 8d28033f-f8c1-4507-8d9a-f10cb4441f2f
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Sealed Chain of
  Deception: Actors leveraging Node.JS to Launch JSCeal'' (688b3d58e80e0edcd1cb1e22).'
author: AlienVault
date: '2025-07-31'
references:
- https://research.checkpoint.com/2025/jsceal-targets-crypto-apps/
tags:
- fake apps
- stealer
- cryptocurrency
- malvertising
- multi-stage
- node.js
- evasion
- jsceal
- jsc
- powershell
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: de213ebc44c614d0b2324787e267183dbbbbb19e1ad866435a322ee00e24e7b6
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
