title: OTX FileHash-MD5 IOC - 6557b0c60f7bfd1fec9ffa10fb4dce9e
id: 32e188aa-2bff-4c36-8be2-e8c292ff2928
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Sealed Chain of
  Deception: Actors leveraging Node.JS to Launch JSCeal'' (688b3d58e80e0edcd1cb1e22).'
author: AlienVault
date: '2025-07-31'
references:
- https://research.checkpoint.com/2025/jsceal-targets-crypto-apps/
tags:
- fake apps
- stealer
- cryptocurrency
- malvertising
- multi-stage
- node.js
- evasion
- jsceal
- jsc
- powershell
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 6557b0c60f7bfd1fec9ffa10fb4dce9e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
