title: OTX FileHash-SHA256 IOC - f8d598d28dbb8294a5c709ab23d51e29e652ab47d5a317aa31f6302481159458
id: ce9a3f79-2e2d-4ba4-af91-e4e49d04ebfa
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Sealed Chain of
  Deception: Actors leveraging Node.JS to Launch JSCeal'' (688b3d58e80e0edcd1cb1e22).'
author: AlienVault
date: '2025-07-31'
references:
- https://research.checkpoint.com/2025/jsceal-targets-crypto-apps/
tags:
- fake apps
- stealer
- cryptocurrency
- malvertising
- multi-stage
- node.js
- evasion
- jsceal
- jsc
- powershell
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: f8d598d28dbb8294a5c709ab23d51e29e652ab47d5a317aa31f6302481159458
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
