title: OTX FileHash-SHA256 IOC - dc129f059e6d58e1f38e0eed886a5fb165c069a8028a4c7debea1d8a028e0231
id: 9afd23ca-7ec1-40a8-939e-6a0212287f9c
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Email-Delivered
  RMM: Abusing PDFs for Silent Initial Access'' (6894c40fb08284d4bdc0c05a).'
author: AlienVault
date: '2025-08-07'
references:
- https://labs.withsecure.com/publications/email-delivered-rmm
tags:
- phishing
- pdf
- initial access
- rmm
- social engineering
- france
- luxembourg
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: dc129f059e6d58e1f38e0eed886a5fb165c069a8028a4c7debea1d8a028e0231
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
