title: OTX FileHash-SHA256 IOC - 81e3329a89f839952ff0ffbc9cd3e3c80796115184e9b5a0bccba99d806d8b61
id: fc312f3e-cffd-4d67-8687-ac85f4712ba5
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Email-Delivered
  RMM: Abusing PDFs for Silent Initial Access'' (6894c40fb08284d4bdc0c05a).'
author: AlienVault
date: '2025-08-07'
references:
- https://labs.withsecure.com/publications/email-delivered-rmm
tags:
- phishing
- pdf
- initial access
- rmm
- social engineering
- france
- luxembourg
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 81e3329a89f839952ff0ffbc9cd3e3c80796115184e9b5a0bccba99d806d8b61
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
