title: OTX FileHash-SHA256 IOC - 51159f622351a896439f605349301395c84cb68c245230ec76767e906d295391
id: e5172e1b-1103-4fbb-9183-60327ebcd65f
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Email-Delivered
  RMM: Abusing PDFs for Silent Initial Access'' (6894c40fb08284d4bdc0c05a).'
author: AlienVault
date: '2025-08-07'
references:
- https://labs.withsecure.com/publications/email-delivered-rmm
tags:
- phishing
- pdf
- initial access
- rmm
- social engineering
- france
- luxembourg
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 51159f622351a896439f605349301395c84cb68c245230ec76767e906d295391
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
