title: OTX FileHash-SHA256 IOC - d19f13124449b4d89028e80579174a3d00cd10e0e28c3dd287b36ff50a5f3d0a
id: 8aadebd1-28b2-4751-9d68-d81a274cef84
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Email-Delivered
  RMM: Abusing PDFs for Silent Initial Access'' (6894c40fb08284d4bdc0c05a).'
author: AlienVault
date: '2025-08-07'
references:
- https://labs.withsecure.com/publications/email-delivered-rmm
tags:
- phishing
- pdf
- initial access
- rmm
- social engineering
- france
- luxembourg
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: d19f13124449b4d89028e80579174a3d00cd10e0e28c3dd287b36ff50a5f3d0a
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
