title: OTX FileHash-SHA1 IOC - 6889d3d9bd417eb8468a40e48adf2839856fce60
id: 1b492d50-45c9-48f5-91f6-f41ba78d13fa
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Email-Delivered
  RMM: Abusing PDFs for Silent Initial Access'' (6894c40fb08284d4bdc0c05a).'
author: AlienVault
date: '2025-08-07'
references:
- https://labs.withsecure.com/publications/email-delivered-rmm
tags:
- phishing
- pdf
- initial access
- rmm
- social engineering
- france
- luxembourg
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 6889d3d9bd417eb8468a40e48adf2839856fce60
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
