title: OTX FileHash-SHA256 IOC - 9395edd13d1d71f64b49503fb1c04836bcbb16b9bfe2b3744d4d53f49aa08385
id: 6da78c4d-fd3f-43ac-a1c0-a5c07b5814b1
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Email-Delivered
  RMM: Abusing PDFs for Silent Initial Access'' (6894c40fb08284d4bdc0c05a).'
author: AlienVault
date: '2025-08-07'
references:
- https://labs.withsecure.com/publications/email-delivered-rmm
tags:
- phishing
- pdf
- initial access
- rmm
- social engineering
- france
- luxembourg
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 9395edd13d1d71f64b49503fb1c04836bcbb16b9bfe2b3744d4d53f49aa08385
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
