title: OTX FileHash-SHA256 IOC - 129df778cde4bb19049d9f48bfaaabf7baec541072dd64c0024b55d63e793a9f
id: 6264ebfe-e704-4e78-8ffc-20caf2ed52d8
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Email-Delivered
  RMM: Abusing PDFs for Silent Initial Access'' (6894c40fb08284d4bdc0c05a).'
author: AlienVault
date: '2025-08-07'
references:
- https://labs.withsecure.com/publications/email-delivered-rmm
tags:
- phishing
- pdf
- initial access
- rmm
- social engineering
- france
- luxembourg
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 129df778cde4bb19049d9f48bfaaabf7baec541072dd64c0024b55d63e793a9f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
