title: OTX FileHash-SHA256 IOC - 0d8d1243844659f2b7eb7f0c7bec3057c05a0e3731f8330112b6d04dad718528
id: 590e6b83-ffde-439c-866f-9250c047090e
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Email-Delivered
  RMM: Abusing PDFs for Silent Initial Access'' (6894c40fb08284d4bdc0c05a).'
author: AlienVault
date: '2025-08-07'
references:
- https://labs.withsecure.com/publications/email-delivered-rmm
tags:
- phishing
- pdf
- initial access
- rmm
- social engineering
- france
- luxembourg
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 0d8d1243844659f2b7eb7f0c7bec3057c05a0e3731f8330112b6d04dad718528
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
