title: OTX FileHash-SHA256 IOC - 7e10d37f2abb2bbdf1c4f7bf29277cf01a385301682068a82006563445f80a20
id: 120acdb7-f621-4f3b-ba8c-6be9fd860afc
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Email-Delivered
  RMM: Abusing PDFs for Silent Initial Access'' (6894c40fb08284d4bdc0c05a).'
author: AlienVault
date: '2025-08-07'
references:
- https://labs.withsecure.com/publications/email-delivered-rmm
tags:
- phishing
- pdf
- initial access
- rmm
- social engineering
- france
- luxembourg
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 7e10d37f2abb2bbdf1c4f7bf29277cf01a385301682068a82006563445f80a20
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
