title: OTX FileHash-SHA256 IOC - e694758dc5495d71092ea50a8226400d38a18095e6936e063038c65374949016
id: e2589b54-4955-4b19-8313-9289912920ff
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Email-Delivered
  RMM: Abusing PDFs for Silent Initial Access'' (6894c40fb08284d4bdc0c05a).'
author: AlienVault
date: '2025-08-07'
references:
- https://labs.withsecure.com/publications/email-delivered-rmm
tags:
- phishing
- pdf
- initial access
- rmm
- social engineering
- france
- luxembourg
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: e694758dc5495d71092ea50a8226400d38a18095e6936e063038c65374949016
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
