title: OTX FileHash-MD5 IOC - c78a99a4e6c04ae3c8d49c8351818090
id: 2af39447-f6ec-43a5-a988-0f27fd5560a9
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Unmasking the SVG
  Threat: How Hackers Use Vector Graphics for Phishing Attacks'' (6895174bde6ff52ca61cd121).'
author: AlienVault
date: '2025-08-07'
references:
- https://www.seqrite.com/blog/unmasking-the-svg-threat-how-hackers-use-vector-graphics-for-phishing-attacks
tags:
- cloud storage
- javascript
- phishing
- credential theft
- browser execution
- captcha
- email attachments
- svg
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: c78a99a4e6c04ae3c8d49c8351818090
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
