title: OTX FileHash-MD5 IOC - 4aea855cde4c963016ed36566ae113b7
id: 4e53c735-33ca-41ce-a752-2681761170ca
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Unmasking the SVG
  Threat: How Hackers Use Vector Graphics for Phishing Attacks'' (6895174bde6ff52ca61cd121).'
author: AlienVault
date: '2025-08-07'
references:
- https://www.seqrite.com/blog/unmasking-the-svg-threat-how-hackers-use-vector-graphics-for-phishing-attacks
tags:
- cloud storage
- javascript
- phishing
- credential theft
- browser execution
- captcha
- email attachments
- svg
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 4aea855cde4c963016ed36566ae113b7
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
