title: OTX FileHash-SHA1 IOC - 01d32fe88ecdea2b934a00805e138034bf85bf83
id: c98239d1-97a3-47dc-b602-9772dec26f93
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Update WinRAR tools
  now: RomCom and others exploiting zero-day vulnerability'' (689a04b1cf818643f79c1bd3).'
author: AlienVault
date: '2025-08-11'
references:
- https://www.welivesecurity.com/en/eset-research/update-winrar-tools-now-romcom-and-others-exploiting-zero-day-vulnerability
tags:
- rustyclaw
- winrar
- vulnerability
- mythic
- zero-day
- spearphishing
- russia-aligned
- cve-2025-8088
- backdoor
- exploit
- snipbot
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 01d32fe88ecdea2b934a00805e138034bf85bf83
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
