title: OTX FileHash-SHA1 IOC - ae687bef963cb30a3788e34cc18046f54c41ffba
id: fe749ad4-a2f3-4e85-ac2c-72b9fbdf730c
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Update WinRAR tools
  now: RomCom and others exploiting zero-day vulnerability'' (689a04b1cf818643f79c1bd3).'
author: AlienVault
date: '2025-08-11'
references:
- https://www.welivesecurity.com/en/eset-research/update-winrar-tools-now-romcom-and-others-exploiting-zero-day-vulnerability
tags:
- rustyclaw
- winrar
- vulnerability
- mythic
- zero-day
- spearphishing
- russia-aligned
- cve-2025-8088
- backdoor
- exploit
- snipbot
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: ae687bef963cb30a3788e34cc18046f54c41ffba
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
