title: OTX FileHash-SHA1 IOC - 1f25e062e8e9a4f1792c3eac6462694410f0f1ca
id: 093c4288-aeb2-4671-a63f-1374f3443033
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Update WinRAR tools
  now: RomCom and others exploiting zero-day vulnerability'' (689a04b1cf818643f79c1bd3).'
author: AlienVault
date: '2025-08-11'
references:
- https://www.welivesecurity.com/en/eset-research/update-winrar-tools-now-romcom-and-others-exploiting-zero-day-vulnerability
tags:
- rustyclaw
- winrar
- vulnerability
- mythic
- zero-day
- spearphishing
- russia-aligned
- cve-2025-8088
- backdoor
- exploit
- snipbot
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 1f25e062e8e9a4f1792c3eac6462694410f0f1ca
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
