title: OTX FileHash-SHA1 IOC - f77dba76010a9988c9ceb8e420c96aebc071b889
id: ab4e8d18-1130-46ba-b0a8-c6328a107727
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Update WinRAR tools
  now: RomCom and others exploiting zero-day vulnerability'' (689a04b1cf818643f79c1bd3).'
author: AlienVault
date: '2025-08-11'
references:
- https://www.welivesecurity.com/en/eset-research/update-winrar-tools-now-romcom-and-others-exploiting-zero-day-vulnerability
tags:
- rustyclaw
- winrar
- vulnerability
- mythic
- zero-day
- spearphishing
- russia-aligned
- cve-2025-8088
- backdoor
- exploit
- snipbot
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: f77dba76010a9988c9ceb8e420c96aebc071b889
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
