title: OTX FileHash-SHA1 IOC - ab79081d0e26ea278d3d45da247335a545d0512e
id: e6209f10-1808-479e-841d-d213e1be08e1
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Update WinRAR tools
  now: RomCom and others exploiting zero-day vulnerability'' (689a04b1cf818643f79c1bd3).'
author: AlienVault
date: '2025-08-11'
references:
- https://www.welivesecurity.com/en/eset-research/update-winrar-tools-now-romcom-and-others-exploiting-zero-day-vulnerability
tags:
- rustyclaw
- winrar
- vulnerability
- mythic
- zero-day
- spearphishing
- russia-aligned
- cve-2025-8088
- backdoor
- exploit
- snipbot
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: ab79081d0e26ea278d3d45da247335a545d0512e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
