title: OTX FileHash-SHA1 IOC - 1aea26a2e2a7711f89d06165e676e11769e2fd68
id: 401395aa-928e-4f46-87d9-92d7c3d00e9e
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Update WinRAR tools
  now: RomCom and others exploiting zero-day vulnerability'' (689a04b1cf818643f79c1bd3).'
author: AlienVault
date: '2025-08-11'
references:
- https://www.welivesecurity.com/en/eset-research/update-winrar-tools-now-romcom-and-others-exploiting-zero-day-vulnerability
tags:
- rustyclaw
- winrar
- vulnerability
- mythic
- zero-day
- spearphishing
- russia-aligned
- cve-2025-8088
- backdoor
- exploit
- snipbot
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 1aea26a2e2a7711f89d06165e676e11769e2fd68
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
