title: OTX FileHash-SHA1 IOC - 371a5b8ba86fbcab80d4e0087d2aa0d8ffddc70b
id: 01b70895-4e74-44dc-924f-e32be29fa497
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Update WinRAR tools
  now: RomCom and others exploiting zero-day vulnerability'' (689a04b1cf818643f79c1bd3).'
author: AlienVault
date: '2025-08-11'
references:
- https://www.welivesecurity.com/en/eset-research/update-winrar-tools-now-romcom-and-others-exploiting-zero-day-vulnerability
tags:
- rustyclaw
- winrar
- vulnerability
- mythic
- zero-day
- spearphishing
- russia-aligned
- cve-2025-8088
- backdoor
- exploit
- snipbot
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 371a5b8ba86fbcab80d4e0087d2aa0d8ffddc70b
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
