title: OTX FileHash-SHA1 IOC - c340625c779911165e3983c77fd60855a2575275
id: 8c315b25-1089-428d-8a73-12f883ec1687
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Update WinRAR tools
  now: RomCom and others exploiting zero-day vulnerability'' (689a04b1cf818643f79c1bd3).'
author: AlienVault
date: '2025-08-11'
references:
- https://www.welivesecurity.com/en/eset-research/update-winrar-tools-now-romcom-and-others-exploiting-zero-day-vulnerability
tags:
- rustyclaw
- winrar
- vulnerability
- mythic
- zero-day
- spearphishing
- russia-aligned
- cve-2025-8088
- backdoor
- exploit
- snipbot
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: c340625c779911165e3983c77fd60855a2575275
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
