title: OTX FileHash-SHA256 IOC - 515bd71a8b3c2bce7b40b89ddfe2e94d332b0779d569c58117f8dcdcb8a91ed9
id: 7c654178-e30a-4b5f-a674-8a5b212541d5
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''''Blue Locker''
  Analysis: Ransomware Targeting Oil & Gas Sector in Pakistan'' (689f27de103cef61ad777375).'
author: AlienVault
date: '2025-08-15'
references:
- https://www.resecurity.com/blog/article/blue-locker-analysis-ransomware-targeting-oil-gas-sector-in-pakistan
tags:
- ransomware
- phishing
- pakistan
- oil and gas
- ncert
- cybersecurity
- proton
- encryption
- shinra
- blue locker
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 515bd71a8b3c2bce7b40b89ddfe2e94d332b0779d569c58117f8dcdcb8a91ed9
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
