title: OTX FileHash-SHA256 IOC - d3cc6cc4538d57f2d1f8a9d46a3e8be73ed849f7fe37d1d969c0377cf1d0fadc
id: c32cb1a6-1a94-4ad8-8711-77edb4b20a91
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''''Blue Locker''
  Analysis: Ransomware Targeting Oil & Gas Sector in Pakistan'' (689f27de103cef61ad777375).'
author: AlienVault
date: '2025-08-15'
references:
- https://www.resecurity.com/blog/article/blue-locker-analysis-ransomware-targeting-oil-gas-sector-in-pakistan
tags:
- ransomware
- phishing
- pakistan
- oil and gas
- ncert
- cybersecurity
- proton
- encryption
- shinra
- blue locker
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: d3cc6cc4538d57f2d1f8a9d46a3e8be73ed849f7fe37d1d969c0377cf1d0fadc
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
