title: OTX FileHash-SHA1 IOC - 4e6d0fd9824de4d27b0957953f6b5a32bcb74cd6
id: 9d376937-bbee-4835-821e-3d78110a4e32
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Noodlophile Stealer
  Evolves: Targeted Copyright Phishing Hits Enterprises with Social Media Footprints''
  (68a4f2609ccc8bd3337dfda6).'
author: AlienVault
date: '2025-08-19'
references:
- https://www.morphisec.com/blog/noodlophile-stealer-evolves-targeted-copyright-phishing-hits-enterprises-with-social-media-footprints/
tags:
- facebook
- select
- morphisec
- ai video
- noodlophile
- dll sideloading
- web data
- new noodlophile
- telegram
- spear
- persistence
- python
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 4e6d0fd9824de4d27b0957953f6b5a32bcb74cd6
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
