title: OTX FileHash-SHA256 IOC - 5ad456333451fcbd69977a62d4728b1fc8b5bdebee763d2b6725226078daeaf8
id: 2cacb7d7-5ed2-4d67-84ac-adb7c81946af
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Noodlophile Stealer
  Evolves: Targeted Copyright Phishing Hits Enterprises with Social Media Footprints''
  (68a4f2609ccc8bd3337dfda6).'
author: AlienVault
date: '2025-08-19'
references:
- https://www.morphisec.com/blog/noodlophile-stealer-evolves-targeted-copyright-phishing-hits-enterprises-with-social-media-footprints/
tags:
- facebook
- select
- morphisec
- ai video
- noodlophile
- dll sideloading
- web data
- new noodlophile
- telegram
- spear
- persistence
- python
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 5ad456333451fcbd69977a62d4728b1fc8b5bdebee763d2b6725226078daeaf8
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
