title: OTX FileHash-SHA256 IOC - 693789e4b9fb280fa32541e9a548b7fefd98775b8f075e370464db3764bb15b9
id: 4073aaf7-caec-4576-8531-c82774aa19e6
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Noodlophile Stealer
  Evolves: Targeted Copyright Phishing Hits Enterprises with Social Media Footprints''
  (68a4f2609ccc8bd3337dfda6).'
author: AlienVault
date: '2025-08-19'
references:
- https://www.morphisec.com/blog/noodlophile-stealer-evolves-targeted-copyright-phishing-hits-enterprises-with-social-media-footprints/
tags:
- facebook
- select
- morphisec
- ai video
- noodlophile
- dll sideloading
- web data
- new noodlophile
- telegram
- spear
- persistence
- python
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 693789e4b9fb280fa32541e9a548b7fefd98775b8f075e370464db3764bb15b9
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
