title: OTX FileHash-SHA256 IOC - d0b0551e8988a9f81b80933ec68efabb47cd12acaeffa79c42564863424a376e
id: 339cd072-1cfe-4b9c-a018-26320fab0d16
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Noodlophile Stealer
  Evolves: Targeted Copyright Phishing Hits Enterprises with Social Media Footprints''
  (68a4f2609ccc8bd3337dfda6).'
author: AlienVault
date: '2025-08-19'
references:
- https://www.morphisec.com/blog/noodlophile-stealer-evolves-targeted-copyright-phishing-hits-enterprises-with-social-media-footprints/
tags:
- facebook
- select
- morphisec
- ai video
- noodlophile
- dll sideloading
- web data
- new noodlophile
- telegram
- spear
- persistence
- python
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: d0b0551e8988a9f81b80933ec68efabb47cd12acaeffa79c42564863424a376e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
