title: OTX FileHash-SHA256 IOC - a05cf0002a135ade9771a1aa48109cc8aa104e7afa1c56af998f9aba2a1e3f05
id: 953b12a1-f01b-46c8-8f25-26b141e0a72a
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Noodlophile Stealer
  Evolves: Targeted Copyright Phishing Hits Enterprises with Social Media Footprints''
  (68a4f2609ccc8bd3337dfda6).'
author: AlienVault
date: '2025-08-19'
references:
- https://www.morphisec.com/blog/noodlophile-stealer-evolves-targeted-copyright-phishing-hits-enterprises-with-social-media-footprints/
tags:
- facebook
- select
- morphisec
- ai video
- noodlophile
- dll sideloading
- web data
- new noodlophile
- telegram
- spear
- persistence
- python
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: a05cf0002a135ade9771a1aa48109cc8aa104e7afa1c56af998f9aba2a1e3f05
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
