title: OTX FileHash-SHA256 IOC - 707223112e8ced786e7d1ed43224e73606b3e2efec615bb3a22fe8cc11d3bb54
id: 158edc72-9670-4846-a6a0-f2f279ff7acc
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Noodlophile Stealer
  Evolves: Targeted Copyright Phishing Hits Enterprises with Social Media Footprints''
  (68a4f2609ccc8bd3337dfda6).'
author: AlienVault
date: '2025-08-19'
references:
- https://www.morphisec.com/blog/noodlophile-stealer-evolves-targeted-copyright-phishing-hits-enterprises-with-social-media-footprints/
tags:
- facebook
- select
- morphisec
- ai video
- noodlophile
- dll sideloading
- web data
- new noodlophile
- telegram
- spear
- persistence
- python
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 707223112e8ced786e7d1ed43224e73606b3e2efec615bb3a22fe8cc11d3bb54
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
