title: OTX FileHash-SHA256 IOC - 2e610c97e5bae10966811b78fc9e700117123b6a12953bf819ced9b25eb9a507
id: a6273c48-1bbe-41ad-aca4-e4d33c3357b6
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Noodlophile Stealer
  Evolves: Targeted Copyright Phishing Hits Enterprises with Social Media Footprints''
  (68a4f2609ccc8bd3337dfda6).'
author: AlienVault
date: '2025-08-19'
references:
- https://www.morphisec.com/blog/noodlophile-stealer-evolves-targeted-copyright-phishing-hits-enterprises-with-social-media-footprints/
tags:
- facebook
- select
- morphisec
- ai video
- noodlophile
- dll sideloading
- web data
- new noodlophile
- telegram
- spear
- persistence
- python
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 2e610c97e5bae10966811b78fc9e700117123b6a12953bf819ced9b25eb9a507
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
