title: OTX FileHash-SHA256 IOC - c213a15add88e8c1cbb06fc4690c02046fa74027848bcb97c7d961ffc21155c6
id: b1b4e130-a488-43e2-a71a-6e5def20fa17
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Noodlophile Stealer
  Evolves: Targeted Copyright Phishing Hits Enterprises with Social Media Footprints''
  (68a4f2609ccc8bd3337dfda6).'
author: AlienVault
date: '2025-08-19'
references:
- https://www.morphisec.com/blog/noodlophile-stealer-evolves-targeted-copyright-phishing-hits-enterprises-with-social-media-footprints/
tags:
- facebook
- select
- morphisec
- ai video
- noodlophile
- dll sideloading
- web data
- new noodlophile
- telegram
- spear
- persistence
- python
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: c213a15add88e8c1cbb06fc4690c02046fa74027848bcb97c7d961ffc21155c6
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
