title: OTX FileHash-SHA1 IOC - e10361a11f8a7f232ac3cb2125c1875a0a69a3e4
id: 1362cc53-fc17-4f40-a00d-3a8d5e43b7ce
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Cherry pie, Douglas
  firs and the last trip of the summer' (68a79dab56f9a513279200c7).
author: AlienVault
date: '2025-08-21'
references:
- https://blog.talosintelligence.com/cherry-pie-douglas-firs-and-the-last-trip-of-the-summer/
tags:
- embassy targets
- cve-2018-0171
- xenorat
- travel security
- ps1bot
- ransomware
- cisco vulnerability
- data breach
- cybersecurity tips
- 5g attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: e10361a11f8a7f232ac3cb2125c1875a0a69a3e4
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
