title: OTX FileHash-SHA1 IOC - 31a2fd3c593b4a730430e0c0a689b4e28270f1b5
id: 48630567-ac3d-4aa2-b516-4c34c572fe00
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 31a2fd3c593b4a730430e0c0a689b4e28270f1b5
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
