title: OTX FileHash-MD5 IOC - 73680a7a538ddab38a2f8092e25276e1
id: 53b5a8dd-e956-4e99-8c5c-fdaf4de43e76
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 73680a7a538ddab38a2f8092e25276e1
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
