title: OTX FileHash-SHA1 IOC - e018304ee662319225bc32755eee149d8d7d9f2e
id: 5c38e36e-7f98-4802-aa4d-0ad15af7b760
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: e018304ee662319225bc32755eee149d8d7d9f2e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
