title: OTX FileHash-SHA256 IOC - 0c4434117b1c9c13de67a68034c1295007d274aa6c151c2adff7b29c6092c9b9
id: 162588a7-0abb-43dd-960e-ee6925f9e54e
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 0c4434117b1c9c13de67a68034c1295007d274aa6c151c2adff7b29c6092c9b9
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
