title: OTX FileHash-SHA1 IOC - d8554d2fdbae21927f1f10f199b73dbc6b351ad3
id: c43a09dc-f32b-4fea-8929-a652daaea18e
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: d8554d2fdbae21927f1f10f199b73dbc6b351ad3
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
