title: OTX FileHash-SHA1 IOC - 35c775748501bf3f57cddee44e3dfed1d6a41b87
id: 1bfb7291-06c1-4333-aa68-ba7d03a486f6
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 35c775748501bf3f57cddee44e3dfed1d6a41b87
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
