title: OTX FileHash-SHA256 IOC - 8586756c3be19a1568752cfca3c878d8cf9dd50e013e2e02a3d3fea3fa4a38cb
id: d54a0cb6-8d84-4cb3-8c91-f3d88e7181ef
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 8586756c3be19a1568752cfca3c878d8cf9dd50e013e2e02a3d3fea3fa4a38cb
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
