title: OTX FileHash-MD5 IOC - 4360b3705243ef501094ed160a09f42f
id: 72fabbbf-26cb-40c4-9452-4554c4af1827
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 4360b3705243ef501094ed160a09f42f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
