title: OTX FileHash-SHA256 IOC - 8d2fba04267db75928cabc34769e6afe2c0bc35eaa9a6f51b3988ff54016a1e1
id: 0d38d8e7-94c5-4da8-b27c-fe0e9471b799
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 8d2fba04267db75928cabc34769e6afe2c0bc35eaa9a6f51b3988ff54016a1e1
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
