title: OTX FileHash-MD5 IOC - 014120441aa6cd24ad2914e06ae4f5fa
id: 4d9e2901-6524-45a1-ad4c-5ec8e652e616
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 014120441aa6cd24ad2914e06ae4f5fa
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
