title: OTX FileHash-SHA1 IOC - 3c734b9c24087898cfbfb58b3a53c44592356389
id: 9d124fad-0a7d-45a4-acfb-1eebf9b4b5e6
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 3c734b9c24087898cfbfb58b3a53c44592356389
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
