title: OTX FileHash-SHA256 IOC - aaf1409baa2a87d42a24bfea8b26a0eb8ca9b2e961f96c5e4179fd2d568f1b8b
id: c713d0ed-7c5b-403f-8525-5545ae8cf80d
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: aaf1409baa2a87d42a24bfea8b26a0eb8ca9b2e961f96c5e4179fd2d568f1b8b
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
