title: OTX FileHash-SHA1 IOC - f88410271b51ba751242e31384d50abf2d6165a8
id: 19e34a7b-4a95-4f80-b3a8-e41c9514d0d3
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: f88410271b51ba751242e31384d50abf2d6165a8
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
