title: OTX FileHash-SHA256 IOC - a65d7e5388aba8b7b633a3007f2627a6e4e23831dc2af704c70ed2d163442a18
id: 844ba170-fb7c-4deb-8654-e0bdcfda7b27
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: a65d7e5388aba8b7b633a3007f2627a6e4e23831dc2af704c70ed2d163442a18
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
