title: OTX FileHash-SHA1 IOC - 28e5c478144088a1ce31a831354f042435e52ea6
id: 6aa85f50-3404-49bf-95fc-fa8b8605157e
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 28e5c478144088a1ce31a831354f042435e52ea6
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
