title: OTX FileHash-MD5 IOC - f4728bb8112ec3dd0a111d7e269c4b4b
id: 5b052c02-176d-42aa-b7a0-fd66d6dbf898
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'TAG-144's Persistent
  Grip on South American Organizations' (68add0f60282b650edbd7169).
author: AlienVault
date: '2025-08-26'
references:
- https://www.recordedfuture.com/research/tag-144s-persistent-grip-on-south-american-organizations
tags:
- limerat
- dcrat
- asyncrat
- south america
- xworm
- bitrat
- quasarrat
- remcos rat
- blotchyquasar
- njrat
- TAG-144
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: f4728bb8112ec3dd0a111d7e269c4b4b
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
