title: OTX FileHash-SHA256 IOC - c51e59b60975fd8e8cddac0827068da0c8a4c3928c6105917cdb28b95a7cc551
id: c8c1cb8e-783a-4c47-a6d9-d3b5b21c09e5
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'TAG-144's Persistent
  Grip on South American Organizations' (68add0f60282b650edbd7169).
author: AlienVault
date: '2025-08-26'
references:
- https://www.recordedfuture.com/research/tag-144s-persistent-grip-on-south-american-organizations
tags:
- limerat
- dcrat
- asyncrat
- south america
- xworm
- bitrat
- quasarrat
- remcos rat
- blotchyquasar
- njrat
- TAG-144
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: c51e59b60975fd8e8cddac0827068da0c8a4c3928c6105917cdb28b95a7cc551
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
