title: OTX FileHash-SHA256 IOC - f5a80b08d46b947ca42ac8dbd0094772aa3111f020a4d72cb2edc4a6c9c37926
id: 2d4b855b-8fa0-4f76-9f71-968dd039391b
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'ZipLine Phishing Campaign
  Targets U.S. Manufacturing' (68af58ce8cb7bcf7195c203f).
author: AlienVault
date: '2025-08-27'
references:
- A sophisticated phishing campaign called ZipLine is targeting U.S. manufacturing
  companies, especially those in supply chain-critical sectors. The attackers initiate
  contact through company contact forms, leading to weeks-long email conversations
  before delivering malicious payloads. They use legitimate-looking business interactions
  and AI-related pretexts to build trust. The campaign employs a custom malware called
  MixShell, which uses DNS TXT tunneling for command and control. The attackers utilize
  domain
tags:
- Phishing
- manufacturing
- MixShell
- DNS Tunneling
- ZipLine
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: f5a80b08d46b947ca42ac8dbd0094772aa3111f020a4d72cb2edc4a6c9c37926
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
