title: OTX FileHash-SHA256 IOC - 81c1a8e624306c8a66a44bfe341ec70c6e3a3c9e70ac15c7876fcbbe364d01cd
id: aa056e97-3e92-4b2e-92df-d3ae5a8e8ceb
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'ZipLine Phishing Campaign
  Targets U.S. Manufacturing' (68af58ce8cb7bcf7195c203f).
author: AlienVault
date: '2025-08-27'
references:
- A sophisticated phishing campaign called ZipLine is targeting U.S. manufacturing
  companies, especially those in supply chain-critical sectors. The attackers initiate
  contact through company contact forms, leading to weeks-long email conversations
  before delivering malicious payloads. They use legitimate-looking business interactions
  and AI-related pretexts to build trust. The campaign employs a custom malware called
  MixShell, which uses DNS TXT tunneling for command and control. The attackers utilize
  domain
tags:
- Phishing
- manufacturing
- MixShell
- DNS Tunneling
- ZipLine
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 81c1a8e624306c8a66a44bfe341ec70c6e3a3c9e70ac15c7876fcbbe364d01cd
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
