title: OTX FileHash-SHA256 IOC - b26aecc21da159c0073ecde31cc292d87c8674af8c312776d2cc9827e5c1ad6a
id: a4fc349d-77bd-4553-a56c-bef947113db8
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Chasing the Silver
  Fox: Cat & Mouse in Kernel Shadows'' (68b059077886827c01bed027).'
author: AlienVault
date: '2025-08-28'
references:
- https://research.checkpoint.com/2025/silver-fox-apt-vulnerable-drivers/
tags:
- driver abuse
- kernel exploitation
- signature manipulation
- valleyrat
- byovd
- process termination
- vulnerable driver
- edr evasion
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: b26aecc21da159c0073ecde31cc292d87c8674af8c312776d2cc9827e5c1ad6a
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
