title: OTX FileHash-MD5 IOC - bfba4f65993c3695e03841e0f79f1d88
id: 886cfad6-8f26-4b15-8b5a-70ea89262bf3
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Chasing the Silver
  Fox: Cat & Mouse in Kernel Shadows'' (68b059077886827c01bed027).'
author: AlienVault
date: '2025-08-28'
references:
- https://research.checkpoint.com/2025/silver-fox-apt-vulnerable-drivers/
tags:
- driver abuse
- kernel exploitation
- signature manipulation
- valleyrat
- byovd
- process termination
- vulnerable driver
- edr evasion
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: bfba4f65993c3695e03841e0f79f1d88
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
