title: OTX FileHash-SHA1 IOC - aa21ba6512611deae1b42b075b172c0940f6c017
id: aa92e7b7-ed80-41a1-b764-de2e6f5c4e22
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Chasing the Silver
  Fox: Cat & Mouse in Kernel Shadows'' (68b059077886827c01bed027).'
author: AlienVault
date: '2025-08-28'
references:
- https://research.checkpoint.com/2025/silver-fox-apt-vulnerable-drivers/
tags:
- driver abuse
- kernel exploitation
- signature manipulation
- valleyrat
- byovd
- process termination
- vulnerable driver
- edr evasion
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: aa21ba6512611deae1b42b075b172c0940f6c017
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
