title: OTX FileHash-SHA256 IOC - fc97ad46767a45f4e59923f96d15ec5b680a33f580af7cc4e320fb9963933f26
id: 43eb7aca-d37d-4605-944e-712ab6bb94a7
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Chasing the Silver
  Fox: Cat & Mouse in Kernel Shadows'' (68b059077886827c01bed027).'
author: AlienVault
date: '2025-08-28'
references:
- https://research.checkpoint.com/2025/silver-fox-apt-vulnerable-drivers/
tags:
- driver abuse
- kernel exploitation
- signature manipulation
- valleyrat
- byovd
- process termination
- vulnerable driver
- edr evasion
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: fc97ad46767a45f4e59923f96d15ec5b680a33f580af7cc4e320fb9963933f26
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
