title: OTX FileHash-MD5 IOC - a83639773c1bd96a2953ea64a82ff863
id: afd4d3d9-fe44-4a3c-9761-6e6b92ae2ffc
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Chasing the Silver
  Fox: Cat & Mouse in Kernel Shadows'' (68b059077886827c01bed027).'
author: AlienVault
date: '2025-08-28'
references:
- https://research.checkpoint.com/2025/silver-fox-apt-vulnerable-drivers/
tags:
- driver abuse
- kernel exploitation
- signature manipulation
- valleyrat
- byovd
- process termination
- vulnerable driver
- edr evasion
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: a83639773c1bd96a2953ea64a82ff863
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
