title: OTX FileHash-SHA256 IOC - 0be8483c2ea42f1ce4c90e84ac474a4e7017bc6d682e06f96dc1e31922a07b10
id: b5a90311-aa20-4363-b936-8e299f04d79a
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Chasing the Silver
  Fox: Cat & Mouse in Kernel Shadows'' (68b059077886827c01bed027).'
author: AlienVault
date: '2025-08-28'
references:
- https://research.checkpoint.com/2025/silver-fox-apt-vulnerable-drivers/
tags:
- driver abuse
- kernel exploitation
- signature manipulation
- valleyrat
- byovd
- process termination
- vulnerable driver
- edr evasion
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 0be8483c2ea42f1ce4c90e84ac474a4e7017bc6d682e06f96dc1e31922a07b10
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
