title: OTX FileHash-SHA1 IOC - b2ef2fa7c9a8b0973dea3313e5f2ac0179131233
id: 5a89c362-3f8a-443d-9719-e585505c0120
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Chasing the Silver
  Fox: Cat & Mouse in Kernel Shadows'' (68b059077886827c01bed027).'
author: AlienVault
date: '2025-08-28'
references:
- https://research.checkpoint.com/2025/silver-fox-apt-vulnerable-drivers/
tags:
- driver abuse
- kernel exploitation
- signature manipulation
- valleyrat
- byovd
- process termination
- vulnerable driver
- edr evasion
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: b2ef2fa7c9a8b0973dea3313e5f2ac0179131233
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
