title: OTX FileHash-SHA256 IOC - 9e72b958b4ad9fdf64b6f12a89eb2bae80097a65dc8899732bce9dafda622148
id: fe7a70d6-4260-4172-a169-8ca312b3c81c
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Chasing the Silver
  Fox: Cat & Mouse in Kernel Shadows'' (68b059077886827c01bed027).'
author: AlienVault
date: '2025-08-28'
references:
- https://research.checkpoint.com/2025/silver-fox-apt-vulnerable-drivers/
tags:
- driver abuse
- kernel exploitation
- signature manipulation
- valleyrat
- byovd
- process termination
- vulnerable driver
- edr evasion
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 9e72b958b4ad9fdf64b6f12a89eb2bae80097a65dc8899732bce9dafda622148
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
