title: OTX FileHash-MD5 IOC - 443a00feeb3beaea02b2fbcd4302a3c9
id: 971103db-ab8e-4bd3-9faa-61523a91bbbf
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Operation HanKook
  Phantom: Spear-Phishing Campaign'' (68b1adfb268bf9fa0d35e008).'
author: AlienVault
date: '2025-08-29'
references:
- https://www.seqrite.com/blog/operation-hankook-phantom-north-korean-apt37-targeting-south-korea/
tags:
- powershell
- cloud services
- data exfiltration
- lnk files
- north korea
- espionage
- fileless
- rokrat
- spear-phishing
- south korea
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 443a00feeb3beaea02b2fbcd4302a3c9
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
