title: OTX FileHash-MD5 IOC - d035135e190fb6121faa7630e4a45eed
id: 3f538f0f-6bed-410f-a433-f2294d904bfc
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Operation HanKook
  Phantom: Spear-Phishing Campaign'' (68b1adfb268bf9fa0d35e008).'
author: AlienVault
date: '2025-08-29'
references:
- https://www.seqrite.com/blog/operation-hankook-phantom-north-korean-apt37-targeting-south-korea/
tags:
- powershell
- cloud services
- data exfiltration
- lnk files
- north korea
- espionage
- fileless
- rokrat
- spear-phishing
- south korea
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: d035135e190fb6121faa7630e4a45eed
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
