title: OTX FileHash-SHA1 IOC - 65f79b9fa476e9aafec16a7995b39c72d4c5e341
id: ea688df9-56e9-4320-8e29-108f8559e841
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Operation HanKook
  Phantom: Spear-Phishing Campaign'' (68b1adfb268bf9fa0d35e008).'
author: AlienVault
date: '2025-08-29'
references:
- https://www.seqrite.com/blog/operation-hankook-phantom-north-korean-apt37-targeting-south-korea/
tags:
- powershell
- cloud services
- data exfiltration
- lnk files
- north korea
- espionage
- fileless
- rokrat
- spear-phishing
- south korea
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 65f79b9fa476e9aafec16a7995b39c72d4c5e341
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
