title: OTX FileHash-MD5 IOC - 1aec7b1227060a987d5cb6f17782e76e
id: f8ad3c7b-82d6-496d-ab2d-07b7a3a045f9
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Operation HanKook
  Phantom: Spear-Phishing Campaign'' (68b1adfb268bf9fa0d35e008).'
author: AlienVault
date: '2025-08-29'
references:
- https://www.seqrite.com/blog/operation-hankook-phantom-north-korean-apt37-targeting-south-korea/
tags:
- powershell
- cloud services
- data exfiltration
- lnk files
- north korea
- espionage
- fileless
- rokrat
- spear-phishing
- south korea
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 1aec7b1227060a987d5cb6f17782e76e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
