title: OTX FileHash-MD5 IOC - 2dc20d55d248e8a99afbe5edaae5d2fc
id: 408ed940-1137-457e-bd8c-904dfb209b29
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Operation HanKook
  Phantom: Spear-Phishing Campaign'' (68b1adfb268bf9fa0d35e008).'
author: AlienVault
date: '2025-08-29'
references:
- https://www.seqrite.com/blog/operation-hankook-phantom-north-korean-apt37-targeting-south-korea/
tags:
- powershell
- cloud services
- data exfiltration
- lnk files
- north korea
- espionage
- fileless
- rokrat
- spear-phishing
- south korea
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 2dc20d55d248e8a99afbe5edaae5d2fc
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
