title: OTX FileHash-SHA1 IOC - 2c0fa608bd243fce6f69ece34addf32571e8368f
id: 7859d4e1-b37d-48fc-9198-891d4c5215c6
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Hunting Laundry
  Bear: Infrastructure Analysis Guide and Findings'' (68b19acb28e88648ad2c0ff1).'
author: AlienVault
date: '2025-08-29'
references:
- https://www.validin.com/blog/laundry_bear_infrastructure_analysis
tags:
- infrastructure analysis
- russian threat actor
- domain typosquatting
- ukraine targets
- apt
- spear-phishing
- nato targets
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 2c0fa608bd243fce6f69ece34addf32571e8368f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
