title: OTX FileHash-MD5 IOC - 591b2aaf1732c8a656b5c602875cbdd9
id: c06a6a0f-d0f7-4338-b381-1ffa530773dc
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Operation HanKook
  Phantom: Spear-Phishing Campaign'' (68b1adfb268bf9fa0d35e008).'
author: AlienVault
date: '2025-08-29'
references:
- https://www.seqrite.com/blog/operation-hankook-phantom-north-korean-apt37-targeting-south-korea/
tags:
- powershell
- cloud services
- data exfiltration
- lnk files
- north korea
- espionage
- fileless
- rokrat
- spear-phishing
- south korea
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 591b2aaf1732c8a656b5c602875cbdd9
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
