title: OTX FileHash-MD5 IOC - f6d72abf9ca654a20bbaf23ea1c10a55
id: 768a3e89-dea9-4cbd-b9ba-f55fecf95643
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Operation HanKook
  Phantom: Spear-Phishing Campaign'' (68b1adfb268bf9fa0d35e008).'
author: AlienVault
date: '2025-08-29'
references:
- https://www.seqrite.com/blog/operation-hankook-phantom-north-korean-apt37-targeting-south-korea/
tags:
- powershell
- cloud services
- data exfiltration
- lnk files
- north korea
- espionage
- fileless
- rokrat
- spear-phishing
- south korea
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: f6d72abf9ca654a20bbaf23ea1c10a55
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
