title: OTX FileHash-MD5 IOC - d9fb02481d1df9f93b7d8e84dc7e097f
id: e12b5e79-62ce-4a52-b2ae-2bd8566ce917
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Traps Beneath Fault
  Repair: Analysis of Recent Attacks Using ClickFix Technique'' (68b56db7e618d6d64f462bf6).'
author: AlienVault
date: '2025-09-01'
references:
- https://mp.weixin.qq.com/s?__biz=MzI2MDc2MDA4OA==&mid=2247515797&idx=1&sn=63eb2627f65397d704d187273c6cdce4&chksm=ea6649e2dd11c0f497ca57cf52676a9a764f28e587017e14fc850034ca8518c9f4ef46219824
tags:
- clickfix
- node.js
- beavertail
- invisibleferret
- macos
- apt-q-1
- social engineering
- windows
- phishing
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: d9fb02481d1df9f93b7d8e84dc7e097f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
