title: OTX FileHash-MD5 IOC - a009cd35850929199ef60e71bce86830
id: c48e1ec8-3ed2-4a17-8610-412f9d1d86cd
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Traps Beneath Fault
  Repair: Analysis of Recent Attacks Using ClickFix Technique'' (68b56db7e618d6d64f462bf6).'
author: AlienVault
date: '2025-09-01'
references:
- https://mp.weixin.qq.com/s?__biz=MzI2MDc2MDA4OA==&mid=2247515797&idx=1&sn=63eb2627f65397d704d187273c6cdce4&chksm=ea6649e2dd11c0f497ca57cf52676a9a764f28e587017e14fc850034ca8518c9f4ef46219824
tags:
- clickfix
- node.js
- beavertail
- invisibleferret
- macos
- apt-q-1
- social engineering
- windows
- phishing
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: a009cd35850929199ef60e71bce86830
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
