title: OTX FileHash-SHA1 IOC - c38c95603f56b3fa4e6d558d45c6a59899fa6a88
id: 23125692-bdec-4b7c-866c-f8b971deb1f1
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: c38c95603f56b3fa4e6d558d45c6a59899fa6a88
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
