title: OTX FileHash-SHA1 IOC - 5ab15468ac13dcc1f1bf664892ba30302b1fda67
id: e2062d37-0886-4ae4-8773-06d2146e943b
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 5ab15468ac13dcc1f1bf664892ba30302b1fda67
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
