title: OTX FileHash-SHA1 IOC - 67b4de7ae6b743e16d3f988dc18ac4ed54919cd4
id: 7a340f6c-4643-4e6a-86ef-7edffe34e24a
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 67b4de7ae6b743e16d3f988dc18ac4ed54919cd4
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
