title: OTX FileHash-SHA256 IOC - c9e4443effd31a916b1a5f2b44c2ed541edccd396e74e91df965d11bdd1e4c90
id: 1527e4f5-6bb2-4a6b-b79e-cf0b16bc4bef
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: c9e4443effd31a916b1a5f2b44c2ed541edccd396e74e91df965d11bdd1e4c90
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
