title: OTX FileHash-SHA256 IOC - e2163251facba4440d24a5e8cebeb71055f0e96c2d1aca04ebcb99e4ecb4c226
id: 564eeb88-5d61-4983-878f-099f73f2e4e5
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: e2163251facba4440d24a5e8cebeb71055f0e96c2d1aca04ebcb99e4ecb4c226
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
