title: OTX FileHash-SHA256 IOC - 55173c8faa1f6bc92874c55fd280be21f7e581c1076ac50f238ff1c97b9f3a9f
id: 1eee1cae-9174-45da-af53-127ded77fc2f
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 55173c8faa1f6bc92874c55fd280be21f7e581c1076ac50f238ff1c97b9f3a9f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
