title: OTX FileHash-SHA1 IOC - 70e43bb2a3883630c80917ce0eb7754a6ccc3ad0
id: fb975ab6-bf50-4ebf-b689-13f4f374bd88
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 70e43bb2a3883630c80917ce0eb7754a6ccc3ad0
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
