title: OTX FileHash-MD5 IOC - a0bde997d90acf2dba1631325ab3a04e
id: 6c39c028-e460-48d7-83c0-4b73fe92407a
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: a0bde997d90acf2dba1631325ab3a04e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
