title: OTX FileHash-SHA1 IOC - 83a1cb488346dbbb000d32c483673a1f40606df3
id: 7c163327-8926-4f7c-b656-97a5593814e3
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 83a1cb488346dbbb000d32c483673a1f40606df3
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
