title: OTX FileHash-SHA1 IOC - 5e508009e9c5335eeaefc2f2ebebd82f452e098d
id: ed089ed9-3ea9-4c47-93a3-2f93e9c246dd
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 5e508009e9c5335eeaefc2f2ebebd82f452e098d
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
