title: OTX FileHash-MD5 IOC - 78b7104ee0d569fdfacfbe9b18c71013
id: fc2d6ff0-1395-4e5b-b518-32f3bc22bacb
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 78b7104ee0d569fdfacfbe9b18c71013
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
