title: OTX FileHash-SHA1 IOC - 9b6b040e3b19c8b00d93ac2617a38c574bcec42f
id: 77d400b5-a416-43a5-a190-48b58007005e
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 9b6b040e3b19c8b00d93ac2617a38c574bcec42f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
