title: OTX FileHash-SHA256 IOC - 067ea583e47d768d50b4cf0e55aaaa37ebdb6dcd2f7b84e890892bbdea6c9740
id: 12164d26-0db3-4fd3-ad27-b566db038873
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 067ea583e47d768d50b4cf0e55aaaa37ebdb6dcd2f7b84e890892bbdea6c9740
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
