title: OTX FileHash-SHA256 IOC - d64ce359bc97c9643e66057dbd0ea9ed69d5272487e873119dc7a01134f852bc
id: 95b51f4b-a16e-43fc-871c-abec3c7a0149
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: d64ce359bc97c9643e66057dbd0ea9ed69d5272487e873119dc7a01134f852bc
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
