title: OTX FileHash-MD5 IOC - 71b155baab6cf15e9542f2631b596a6a
id: 7089cca8-5815-44c4-bbf8-c2aa0021d68a
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 71b155baab6cf15e9542f2631b596a6a
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
