title: OTX FileHash-MD5 IOC - 7054fb839379afe38df6f60dabcd56fd
id: 2f87f9b5-d398-4abd-ad64-848b60a078de
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 7054fb839379afe38df6f60dabcd56fd
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
