title: OTX FileHash-SHA1 IOC - 843ee489b2668af986f5ffa477e9da3fa5d1d8fa
id: eeb63c8f-39d9-48fd-94b4-65fa20c4fe98
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 843ee489b2668af986f5ffa477e9da3fa5d1d8fa
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
