title: OTX FileHash-MD5 IOC - 62e43638548bbe4909eaf8408d8b5686
id: 67f22273-ed5d-4fe0-b14f-9a511cd22aa0
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'New malware campaign
  discovered via ManualFinder' (68b8a1182ec5c19a3c05af6f).
author: AlienVault
date: '2025-09-03'
references:
- https://www.ncsc.nl/actueel/nieuws/2025/08/29/nieuwe-malwarecampagne-ontdekt-via-manualfinder
tags:
- onestart browser
- certificate abuse
- pdf-editor
- javascript
- manualfinder
- trojan:win64/infostealer!msr
- trojan:win32/malgent!msr
- windows
- residential proxy
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 62e43638548bbe4909eaf8408d8b5686
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
