title: OTX FileHash-SHA1 IOC - d249a92c9594c0410570a01abe2fce4cd16f762d
id: 03c76c9f-5f5b-4bc9-8371-31f805f6b7eb
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'New malware campaign
  discovered via ManualFinder' (68b8a1182ec5c19a3c05af6f).
author: AlienVault
date: '2025-09-03'
references:
- https://www.ncsc.nl/actueel/nieuws/2025/08/29/nieuwe-malwarecampagne-ontdekt-via-manualfinder
tags:
- onestart browser
- certificate abuse
- pdf-editor
- javascript
- manualfinder
- trojan:win64/infostealer!msr
- trojan:win32/malgent!msr
- windows
- residential proxy
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: d249a92c9594c0410570a01abe2fce4cd16f762d
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
