title: OTX FileHash-SHA1 IOC - 2ecd25269173890e04fe00ea23a585e4f0a206ad
id: 6e4ee18f-a502-462b-8d61-a7cc938ffdb4
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'New malware campaign
  discovered via ManualFinder' (68b8a1182ec5c19a3c05af6f).
author: AlienVault
date: '2025-09-03'
references:
- https://www.ncsc.nl/actueel/nieuws/2025/08/29/nieuwe-malwarecampagne-ontdekt-via-manualfinder
tags:
- onestart browser
- certificate abuse
- pdf-editor
- javascript
- manualfinder
- trojan:win64/infostealer!msr
- trojan:win32/malgent!msr
- windows
- residential proxy
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 2ecd25269173890e04fe00ea23a585e4f0a206ad
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
