title: OTX FileHash-MD5 IOC - 6fd6c053f8fcf345efaa04f16ac0bffe
id: 7aa5fc42-6027-45ad-b716-e76eede4634c
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'New malware campaign
  discovered via ManualFinder' (68b8a1182ec5c19a3c05af6f).
author: AlienVault
date: '2025-09-03'
references:
- https://www.ncsc.nl/actueel/nieuws/2025/08/29/nieuwe-malwarecampagne-ontdekt-via-manualfinder
tags:
- onestart browser
- certificate abuse
- pdf-editor
- javascript
- manualfinder
- trojan:win64/infostealer!msr
- trojan:win32/malgent!msr
- windows
- residential proxy
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 6fd6c053f8fcf345efaa04f16ac0bffe
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
