title: OTX FileHash-SHA256 IOC - 71edb9f9f757616fe62a49f2d5b55441f91618904517337abd9d0725b07c2a51
id: 5e512f5b-dc22-43b6-866c-5763a2068b86
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'New malware campaign
  discovered via ManualFinder' (68b8a1182ec5c19a3c05af6f).
author: AlienVault
date: '2025-09-03'
references:
- https://www.ncsc.nl/actueel/nieuws/2025/08/29/nieuwe-malwarecampagne-ontdekt-via-manualfinder
tags:
- onestart browser
- certificate abuse
- pdf-editor
- javascript
- manualfinder
- trojan:win64/infostealer!msr
- trojan:win32/malgent!msr
- windows
- residential proxy
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 71edb9f9f757616fe62a49f2d5b55441f91618904517337abd9d0725b07c2a51
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
