title: OTX FileHash-SHA256 IOC - d9f9584f4f071be9c5cf418cae91423c51d53ecf9924ed39b42028d1314a2edc
id: a7ce611e-7d65-4e64-8734-129fff2aebdc
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'New malware campaign
  discovered via ManualFinder' (68b8a1182ec5c19a3c05af6f).
author: AlienVault
date: '2025-09-03'
references:
- https://www.ncsc.nl/actueel/nieuws/2025/08/29/nieuwe-malwarecampagne-ontdekt-via-manualfinder
tags:
- onestart browser
- certificate abuse
- pdf-editor
- javascript
- manualfinder
- trojan:win64/infostealer!msr
- trojan:win32/malgent!msr
- windows
- residential proxy
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: d9f9584f4f071be9c5cf418cae91423c51d53ecf9924ed39b42028d1314a2edc
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
