title: OTX FileHash-MD5 IOC - a5d7966e70b62f95ec2e3d18f5f8ab2a
id: 12ec0c36-5717-4638-959d-558483f2d9cb
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'New malware campaign
  discovered via ManualFinder' (68b8a1182ec5c19a3c05af6f).
author: AlienVault
date: '2025-09-03'
references:
- https://www.ncsc.nl/actueel/nieuws/2025/08/29/nieuwe-malwarecampagne-ontdekt-via-manualfinder
tags:
- onestart browser
- certificate abuse
- pdf-editor
- javascript
- manualfinder
- trojan:win64/infostealer!msr
- trojan:win32/malgent!msr
- windows
- residential proxy
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: a5d7966e70b62f95ec2e3d18f5f8ab2a
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
