title: OTX FileHash-SHA1 IOC - 1eb5be9e5662811fa1412287fa8e5a2d88d0a4d2
id: c2d80332-50aa-4e60-9a59-a5f7130ae84f
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'New malware campaign
  discovered via ManualFinder' (68b8a1182ec5c19a3c05af6f).
author: AlienVault
date: '2025-09-03'
references:
- https://www.ncsc.nl/actueel/nieuws/2025/08/29/nieuwe-malwarecampagne-ontdekt-via-manualfinder
tags:
- onestart browser
- certificate abuse
- pdf-editor
- javascript
- manualfinder
- trojan:win64/infostealer!msr
- trojan:win32/malgent!msr
- windows
- residential proxy
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 1eb5be9e5662811fa1412287fa8e5a2d88d0a4d2
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
