title: OTX FileHash-MD5 IOC - 6b5e479394633f4af9957df1d847c665
id: 1eca587f-3334-43d0-82c8-4f6bdc5b605c
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'New malware campaign
  discovered via ManualFinder' (68b8a1182ec5c19a3c05af6f).
author: AlienVault
date: '2025-09-03'
references:
- https://www.ncsc.nl/actueel/nieuws/2025/08/29/nieuwe-malwarecampagne-ontdekt-via-manualfinder
tags:
- onestart browser
- certificate abuse
- pdf-editor
- javascript
- manualfinder
- trojan:win64/infostealer!msr
- trojan:win32/malgent!msr
- windows
- residential proxy
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 6b5e479394633f4af9957df1d847c665
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
