title: OTX FileHash-SHA1 IOC - c60c964e4e0d40e5d038950d75db60b84d4cd911
id: e7c8183c-2aa7-4827-9b8c-22e5bc07584b
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'New malware campaign
  discovered via ManualFinder' (68b8a1182ec5c19a3c05af6f).
author: AlienVault
date: '2025-09-03'
references:
- https://www.ncsc.nl/actueel/nieuws/2025/08/29/nieuwe-malwarecampagne-ontdekt-via-manualfinder
tags:
- onestart browser
- certificate abuse
- pdf-editor
- javascript
- manualfinder
- trojan:win64/infostealer!msr
- trojan:win32/malgent!msr
- windows
- residential proxy
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: c60c964e4e0d40e5d038950d75db60b84d4cd911
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
