title: OTX FileHash-SHA256 IOC - e05142f8375070d1ea25ed3a31404ca37b4e1ac88c26832682d8d2f9f4f6d0ae
id: bd68bcb7-3035-4c34-aa6e-89ffde529d75
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Contagious Interview
  | North Korean Threat Actors Reveal Plans and Ops by Abusing Cyber Intel Platforms'
  (68b9d266a57b122998115dc6).
author: AlienVault
date: '2025-09-04'
references:
- https://www.sentinelone.com/labs/contagious-interview-threat-actors-scout-cyber-intel-platforms-reveal-plans-and-ops
tags:
- cyber espionage
- social engineering
- north korea
- job seeker targeting
- clickfix
- lazarus
- infrastructure monitoring
- cryptocurrency
- contagiousdrop
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: e05142f8375070d1ea25ed3a31404ca37b4e1ac88c26832682d8d2f9f4f6d0ae
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
