title: OTX FileHash-SHA1 IOC - c0979ec20b87084317d1bfa50405f7149c3b5c5f
id: dd4e7c6b-ea83-4a70-ae29-c307fc587e35
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Unmasking The Gentlemen
  Ransomware: Tactics, Techniques, and Procedures Revealed'' (68c010b430d8015144977323).'
author: AlienVault
date: '2025-09-09'
references:
- https://www.trendmicro.com/en_us/research/25/i/unmasking-the-gentlemen-ransomware.html
tags:
- ransomware
- lateral movement
- the gentlemen ransomware
- defense evasion
- custom tools
- driver abuse
- data exfiltration
- group policy manipulation
- enterprise targeting
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: c0979ec20b87084317d1bfa50405f7149c3b5c5f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
