title: OTX FileHash-MD5 IOC - a88daa62751c212b7579a57f1f4ae8f8
id: 22bd7f66-f91c-48e4-8204-d9280c54241c
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Unmasking The Gentlemen
  Ransomware: Tactics, Techniques, and Procedures Revealed'' (68c010b430d8015144977323).'
author: AlienVault
date: '2025-09-09'
references:
- https://www.trendmicro.com/en_us/research/25/i/unmasking-the-gentlemen-ransomware.html
tags:
- ransomware
- lateral movement
- the gentlemen ransomware
- defense evasion
- custom tools
- driver abuse
- data exfiltration
- group policy manipulation
- enterprise targeting
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: a88daa62751c212b7579a57f1f4ae8f8
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
