title: OTX FileHash-SHA256 IOC - 4c82fbafef9bab484a2fbe23e4ec8aac06e8e296d6c9e496f4a589f97fd4ab71
id: 90a62917-80e4-4c33-bc58-e7ee452bc490
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Unmasking The Gentlemen
  Ransomware: Tactics, Techniques, and Procedures Revealed'' (68c010b430d8015144977323).'
author: AlienVault
date: '2025-09-09'
references:
- https://www.trendmicro.com/en_us/research/25/i/unmasking-the-gentlemen-ransomware.html
tags:
- ransomware
- lateral movement
- the gentlemen ransomware
- defense evasion
- custom tools
- driver abuse
- data exfiltration
- group policy manipulation
- enterprise targeting
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 4c82fbafef9bab484a2fbe23e4ec8aac06e8e296d6c9e496f4a589f97fd4ab71
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
