title: OTX FileHash-SHA1 IOC - e00293ce0eb534874efd615ae590cf6aa3858ba4
id: e3a60f1e-df5c-47d4-a68e-b92747f4f776
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Unmasking The Gentlemen
  Ransomware: Tactics, Techniques, and Procedures Revealed'' (68c010b430d8015144977323).'
author: AlienVault
date: '2025-09-09'
references:
- https://www.trendmicro.com/en_us/research/25/i/unmasking-the-gentlemen-ransomware.html
tags:
- ransomware
- lateral movement
- the gentlemen ransomware
- defense evasion
- custom tools
- driver abuse
- data exfiltration
- group policy manipulation
- enterprise targeting
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: e00293ce0eb534874efd615ae590cf6aa3858ba4
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
