title: OTX FileHash-SHA1 IOC - c12c4d58541cc4f75ae19b65295a52c559570054
id: 7cfd54c7-75d5-4922-a037-80e724bbea13
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Unmasking The Gentlemen
  Ransomware: Tactics, Techniques, and Procedures Revealed'' (68c010b430d8015144977323).'
author: AlienVault
date: '2025-09-09'
references:
- https://www.trendmicro.com/en_us/research/25/i/unmasking-the-gentlemen-ransomware.html
tags:
- ransomware
- lateral movement
- the gentlemen ransomware
- defense evasion
- custom tools
- driver abuse
- data exfiltration
- group policy manipulation
- enterprise targeting
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: c12c4d58541cc4f75ae19b65295a52c559570054
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
