title: OTX FileHash-SHA256 IOC - c890c6e6b7cc6984cd9d9061d285d814841e0b8136286e6fd943013260eb8461
id: 307f4b63-5b41-467a-a691-def27305b64a
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ZynorRAT technical
  analysis: Reverse engineering a novel, Turkish Go-based RAT'' (68c12ec5eb851e4417b21f49).'
author: AlienVault
date: '2025-09-10'
references:
- https://www.sysdig.com/blog/zynorrat-technical-analysis-reverse-engineering-a-novel-turkish-go-based-rat
tags:
- remote access trojan
- zynorrat
- go-based
- turkish
- linux
- telegram
- windows
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: c890c6e6b7cc6984cd9d9061d285d814841e0b8136286e6fd943013260eb8461
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
