title: OTX FileHash-MD5 IOC - 073ea1d3dcbe5d9522051e1a085ed5b7
id: 883a0f5c-3586-4e9e-89c9-7c2fb4bdc93a
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ZynorRAT technical
  analysis: Reverse engineering a novel, Turkish Go-based RAT'' (68c12ec5eb851e4417b21f49).'
author: AlienVault
date: '2025-09-10'
references:
- https://www.sysdig.com/blog/zynorrat-technical-analysis-reverse-engineering-a-novel-turkish-go-based-rat
tags:
- remote access trojan
- zynorrat
- go-based
- turkish
- linux
- telegram
- windows
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 073ea1d3dcbe5d9522051e1a085ed5b7
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
