title: OTX FileHash-SHA256 IOC - a6c450f9abff8a22445ba539c21b24508dd326522df525977e14ec17e11f7d65
id: cb58d2e5-91fb-4678-b183-f9bb93a99170
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ZynorRAT technical
  analysis: Reverse engineering a novel, Turkish Go-based RAT'' (68c12ec5eb851e4417b21f49).'
author: AlienVault
date: '2025-09-10'
references:
- https://www.sysdig.com/blog/zynorrat-technical-analysis-reverse-engineering-a-novel-turkish-go-based-rat
tags:
- remote access trojan
- zynorrat
- go-based
- turkish
- linux
- telegram
- windows
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: a6c450f9abff8a22445ba539c21b24508dd326522df525977e14ec17e11f7d65
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
