title: OTX FileHash-SHA1 IOC - 0028560839604fd4f2abda139d3752c8ee12b360
id: 04aca923-9e58-4cf0-95e4-e7502150c37d
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ZynorRAT technical
  analysis: Reverse engineering a novel, Turkish Go-based RAT'' (68c12ec5eb851e4417b21f49).'
author: AlienVault
date: '2025-09-10'
references:
- https://www.sysdig.com/blog/zynorrat-technical-analysis-reverse-engineering-a-novel-turkish-go-based-rat
tags:
- remote access trojan
- zynorrat
- go-based
- turkish
- linux
- telegram
- windows
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 0028560839604fd4f2abda139d3752c8ee12b360
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
