title: OTX FileHash-SHA256 IOC - 237a40e522f2f1e6c71415997766b4b23f1526e2f141d68ff334de3ff5b0c89f
id: 08440dc9-c64e-46ac-a700-594476f63ea0
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ZynorRAT technical
  analysis: Reverse engineering a novel, Turkish Go-based RAT'' (68c12ec5eb851e4417b21f49).'
author: AlienVault
date: '2025-09-10'
references:
- https://www.sysdig.com/blog/zynorrat-technical-analysis-reverse-engineering-a-novel-turkish-go-based-rat
tags:
- remote access trojan
- zynorrat
- go-based
- turkish
- linux
- telegram
- windows
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 237a40e522f2f1e6c71415997766b4b23f1526e2f141d68ff334de3ff5b0c89f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
