title: OTX FileHash-SHA1 IOC - b6084705098bd96b512858ad32084605c74b1eb1
id: d8b62ca9-286b-4001-911e-9067d26f74d0
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ZynorRAT technical
  analysis: Reverse engineering a novel, Turkish Go-based RAT'' (68c12ec5eb851e4417b21f49).'
author: AlienVault
date: '2025-09-10'
references:
- https://www.sysdig.com/blog/zynorrat-technical-analysis-reverse-engineering-a-novel-turkish-go-based-rat
tags:
- remote access trojan
- zynorrat
- go-based
- turkish
- linux
- telegram
- windows
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: b6084705098bd96b512858ad32084605c74b1eb1
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
