title: OTX FileHash-MD5 IOC - 7a97e01b8ef206f5dce592ff68442e1e
id: 7764cd53-2c58-4c72-a9e4-b765a60cf827
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ZynorRAT technical
  analysis: Reverse engineering a novel, Turkish Go-based RAT'' (68c12ec5eb851e4417b21f49).'
author: AlienVault
date: '2025-09-10'
references:
- https://www.sysdig.com/blog/zynorrat-technical-analysis-reverse-engineering-a-novel-turkish-go-based-rat
tags:
- remote access trojan
- zynorrat
- go-based
- turkish
- linux
- telegram
- windows
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 7a97e01b8ef206f5dce592ff68442e1e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
