title: OTX FileHash-SHA1 IOC - 45abdc39bdf66b1f94f24e49c651e6103b85ad28
id: 9f73f0ff-9a00-46b1-99f0-2332dacf4030
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ZynorRAT technical
  analysis: Reverse engineering a novel, Turkish Go-based RAT'' (68c12ec5eb851e4417b21f49).'
author: AlienVault
date: '2025-09-10'
references:
- https://www.sysdig.com/blog/zynorrat-technical-analysis-reverse-engineering-a-novel-turkish-go-based-rat
tags:
- remote access trojan
- zynorrat
- go-based
- turkish
- linux
- telegram
- windows
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 45abdc39bdf66b1f94f24e49c651e6103b85ad28
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
