title: OTX FileHash-SHA256 IOC - 8b09ba6e006718371486b3655588b438ade953beecf221af38160cbe6fedd40a
id: 7195282e-ff67-464c-8929-149146d3a3ac
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ZynorRAT technical
  analysis: Reverse engineering a novel, Turkish Go-based RAT'' (68c12ec5eb851e4417b21f49).'
author: AlienVault
date: '2025-09-10'
references:
- https://www.sysdig.com/blog/zynorrat-technical-analysis-reverse-engineering-a-novel-turkish-go-based-rat
tags:
- remote access trojan
- zynorrat
- go-based
- turkish
- linux
- telegram
- windows
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 8b09ba6e006718371486b3655588b438ade953beecf221af38160cbe6fedd40a
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
