title: OTX FileHash-SHA1 IOC - 2e3b81497f6cb06c91b2e60753340db84d09e378
id: 92d9903c-b019-4518-b63d-817d84846e23
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ZynorRAT technical
  analysis: Reverse engineering a novel, Turkish Go-based RAT'' (68c12ec5eb851e4417b21f49).'
author: AlienVault
date: '2025-09-10'
references:
- https://www.sysdig.com/blog/zynorrat-technical-analysis-reverse-engineering-a-novel-turkish-go-based-rat
tags:
- remote access trojan
- zynorrat
- go-based
- turkish
- linux
- telegram
- windows
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 2e3b81497f6cb06c91b2e60753340db84d09e378
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
