title: OTX FileHash-MD5 IOC - be3d985a4a76dfeaf485955c1ef67249
id: 660218bf-634a-4d45-aadb-3b89ce9d882e
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ZynorRAT technical
  analysis: Reverse engineering a novel, Turkish Go-based RAT'' (68c12ec5eb851e4417b21f49).'
author: AlienVault
date: '2025-09-10'
references:
- https://www.sysdig.com/blog/zynorrat-technical-analysis-reverse-engineering-a-novel-turkish-go-based-rat
tags:
- remote access trojan
- zynorrat
- go-based
- turkish
- linux
- telegram
- windows
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: be3d985a4a76dfeaf485955c1ef67249
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
