title: OTX FileHash-SHA256 IOC - f9eb2a54e500b3ce42950fb75af30955180360c978c00d081ea561c86e54262d
id: 658d9867-f08b-4972-b6db-cd5b62f8e157
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ZynorRAT technical
  analysis: Reverse engineering a novel, Turkish Go-based RAT'' (68c12ec5eb851e4417b21f49).'
author: AlienVault
date: '2025-09-10'
references:
- https://www.sysdig.com/blog/zynorrat-technical-analysis-reverse-engineering-a-novel-turkish-go-based-rat
tags:
- remote access trojan
- zynorrat
- go-based
- turkish
- linux
- telegram
- windows
- c2
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: f9eb2a54e500b3ce42950fb75af30955180360c978c00d081ea561c86e54262d
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
