title: OTX FileHash-SHA256 IOC - 1f7b509db8424453b8bb3a45053f3bc47f98414b168a67f253c10f0f6fb83936
id: 51653a61-e3d6-44dc-a437-bf93ca043711
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''AsyncRAT Campaigns
  Uncovered: How Attackers Abuse ScreenConnect and Open Directories'' (68cd7f421874e12c34532ccf).'
author: AlienVault
date: '2025-09-19'
references:
- https://hunt.io/blog/asyncrat-screenconnect-open-directory-campaigns#ConnectWise_ScreenConnect_Network_Observables_and_Indicators_of_Compromise_IOCs
tags:
- phishing
- open directories
- screenconnect
- remote access trojan
- powershell rat
- c2 infrastructure
- payload staging
- persistence
- asyncrat
- cve-2025-3935
- obfuscation
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 1f7b509db8424453b8bb3a45053f3bc47f98414b168a67f253c10f0f6fb83936
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
