title: OTX FileHash-SHA256 IOC - e4afc06b31849f0a9c463e2599906a93914727a1f5b08d0ebfe1990965ebc41f
id: 40ea8102-385f-4331-b514-0ad9e2da41de
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''AsyncRAT Campaigns
  Uncovered: How Attackers Abuse ScreenConnect and Open Directories'' (68cd7f421874e12c34532ccf).'
author: AlienVault
date: '2025-09-19'
references:
- https://hunt.io/blog/asyncrat-screenconnect-open-directory-campaigns#ConnectWise_ScreenConnect_Network_Observables_and_Indicators_of_Compromise_IOCs
tags:
- phishing
- open directories
- screenconnect
- remote access trojan
- powershell rat
- c2 infrastructure
- payload staging
- persistence
- asyncrat
- cve-2025-3935
- obfuscation
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: e4afc06b31849f0a9c463e2599906a93914727a1f5b08d0ebfe1990965ebc41f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
