title: OTX FileHash-SHA256 IOC - ec7514d1be0ba0b2a9059759d2885f81f1e887e1559a1630f6c380e11f7bf7d3
id: c6639e5c-34ec-4712-a66c-081cf6a3ad00
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''AsyncRAT Campaigns
  Uncovered: How Attackers Abuse ScreenConnect and Open Directories'' (68cd7f421874e12c34532ccf).'
author: AlienVault
date: '2025-09-19'
references:
- https://hunt.io/blog/asyncrat-screenconnect-open-directory-campaigns#ConnectWise_ScreenConnect_Network_Observables_and_Indicators_of_Compromise_IOCs
tags:
- phishing
- open directories
- screenconnect
- remote access trojan
- powershell rat
- c2 infrastructure
- payload staging
- persistence
- asyncrat
- cve-2025-3935
- obfuscation
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: ec7514d1be0ba0b2a9059759d2885f81f1e887e1559a1630f6c380e11f7bf7d3
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
