title: OTX FileHash-SHA256 IOC - ff529b5e54b079ff9a449e933b6042c2403f15d0de9ee9dbfb0c51e56bf13fad
id: 447417fc-ae0d-4fa9-bb5c-b7ca05e548bb
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''AsyncRAT Campaigns
  Uncovered: How Attackers Abuse ScreenConnect and Open Directories'' (68cd7f421874e12c34532ccf).'
author: AlienVault
date: '2025-09-19'
references:
- https://hunt.io/blog/asyncrat-screenconnect-open-directory-campaigns#ConnectWise_ScreenConnect_Network_Observables_and_Indicators_of_Compromise_IOCs
tags:
- phishing
- open directories
- screenconnect
- remote access trojan
- powershell rat
- c2 infrastructure
- payload staging
- persistence
- asyncrat
- cve-2025-3935
- obfuscation
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: ff529b5e54b079ff9a449e933b6042c2403f15d0de9ee9dbfb0c51e56bf13fad
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
