title: OTX FileHash-MD5 IOC - cd5207483b78ef50d3dbd3f6a36d2a98
id: 754d09a1-640d-468c-8636-06b6aef9c119
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''AsyncRAT Campaigns
  Uncovered: How Attackers Abuse ScreenConnect and Open Directories'' (68cd7f421874e12c34532ccf).'
author: AlienVault
date: '2025-09-19'
references:
- https://hunt.io/blog/asyncrat-screenconnect-open-directory-campaigns#ConnectWise_ScreenConnect_Network_Observables_and_Indicators_of_Compromise_IOCs
tags:
- phishing
- open directories
- screenconnect
- remote access trojan
- powershell rat
- c2 infrastructure
- payload staging
- persistence
- asyncrat
- cve-2025-3935
- obfuscation
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: cd5207483b78ef50d3dbd3f6a36d2a98
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
