title: OTX FileHash-SHA256 IOC - a03cec07324b0c3227e4f060b0fefc24d35482dfe690bc86df1a53211629837e
id: 6b2df549-f151-435e-9453-a7c09762b14d
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''DeerStealer Malware
  Campaign: Stealth, Persistence, and Rootkit-Like Capabilities'' (68ce938ae34f725fce8b67a4).'
author: AlienVault
date: '2025-09-20'
references:
- https://www.cyfirma.com/research/deerstealer-malware-campaign-stealth-persistence-and-rootkit-like-capabilities
tags:
- multi-stage-execution
- rootkit
- data-exfiltration
- xfiles spyware
- persistence
- deerstealer
- uac-bypass
- information-stealing
- stealth
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: a03cec07324b0c3227e4f060b0fefc24d35482dfe690bc86df1a53211629837e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
