title: OTX FileHash-MD5 IOC - 810d42177538ad5ca18d4dd597c00658
id: 268a9f41-ceef-44b1-95b7-e9be77a982ac
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''DeerStealer Malware
  Campaign: Stealth, Persistence, and Rootkit-Like Capabilities'' (68ce938ae34f725fce8b67a4).'
author: AlienVault
date: '2025-09-20'
references:
- https://www.cyfirma.com/research/deerstealer-malware-campaign-stealth-persistence-and-rootkit-like-capabilities
tags:
- multi-stage-execution
- rootkit
- data-exfiltration
- xfiles spyware
- persistence
- deerstealer
- uac-bypass
- information-stealing
- stealth
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 810d42177538ad5ca18d4dd597c00658
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
