title: OTX FileHash-SHA256 IOC - 5ec174af8a18a5516b8a6e11d8a27481d70df14d1edb67c48b5458ff44df9146
id: 8f5411f2-fa20-471c-bcfe-32e5ac737732
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''DeerStealer Malware
  Campaign: Stealth, Persistence, and Rootkit-Like Capabilities'' (68ce938ae34f725fce8b67a4).'
author: AlienVault
date: '2025-09-20'
references:
- https://www.cyfirma.com/research/deerstealer-malware-campaign-stealth-persistence-and-rootkit-like-capabilities
tags:
- multi-stage-execution
- rootkit
- data-exfiltration
- xfiles spyware
- persistence
- deerstealer
- uac-bypass
- information-stealing
- stealth
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 5ec174af8a18a5516b8a6e11d8a27481d70df14d1edb67c48b5458ff44df9146
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
