title: OTX FileHash-SHA256 IOC - 1432faeddfe57877873e8608ace13739ca66e8ce12b3453531e7eec4753df21d
id: 2796c0ca-c2b3-41d3-996f-9bab9286ca5e
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''DeerStealer Malware
  Campaign: Stealth, Persistence, and Rootkit-Like Capabilities'' (68ce938ae34f725fce8b67a4).'
author: AlienVault
date: '2025-09-20'
references:
- https://www.cyfirma.com/research/deerstealer-malware-campaign-stealth-persistence-and-rootkit-like-capabilities
tags:
- multi-stage-execution
- rootkit
- data-exfiltration
- xfiles spyware
- persistence
- deerstealer
- uac-bypass
- information-stealing
- stealth
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 1432faeddfe57877873e8608ace13739ca66e8ce12b3453531e7eec4753df21d
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
