title: OTX FileHash-SHA1 IOC - 366395d6fc13b4cc84e932fb4767fca903479a1d
id: 00ccaa59-8232-46c9-b662-c4f5e64ada07
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''DeerStealer Malware
  Campaign: Stealth, Persistence, and Rootkit-Like Capabilities'' (68ce938ae34f725fce8b67a4).'
author: AlienVault
date: '2025-09-20'
references:
- https://www.cyfirma.com/research/deerstealer-malware-campaign-stealth-persistence-and-rootkit-like-capabilities
tags:
- multi-stage-execution
- rootkit
- data-exfiltration
- xfiles spyware
- persistence
- deerstealer
- uac-bypass
- information-stealing
- stealth
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 366395d6fc13b4cc84e932fb4767fca903479a1d
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
