title: OTX FileHash-MD5 IOC - 2c7bdaebb9e6614d38d5f1a253c24c7d
id: e0ca1625-f3c7-4594-b651-66e9b3bfce26
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''DeerStealer Malware
  Campaign: Stealth, Persistence, and Rootkit-Like Capabilities'' (68ce938ae34f725fce8b67a4).'
author: AlienVault
date: '2025-09-20'
references:
- https://www.cyfirma.com/research/deerstealer-malware-campaign-stealth-persistence-and-rootkit-like-capabilities
tags:
- multi-stage-execution
- rootkit
- data-exfiltration
- xfiles spyware
- persistence
- deerstealer
- uac-bypass
- information-stealing
- stealth
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 2c7bdaebb9e6614d38d5f1a253c24c7d
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
