title: OTX FileHash-SHA256 IOC - d4b3a879fb6907c39a3b843ec5272a005e8fec25d8012c4a9fe9d0ada9f71d1f
id: 32787558-8ff0-49d8-a709-c0f7a51b313a
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''DeerStealer Malware
  Campaign: Stealth, Persistence, and Rootkit-Like Capabilities'' (68ce938ae34f725fce8b67a4).'
author: AlienVault
date: '2025-09-20'
references:
- https://www.cyfirma.com/research/deerstealer-malware-campaign-stealth-persistence-and-rootkit-like-capabilities
tags:
- multi-stage-execution
- rootkit
- data-exfiltration
- xfiles spyware
- persistence
- deerstealer
- uac-bypass
- information-stealing
- stealth
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: d4b3a879fb6907c39a3b843ec5272a005e8fec25d8012c4a9fe9d0ada9f71d1f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
