title: OTX FileHash-SHA256 IOC - 623ff1e6662986ab36336919fde5c48805b4a87b97af6f9abe09732e9ac45b8f
id: ba79e5f6-cbe2-4dfc-976d-bfba932da28e
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''DeerStealer Malware
  Campaign: Stealth, Persistence, and Rootkit-Like Capabilities'' (68ce938ae34f725fce8b67a4).'
author: AlienVault
date: '2025-09-20'
references:
- https://www.cyfirma.com/research/deerstealer-malware-campaign-stealth-persistence-and-rootkit-like-capabilities
tags:
- multi-stage-execution
- rootkit
- data-exfiltration
- xfiles spyware
- persistence
- deerstealer
- uac-bypass
- information-stealing
- stealth
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 623ff1e6662986ab36336919fde5c48805b4a87b97af6f9abe09732e9ac45b8f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
