title: OTX FileHash-SHA256 IOC - b7ee370878fb4290097311e652222d8bab91c44a94063ea192100d4fd9dadb14
id: 1dfeb897-360d-4c50-a8fb-2bdc85c734af
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''DeerStealer Malware
  Campaign: Stealth, Persistence, and Rootkit-Like Capabilities'' (68ce938ae34f725fce8b67a4).'
author: AlienVault
date: '2025-09-20'
references:
- https://www.cyfirma.com/research/deerstealer-malware-campaign-stealth-persistence-and-rootkit-like-capabilities
tags:
- multi-stage-execution
- rootkit
- data-exfiltration
- xfiles spyware
- persistence
- deerstealer
- uac-bypass
- information-stealing
- stealth
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: b7ee370878fb4290097311e652222d8bab91c44a94063ea192100d4fd9dadb14
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
