title: OTX FileHash-SHA1 IOC - 7374bbe63c44de9536c22cdc111894c6d4929eb3
id: b3656f84-c405-4d4d-9d75-881754ead65c
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''DeerStealer Malware
  Campaign: Stealth, Persistence, and Rootkit-Like Capabilities'' (68ce938ae34f725fce8b67a4).'
author: AlienVault
date: '2025-09-20'
references:
- https://www.cyfirma.com/research/deerstealer-malware-campaign-stealth-persistence-and-rootkit-like-capabilities
tags:
- multi-stage-execution
- rootkit
- data-exfiltration
- xfiles spyware
- persistence
- deerstealer
- uac-bypass
- information-stealing
- stealth
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 7374bbe63c44de9536c22cdc111894c6d4929eb3
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
