title: OTX FileHash-MD5 IOC - 196691384955781b831c331f743443a9
id: b9f7daeb-682b-4813-b20f-61cd11fc3adf
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''DeerStealer Malware
  Campaign: Stealth, Persistence, and Rootkit-Like Capabilities'' (68ce938ae34f725fce8b67a4).'
author: AlienVault
date: '2025-09-20'
references:
- https://www.cyfirma.com/research/deerstealer-malware-campaign-stealth-persistence-and-rootkit-like-capabilities
tags:
- multi-stage-execution
- rootkit
- data-exfiltration
- xfiles spyware
- persistence
- deerstealer
- uac-bypass
- information-stealing
- stealth
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 196691384955781b831c331f743443a9
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
