title: OTX FileHash-SHA256 IOC - c91595edd1c9a0a2c1168e3bfa532e4a7dbb6b1380afd80ba445b728622798a4
id: a2fe27fc-50c4-42af-8be8-b096342b8e59
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'How a new PlugX variant
  abuses DLL search order hijacking' (68d31c0c8c90127096487d05).
author: AlienVault
date: '2025-09-23'
references:
- https://blog.talosintelligence.com/how-rainyday-turian-and-a-new-plugx-variant-abuse-dll-search-order-hijacking/
tags:
- telecommunications
- manufacturing
- plugx
- rainyday
- backdoordiplomacy
- naikon
- turian
- chinese apt
- dll hijacking
- apt
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: c91595edd1c9a0a2c1168e3bfa532e4a7dbb6b1380afd80ba445b728622798a4
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
