title: OTX FileHash-SHA256 IOC - f4d2c9470b322af29b9188a3a590cbe85bacb9cc8fcd7c2e94d82271ded3f659
id: 7a135759-bc02-4ee9-8560-719ad88af096
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''WARMCOOKIE One Year
  Later: New Features and Fresh Insights'' (68e377d0b3f8991035cc2a27).'
author: AlienVault
date: '2025-10-06'
references:
- https://www.elastic.co/security-labs/revisiting-warmcookie
tags:
- warmcookie
- malware-as-a-service
- castlebot
- backdoor
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: f4d2c9470b322af29b9188a3a590cbe85bacb9cc8fcd7c2e94d82271ded3f659
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
