title: OTX FileHash-SHA1 IOC - e88727d4f95f0a366c2b3b4a742950a14eff04a4
id: 02a67612-8c5e-48e7-930c-76b283ac5479
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''WARMCOOKIE One Year
  Later: New Features and Fresh Insights'' (68e377d0b3f8991035cc2a27).'
author: AlienVault
date: '2025-10-06'
references:
- https://www.elastic.co/security-labs/revisiting-warmcookie
tags:
- warmcookie
- malware-as-a-service
- castlebot
- backdoor
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: e88727d4f95f0a366c2b3b4a742950a14eff04a4
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
