title: OTX FileHash-MD5 IOC - 7a799f4f9aa63745a75b901a392aff29
id: 1a510206-cec5-404e-a533-e9ebcfa1c342
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''WARMCOOKIE One Year
  Later: New Features and Fresh Insights'' (68e377d0b3f8991035cc2a27).'
author: AlienVault
date: '2025-10-06'
references:
- https://www.elastic.co/security-labs/revisiting-warmcookie
tags:
- warmcookie
- malware-as-a-service
- castlebot
- backdoor
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 7a799f4f9aa63745a75b901a392aff29
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
