title: OTX FileHash-SHA1 IOC - ad5e5b00f58396f5a518680e7084dc7dd5f2cc2b
id: 00a94c40-46b5-4b8a-89ff-a5674e891ca8
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The Crown Prince,
  Nezha: A New Tool Favored by China-Nexus Threat Actors'' (68e7e51909bb02e0f22bfc5a).'
author: AlienVault
date: '2025-10-09'
references:
- https://www.huntress.com/blog/nezha-china-nexus-threat-actor-tool
tags:
- log poisoning
- nezha
- web shell
- china chopper
- server monitoring
- ghost rat
- antsword
- remote access trojan
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: ad5e5b00f58396f5a518680e7084dc7dd5f2cc2b
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
