title: OTX FileHash-SHA256 IOC - f3570bb6e0f9c695d48f89f043380b43831dd0f6fe79b16eda2a3ffd9fd7ad16
id: a7747bbf-48a4-400c-8b3a-8142c0b79a2d
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The Crown Prince,
  Nezha: A New Tool Favored by China-Nexus Threat Actors'' (68e7e51909bb02e0f22bfc5a).'
author: AlienVault
date: '2025-10-09'
references:
- https://www.huntress.com/blog/nezha-china-nexus-threat-actor-tool
tags:
- log poisoning
- nezha
- web shell
- china chopper
- server monitoring
- ghost rat
- antsword
- remote access trojan
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: f3570bb6e0f9c695d48f89f043380b43831dd0f6fe79b16eda2a3ffd9fd7ad16
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
