title: OTX FileHash-MD5 IOC - 6f336f372c5a642b57413363265e7d7e
id: 675ccde2-7ee6-4723-9c22-b64b5b3a5fb6
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The Crown Prince,
  Nezha: A New Tool Favored by China-Nexus Threat Actors'' (68e7e51909bb02e0f22bfc5a).'
author: AlienVault
date: '2025-10-09'
references:
- https://www.huntress.com/blog/nezha-china-nexus-threat-actor-tool
tags:
- log poisoning
- nezha
- web shell
- china chopper
- server monitoring
- ghost rat
- antsword
- remote access trojan
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 6f336f372c5a642b57413363265e7d7e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
