title: OTX FileHash-SHA1 IOC - 288365686d1912f65a6b13867173cbcef96a6a42
id: fc0f862a-9800-4a7b-9bd6-7b9b8fc5d80e
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ClayRat: A New Android
  Spyware Targeting Russia'' (68e8c12eb7ebbc52304b33bc).'
author: AlienVault
date: '2025-10-10'
references:
- https://zimperium.com/blog/clayrat-a-new-android-spyware-targeting-russia
tags:
- ClayRat
- Spyware
- phishing
- SMS
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 288365686d1912f65a6b13867173cbcef96a6a42
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
