title: OTX FileHash-MD5 IOC - 9d61fa5984ef7944b893afa870bbbd0c
id: 209f1397-1364-4471-9dd2-881e91880900
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'From Targeting Pwn2Own
  Vulnerabilities to Shotgunning Exploits' (68e86b551440846b11a598a1).
author: AlienVault
date: '2025-10-10'
references:
- https://www.trendmicro.com/en_us/research/25/j/rondodox.html
tags:
- cve-2023-1389
- pwn2own
- cve-2024-3721
- cve-2024-12856
- rondodox
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 9d61fa5984ef7944b893afa870bbbd0c
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
