title: OTX FileHash-SHA256 IOC - c27de10d40a2231f88e1c1664a48f92e75cd71246a65237f815ab35959d55213
id: 750b9f34-85fa-4cd9-939d-77f212e7aba0
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ClayRat: A New Android
  Spyware Targeting Russia'' (68e8c12eb7ebbc52304b33bc).'
author: AlienVault
date: '2025-10-10'
references:
- https://zimperium.com/blog/clayrat-a-new-android-spyware-targeting-russia
tags:
- ClayRat
- Spyware
- phishing
- SMS
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: c27de10d40a2231f88e1c1664a48f92e75cd71246a65237f815ab35959d55213
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
