title: OTX FileHash-SHA256 IOC - 0e83e8bfa61400e2b544190400152a54d3544bf31cfec9dda21954a79cf581e9
id: db9cf36c-7353-42e2-b3b7-8939d77554d1
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''When the monster
  bytes: tracking TA585 and its arsenal'' (68edc60d33bbc8833d677ae6).'
author: AlienVault
date: '2025-10-14'
references:
- https://www.proofpoint.com/us/blog/threat-insight/when-monster-bytes-tracking-ta585-and-its-arsenal
tags:
- stealer
- clickfix
- github
- rhadamanthys
- stealc version 2
- monsterv2
- web injection
- remote access trojan
- lumma stealer
- remcos
- soniccrypt
- cybercrime
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 0e83e8bfa61400e2b544190400152a54d3544bf31cfec9dda21954a79cf581e9
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
