title: OTX FileHash-SHA256 IOC - 666944b19c707afaa05453909d395f979a267b28ff43d90d143cd36f6b74b53e
id: ab8702e9-d275-4365-813f-39da6de6bcae
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''When the monster
  bytes: tracking TA585 and its arsenal'' (68edc60d33bbc8833d677ae6).'
author: AlienVault
date: '2025-10-14'
references:
- https://www.proofpoint.com/us/blog/threat-insight/when-monster-bytes-tracking-ta585-and-its-arsenal
tags:
- stealer
- clickfix
- github
- rhadamanthys
- stealc version 2
- monsterv2
- web injection
- remote access trojan
- lumma stealer
- remcos
- soniccrypt
- cybercrime
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 666944b19c707afaa05453909d395f979a267b28ff43d90d143cd36f6b74b53e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
