title: OTX FileHash-SHA1 IOC - 6eebcc3ab72ea0eeb5b9d3340145b41bea23423b
id: bb9d443b-3fe7-4bdd-aa4b-d8054a42d575
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''When the monster
  bytes: tracking TA585 and its arsenal'' (68edc60d33bbc8833d677ae6).'
author: AlienVault
date: '2025-10-14'
references:
- https://www.proofpoint.com/us/blog/threat-insight/when-monster-bytes-tracking-ta585-and-its-arsenal
tags:
- stealer
- clickfix
- github
- rhadamanthys
- stealc version 2
- monsterv2
- web injection
- remote access trojan
- lumma stealer
- remcos
- soniccrypt
- cybercrime
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 6eebcc3ab72ea0eeb5b9d3340145b41bea23423b
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
