title: OTX FileHash-SHA256 IOC - e7bcd70f0ee4a093461cfb964955200b409dfffd3494b692d54618d277cb309e
id: 77e554bb-64ad-4658-8f9d-da817e6a3f1c
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''When the monster
  bytes: tracking TA585 and its arsenal'' (68edc60d33bbc8833d677ae6).'
author: AlienVault
date: '2025-10-14'
references:
- https://www.proofpoint.com/us/blog/threat-insight/when-monster-bytes-tracking-ta585-and-its-arsenal
tags:
- stealer
- clickfix
- github
- rhadamanthys
- stealc version 2
- monsterv2
- web injection
- remote access trojan
- lumma stealer
- remcos
- soniccrypt
- cybercrime
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: e7bcd70f0ee4a093461cfb964955200b409dfffd3494b692d54618d277cb309e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
