title: OTX FileHash-SHA256 IOC - 93d8fe2065bca71bef2486ad7fa0c935ecc27104abf9e6531875f22cb40d9e8f
id: aa6c3e82-4051-4953-a2ef-5031ea73edb5
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''When the monster
  bytes: tracking TA585 and its arsenal'' (68edc60d33bbc8833d677ae6).'
author: AlienVault
date: '2025-10-14'
references:
- https://www.proofpoint.com/us/blog/threat-insight/when-monster-bytes-tracking-ta585-and-its-arsenal
tags:
- stealer
- clickfix
- github
- rhadamanthys
- stealc version 2
- monsterv2
- web injection
- remote access trojan
- lumma stealer
- remcos
- soniccrypt
- cybercrime
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 93d8fe2065bca71bef2486ad7fa0c935ecc27104abf9e6531875f22cb40d9e8f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
