title: OTX FileHash-MD5 IOC - 73e43654e9f3df0d07d25051b2d3cfeb
id: 56b9e3ab-3a05-49f7-96d9-c127cdc4072b
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''When the monster
  bytes: tracking TA585 and its arsenal'' (68edc60d33bbc8833d677ae6).'
author: AlienVault
date: '2025-10-14'
references:
- https://www.proofpoint.com/us/blog/threat-insight/when-monster-bytes-tracking-ta585-and-its-arsenal
tags:
- stealer
- clickfix
- github
- rhadamanthys
- stealc version 2
- monsterv2
- web injection
- remote access trojan
- lumma stealer
- remcos
- soniccrypt
- cybercrime
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 73e43654e9f3df0d07d25051b2d3cfeb
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
