title: OTX FileHash-MD5 IOC - 6bf997b542d2c2484e0d61a8a2f05c72
id: 3af8aa30-1972-4287-bcd4-c42a73c09fd0
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''When the monster
  bytes: tracking TA585 and its arsenal'' (68edc60d33bbc8833d677ae6).'
author: AlienVault
date: '2025-10-14'
references:
- https://www.proofpoint.com/us/blog/threat-insight/when-monster-bytes-tracking-ta585-and-its-arsenal
tags:
- stealer
- clickfix
- github
- rhadamanthys
- stealc version 2
- monsterv2
- web injection
- remote access trojan
- lumma stealer
- remcos
- soniccrypt
- cybercrime
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 6bf997b542d2c2484e0d61a8a2f05c72
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
