title: OTX FileHash-MD5 IOC - 310c935a189ca01dcee92d9c002f3330
id: c8ec6c33-4ca6-4c51-9fde-68d7755de516
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''When the monster
  bytes: tracking TA585 and its arsenal'' (68edc60d33bbc8833d677ae6).'
author: AlienVault
date: '2025-10-14'
references:
- https://www.proofpoint.com/us/blog/threat-insight/when-monster-bytes-tracking-ta585-and-its-arsenal
tags:
- stealer
- clickfix
- github
- rhadamanthys
- stealc version 2
- monsterv2
- web injection
- remote access trojan
- lumma stealer
- remcos
- soniccrypt
- cybercrime
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 310c935a189ca01dcee92d9c002f3330
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
