title: OTX FileHash-SHA1 IOC - 9c8655554e581f27a014f423756bdc270c2ab8d0
id: 080da532-fc82-463f-b6a9-245552b72066
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''When the monster
  bytes: tracking TA585 and its arsenal'' (68edc60d33bbc8833d677ae6).'
author: AlienVault
date: '2025-10-14'
references:
- https://www.proofpoint.com/us/blog/threat-insight/when-monster-bytes-tracking-ta585-and-its-arsenal
tags:
- stealer
- clickfix
- github
- rhadamanthys
- stealc version 2
- monsterv2
- web injection
- remote access trojan
- lumma stealer
- remcos
- soniccrypt
- cybercrime
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 9c8655554e581f27a014f423756bdc270c2ab8d0
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
