title: OTX FileHash-SHA256 IOC - ba72e8024c90aeffbd56cdf2ab9033a323b63c83bd5df19268978cded466214e
id: 98ef1f3b-fa59-4809-96c2-60a10771bbcd
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''When the monster
  bytes: tracking TA585 and its arsenal'' (68edc60d33bbc8833d677ae6).'
author: AlienVault
date: '2025-10-14'
references:
- https://www.proofpoint.com/us/blog/threat-insight/when-monster-bytes-tracking-ta585-and-its-arsenal
tags:
- stealer
- clickfix
- github
- rhadamanthys
- stealc version 2
- monsterv2
- web injection
- remote access trojan
- lumma stealer
- remcos
- soniccrypt
- cybercrime
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: ba72e8024c90aeffbd56cdf2ab9033a323b63c83bd5df19268978cded466214e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
