title: OTX FileHash-SHA1 IOC - c4efac1602cb8ff376b2aad51fc6067d30e84336
id: 093d1b88-0b3f-4292-a54b-5c1f7151f287
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Banking Trojan Abusing
  GitHub for Resilience' (68ee1391e202d5db1c015e71).
author: AlienVault
date: '2025-10-14'
references: []
tags:
- guildma
- github abuse
- banking trojan
- cryptocurrency
- steganography
- keylogging
- astaroth
- south america
- phishing
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: c4efac1602cb8ff376b2aad51fc6067d30e84336
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
