title: OTX FileHash-SHA1 IOC - 5fcce6c94043f57c0a396ffdce4f316f5e1b67cf
id: 0fe870d7-b201-42e6-8b30-87e823a56805
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Banking Trojan Abusing
  GitHub for Resilience' (68ee1391e202d5db1c015e71).
author: AlienVault
date: '2025-10-14'
references: []
tags:
- guildma
- github abuse
- banking trojan
- cryptocurrency
- steganography
- keylogging
- astaroth
- south america
- phishing
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 5fcce6c94043f57c0a396ffdce4f316f5e1b67cf
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
