title: OTX FileHash-SHA1 IOC - 9528ecb699c86cff21ef20330f8f9318b99c4715
id: 3e115e1f-e803-49f2-8ce2-5759c278654c
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Banking Trojan Abusing
  GitHub for Resilience' (68ee1391e202d5db1c015e71).
author: AlienVault
date: '2025-10-14'
references: []
tags:
- guildma
- github abuse
- banking trojan
- cryptocurrency
- steganography
- keylogging
- astaroth
- south america
- phishing
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 9528ecb699c86cff21ef20330f8f9318b99c4715
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
