title: OTX FileHash-MD5 IOC - 6b50695795ada6c00aead68d9090c739
id: 39657547-cf31-42ed-8064-5e074a20e83e
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Banking Trojan Abusing
  GitHub for Resilience' (68ee1391e202d5db1c015e71).
author: AlienVault
date: '2025-10-14'
references: []
tags:
- guildma
- github abuse
- banking trojan
- cryptocurrency
- steganography
- keylogging
- astaroth
- south america
- phishing
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 6b50695795ada6c00aead68d9090c739
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
