title: OTX FileHash-MD5 IOC - 037b2f6233ccc82f0c75bf56c47742bb
id: 3312c54e-b2c1-4e1c-be3a-ecb7f5448cfb
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Mysterious Elephant
  APT: TTPs and tools'' (68efd379576217166803e5e1).'
author: AlienVault
date: '2025-10-15'
references:
- https://securelist.com/mysterious-elephant-apt-ttps-and-tools/117596/
tags:
- custom tools
- babshell
- stom exfiltrator
- foreign affairs
- memloader hidendesk
- whatsapp exploitation
- memloader edge
- uplo exfiltrator
- government targets
- remcos
- chromestealer exfiltrator
- vrat
- exfiltration
- apt
- asia-pacific
- spear phishing
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 037b2f6233ccc82f0c75bf56c47742bb
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
