title: OTX FileHash-MD5 IOC - c12ea05baf94ef6f0ea73470d70db3b2
id: fc40b58a-c4d1-482b-b6d3-5ea2f32372ac
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Mysterious Elephant
  APT: TTPs and tools'' (68efd379576217166803e5e1).'
author: AlienVault
date: '2025-10-15'
references:
- https://securelist.com/mysterious-elephant-apt-ttps-and-tools/117596/
tags:
- custom tools
- babshell
- stom exfiltrator
- foreign affairs
- memloader hidendesk
- whatsapp exploitation
- memloader edge
- uplo exfiltrator
- government targets
- remcos
- chromestealer exfiltrator
- vrat
- exfiltration
- apt
- asia-pacific
- spear phishing
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: c12ea05baf94ef6f0ea73470d70db3b2
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
