title: OTX FileHash-MD5 IOC - 8650fff81d597e1a3406baf3bb87297f
id: 0b4fab8d-50a6-43a0-9daf-47dfb6bc3cdd
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Mysterious Elephant
  APT: TTPs and tools'' (68efd379576217166803e5e1).'
author: AlienVault
date: '2025-10-15'
references:
- https://securelist.com/mysterious-elephant-apt-ttps-and-tools/117596/
tags:
- custom tools
- babshell
- stom exfiltrator
- foreign affairs
- memloader hidendesk
- whatsapp exploitation
- memloader edge
- uplo exfiltrator
- government targets
- remcos
- chromestealer exfiltrator
- vrat
- exfiltration
- apt
- asia-pacific
- spear phishing
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 8650fff81d597e1a3406baf3bb87297f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
