title: OTX FileHash-MD5 IOC - 85c7f209a8fa47285f08b09b3868c2a1
id: 8f393bd1-0908-4e4d-a4ec-f937e27b82b8
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Mysterious Elephant
  APT: TTPs and tools'' (68efd379576217166803e5e1).'
author: AlienVault
date: '2025-10-15'
references:
- https://securelist.com/mysterious-elephant-apt-ttps-and-tools/117596/
tags:
- custom tools
- babshell
- stom exfiltrator
- foreign affairs
- memloader hidendesk
- whatsapp exploitation
- memloader edge
- uplo exfiltrator
- government targets
- remcos
- chromestealer exfiltrator
- vrat
- exfiltration
- apt
- asia-pacific
- spear phishing
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 85c7f209a8fa47285f08b09b3868c2a1
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
