title: OTX FileHash-MD5 IOC - cf1d14e59c38695d87d85af76db9a861
id: 4aa03832-0d20-49f8-be48-89ef472659a6
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Mysterious Elephant
  APT: TTPs and tools'' (68efd379576217166803e5e1).'
author: AlienVault
date: '2025-10-15'
references:
- https://securelist.com/mysterious-elephant-apt-ttps-and-tools/117596/
tags:
- custom tools
- babshell
- stom exfiltrator
- foreign affairs
- memloader hidendesk
- whatsapp exploitation
- memloader edge
- uplo exfiltrator
- government targets
- remcos
- chromestealer exfiltrator
- vrat
- exfiltration
- apt
- asia-pacific
- spear phishing
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: cf1d14e59c38695d87d85af76db9a861
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
