title: OTX FileHash-MD5 IOC - 4c32e12e73be9979ede3f8fce4f41a3a
id: 183b4c09-9f1e-4aed-aab9-d15794143508
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Mysterious Elephant
  APT: TTPs and tools'' (68efd379576217166803e5e1).'
author: AlienVault
date: '2025-10-15'
references:
- https://securelist.com/mysterious-elephant-apt-ttps-and-tools/117596/
tags:
- custom tools
- babshell
- stom exfiltrator
- foreign affairs
- memloader hidendesk
- whatsapp exploitation
- memloader edge
- uplo exfiltrator
- government targets
- remcos
- chromestealer exfiltrator
- vrat
- exfiltration
- apt
- asia-pacific
- spear phishing
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 4c32e12e73be9979ede3f8fce4f41a3a
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
