title: OTX FileHash-MD5 IOC - 78b59ea529a7bddb3d63fcbe0fe7af94
id: 76af01d2-0160-4714-ab24-f2df6744b7f3
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Mysterious Elephant
  APT: TTPs and tools'' (68efd379576217166803e5e1).'
author: AlienVault
date: '2025-10-15'
references:
- https://securelist.com/mysterious-elephant-apt-ttps-and-tools/117596/
tags:
- custom tools
- babshell
- stom exfiltrator
- foreign affairs
- memloader hidendesk
- whatsapp exploitation
- memloader edge
- uplo exfiltrator
- government targets
- remcos
- chromestealer exfiltrator
- vrat
- exfiltration
- apt
- asia-pacific
- spear phishing
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 78b59ea529a7bddb3d63fcbe0fe7af94
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
