title: OTX FileHash-MD5 IOC - f947ff7fb94fa35a532f8a7d99181cf1
id: 99f4c6d9-d1fd-4aff-9a34-8f29405eaa59
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Mysterious Elephant
  APT: TTPs and tools'' (68efd379576217166803e5e1).'
author: AlienVault
date: '2025-10-15'
references:
- https://securelist.com/mysterious-elephant-apt-ttps-and-tools/117596/
tags:
- custom tools
- babshell
- stom exfiltrator
- foreign affairs
- memloader hidendesk
- whatsapp exploitation
- memloader edge
- uplo exfiltrator
- government targets
- remcos
- chromestealer exfiltrator
- vrat
- exfiltration
- apt
- asia-pacific
- spear phishing
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: f947ff7fb94fa35a532f8a7d99181cf1
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
