title: OTX FileHash-SHA1 IOC - 0d4f15a4859e0b985b67bfbc133b6f11e68a48c9
id: 2d5e163b-0d13-49b4-b90f-bcae03cc924e
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Mysterious Elephant
  APT: TTPs and tools'' (68efd379576217166803e5e1).'
author: AlienVault
date: '2025-10-15'
references:
- https://securelist.com/mysterious-elephant-apt-ttps-and-tools/117596/
tags:
- custom tools
- babshell
- stom exfiltrator
- foreign affairs
- memloader hidendesk
- whatsapp exploitation
- memloader edge
- uplo exfiltrator
- government targets
- remcos
- chromestealer exfiltrator
- vrat
- exfiltration
- apt
- asia-pacific
- spear phishing
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 0d4f15a4859e0b985b67bfbc133b6f11e68a48c9
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
