title: OTX FileHash-SHA256 IOC - 3023b0331baff73ff894087d1a425ea4b2746caf514ada624370318f27e29c2c
id: 52a50606-9cff-40a1-b5b9-649fc7e08225
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''New Group on the
  Block: UNC5142 Leverages EtherHiding to Distribute Malware'' (68f130fe56a14a2de8f391b4).'
author: AlienVault
date: '2025-10-16'
references:
- https://cloud.google.com/blog/topics/threat-intelligence/unc5142-etherhiding-distribute-malware
tags:
- smart contracts
- blockchain
- cloudflare pages
- bnb smart chain
- atomic
- lummac.v2
- vidar
- infostealers
- radthief
- clearshort
- wordpress
- etherhiding
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 3023b0331baff73ff894087d1a425ea4b2746caf514ada624370318f27e29c2c
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
