title: OTX FileHash-SHA256 IOC - 88019011af71af986a64f68316e80f30d3f57186aa62c3cef5ed139eb49a6842
id: 60b0f286-5751-4e5f-8b38-01bd692a4845
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''New Group on the
  Block: UNC5142 Leverages EtherHiding to Distribute Malware'' (68f130fe56a14a2de8f391b4).'
author: AlienVault
date: '2025-10-16'
references:
- https://cloud.google.com/blog/topics/threat-intelligence/unc5142-etherhiding-distribute-malware
tags:
- smart contracts
- blockchain
- cloudflare pages
- bnb smart chain
- atomic
- lummac.v2
- vidar
- infostealers
- radthief
- clearshort
- wordpress
- etherhiding
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 88019011af71af986a64f68316e80f30d3f57186aa62c3cef5ed139eb49a6842
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
