title: OTX FileHash-SHA256 IOC - 4b47b55ae448668e549ffc04e82aee41ac10e3c8b183012a105faf2360fc5ec1
id: 1cf1c29e-7fca-46c4-826b-8113e6f140b9
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''New Group on the
  Block: UNC5142 Leverages EtherHiding to Distribute Malware'' (68f130fe56a14a2de8f391b4).'
author: AlienVault
date: '2025-10-16'
references:
- https://cloud.google.com/blog/topics/threat-intelligence/unc5142-etherhiding-distribute-malware
tags:
- smart contracts
- blockchain
- cloudflare pages
- bnb smart chain
- atomic
- lummac.v2
- vidar
- infostealers
- radthief
- clearshort
- wordpress
- etherhiding
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 4b47b55ae448668e549ffc04e82aee41ac10e3c8b183012a105faf2360fc5ec1
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
