title: OTX FileHash-MD5 IOC - e94affb98148fc4e0cfb9a486bb37160
id: 309ab47e-06bb-4ee4-beb0-1016d4042f9d
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''New Group on the
  Block: UNC5142 Leverages EtherHiding to Distribute Malware'' (68f130fe56a14a2de8f391b4).'
author: AlienVault
date: '2025-10-16'
references:
- https://cloud.google.com/blog/topics/threat-intelligence/unc5142-etherhiding-distribute-malware
tags:
- smart contracts
- blockchain
- cloudflare pages
- bnb smart chain
- atomic
- lummac.v2
- vidar
- infostealers
- radthief
- clearshort
- wordpress
- etherhiding
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: e94affb98148fc4e0cfb9a486bb37160
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
