title: OTX FileHash-SHA1 IOC - 53fd54f55c93f9bcca471cd0ccbabc3acbd3e4aa
id: a150073f-6470-482b-902a-deba8b48a213
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''New Group on the
  Block: UNC5142 Leverages EtherHiding to Distribute Malware'' (68f130fe56a14a2de8f391b4).'
author: AlienVault
date: '2025-10-16'
references:
- https://cloud.google.com/blog/topics/threat-intelligence/unc5142-etherhiding-distribute-malware
tags:
- smart contracts
- blockchain
- cloudflare pages
- bnb smart chain
- atomic
- lummac.v2
- vidar
- infostealers
- radthief
- clearshort
- wordpress
- etherhiding
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 53fd54f55c93f9bcca471cd0ccbabc3acbd3e4aa
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
