title: OTX FileHash-SHA1 IOC - 9179dda8b285040bf381aabb8a1f4a1b8c37ed53
id: 9bf2ffc0-cde1-472a-898a-d433e324e2b7
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''New Group on the
  Block: UNC5142 Leverages EtherHiding to Distribute Malware'' (68f130fe56a14a2de8f391b4).'
author: AlienVault
date: '2025-10-16'
references:
- https://cloud.google.com/blog/topics/threat-intelligence/unc5142-etherhiding-distribute-malware
tags:
- smart contracts
- blockchain
- cloudflare pages
- bnb smart chain
- atomic
- lummac.v2
- vidar
- infostealers
- radthief
- clearshort
- wordpress
- etherhiding
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 9179dda8b285040bf381aabb8a1f4a1b8c37ed53
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
