title: OTX FileHash-SHA256 IOC - bcbdb74f97092dfd68e7ec1d6770b6d1e1aae091f43bcebb0b7bce6c8188e310
id: 6b1550e7-aab8-4d52-a93c-500159f987e0
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''New Group on the
  Block: UNC5142 Leverages EtherHiding to Distribute Malware'' (68f130fe56a14a2de8f391b4).'
author: AlienVault
date: '2025-10-16'
references:
- https://cloud.google.com/blog/topics/threat-intelligence/unc5142-etherhiding-distribute-malware
tags:
- smart contracts
- blockchain
- cloudflare pages
- bnb smart chain
- atomic
- lummac.v2
- vidar
- infostealers
- radthief
- clearshort
- wordpress
- etherhiding
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: bcbdb74f97092dfd68e7ec1d6770b6d1e1aae091f43bcebb0b7bce6c8188e310
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
