title: OTX FileHash-SHA256 IOC - 4ffb3c0c7b38105183fb06d1084ab943c6e87f9644f783014684c5cb8db32e32
id: 3f1efe58-1c82-4ba2-9e4f-75df295cc30e
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''From Scripts to
  Systems: A Comprehensive Look at Tangerine Turkey Operations'' (69025ee928e599316086e029).'
author: AlienVault
date: '2025-10-29'
references:
- https://www.cybereason.com/blog/tangerine-turkey?hs_amp=true
tags:
- vbscript
- living-off-the-land
- xmrig
- defense-evasion
- worm
- persistence
- cryptomining
- usb
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 4ffb3c0c7b38105183fb06d1084ab943c6e87f9644f783014684c5cb8db32e32
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
