title: OTX FileHash-MD5 IOC - f36e4ebb6471f6b6803f381ca8512022
id: e109506d-1a36-4f30-b474-b337d050beaa
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''From Scripts to
  Systems: A Comprehensive Look at Tangerine Turkey Operations'' (69025ee928e599316086e029).'
author: AlienVault
date: '2025-10-29'
references:
- https://www.cybereason.com/blog/tangerine-turkey?hs_amp=true
tags:
- vbscript
- living-off-the-land
- xmrig
- defense-evasion
- worm
- persistence
- cryptomining
- usb
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: f36e4ebb6471f6b6803f381ca8512022
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
