title: OTX FileHash-MD5 IOC - ceaa7758a1e46f44c980285d86f4f747
id: 49e44a20-2fc9-4596-b7b7-d8751a51d797
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''From Scripts to
  Systems: A Comprehensive Look at Tangerine Turkey Operations'' (69025ee928e599316086e029).'
author: AlienVault
date: '2025-10-29'
references:
- https://www.cybereason.com/blog/tangerine-turkey?hs_amp=true
tags:
- vbscript
- living-off-the-land
- xmrig
- defense-evasion
- worm
- persistence
- cryptomining
- usb
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: ceaa7758a1e46f44c980285d86f4f747
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
