title: OTX FileHash-SHA1 IOC - 0acee5fcc1722b754a0cb31c031a12f5ace98f91
id: 294ef3ef-7208-41be-a852-a38b2e732d44
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''From Scripts to
  Systems: A Comprehensive Look at Tangerine Turkey Operations'' (69025ee928e599316086e029).'
author: AlienVault
date: '2025-10-29'
references:
- https://www.cybereason.com/blog/tangerine-turkey?hs_amp=true
tags:
- vbscript
- living-off-the-land
- xmrig
- defense-evasion
- worm
- persistence
- cryptomining
- usb
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 0acee5fcc1722b754a0cb31c031a12f5ace98f91
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
