title: OTX FileHash-SHA1 IOC - a614bda08eb586d8cd457ab8a503ac762c14de1c
id: 98837e0c-c4fa-4247-925a-0c936e097986
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''From Scripts to
  Systems: A Comprehensive Look at Tangerine Turkey Operations'' (69025ee928e599316086e029).'
author: AlienVault
date: '2025-10-29'
references:
- https://www.cybereason.com/blog/tangerine-turkey?hs_amp=true
tags:
- vbscript
- living-off-the-land
- xmrig
- defense-evasion
- worm
- persistence
- cryptomining
- usb
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: a614bda08eb586d8cd457ab8a503ac762c14de1c
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
