title: OTX FileHash-SHA1 IOC - f914b2dcc9e874e1807ff804579c7c02026049b1
id: 3430d66e-8dcb-4ee2-a5b8-6a69eaabdfa5
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''From Scripts to
  Systems: A Comprehensive Look at Tangerine Turkey Operations'' (69025ee928e599316086e029).'
author: AlienVault
date: '2025-10-29'
references:
- https://www.cybereason.com/blog/tangerine-turkey?hs_amp=true
tags:
- vbscript
- living-off-the-land
- xmrig
- defense-evasion
- worm
- persistence
- cryptomining
- usb
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: f914b2dcc9e874e1807ff804579c7c02026049b1
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
