title: OTX FileHash-SHA256 IOC - 4617cfd1e66aab547770f049abd937b46c4722ee33bbf97042aab77331aa6525
id: 9cad59eb-5396-4251-a8c2-a85e945d9301
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''From Scripts to
  Systems: A Comprehensive Look at Tangerine Turkey Operations'' (69025ee928e599316086e029).'
author: AlienVault
date: '2025-10-29'
references:
- https://www.cybereason.com/blog/tangerine-turkey?hs_amp=true
tags:
- vbscript
- living-off-the-land
- xmrig
- defense-evasion
- worm
- persistence
- cryptomining
- usb
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 4617cfd1e66aab547770f049abd937b46c4722ee33bbf97042aab77331aa6525
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
