title: OTX FileHash-SHA256 IOC - 92ab1a93499aae4c8b0c47476b24af5f1cf209f39857f654dc7e567e40f84c30
id: ef9a50ef-971f-47cb-8eb3-2f3d9e488b6e
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Tracking an evolving
  Discord-based RAT family' (6904823ed648a76ab78fcf7d).
author: AlienVault
date: '2025-10-31'
references:
- https://www.reversinglabs.com/blog/tracking-discord-rat-family
tags:
- std rat
- propionanilide
- uwudisrat
- minecraft rat
- propionanilide rat
- discord
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 92ab1a93499aae4c8b0c47476b24af5f1cf209f39857f654dc7e567e40f84c30
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
