title: OTX FileHash-SHA1 IOC - eb0d113832f6f1ad0938128964f2513f6e485538
id: 2213d0e6-f5dc-4c36-b104-f4fbecb0bef7
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Remote access, real
  cargo: cybercriminals targeting trucking and logistics'' (6908bc12c65b2822b687ed79).'
author: AlienVault
date: '2025-11-03'
references:
- https://www.proofpoint.com/us/blog/threat-insight/remote-access-real-cargo-cybercriminals-targeting-trucking-and-logistics
tags:
- screenconnect
- lumma stealer
- phishing
- simplehelp
- cargo theft
- fleetdeck
- n-able
- logmein resolve
- danabot
- trucking
- logistics
- cybercrime
- netsupport
- social engineering
- supply chain
- stealc
- remote monitoring tools
- pdq connect
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: eb0d113832f6f1ad0938128964f2513f6e485538
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
