title: OTX FileHash-SHA256 IOC - 559618e2ffbd3b8b849a6ad0d73a5630f87033976c7adccbd80c41c0b2312765
id: 165040a5-7843-400b-9a13-6f605bf28340
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Remote access, real
  cargo: cybercriminals targeting trucking and logistics'' (6908bc12c65b2822b687ed79).'
author: AlienVault
date: '2025-11-03'
references:
- https://www.proofpoint.com/us/blog/threat-insight/remote-access-real-cargo-cybercriminals-targeting-trucking-and-logistics
tags:
- screenconnect
- lumma stealer
- phishing
- simplehelp
- cargo theft
- fleetdeck
- n-able
- logmein resolve
- danabot
- trucking
- logistics
- cybercrime
- netsupport
- social engineering
- supply chain
- stealc
- remote monitoring tools
- pdq connect
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 559618e2ffbd3b8b849a6ad0d73a5630f87033976c7adccbd80c41c0b2312765
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
