title: OTX FileHash-SHA1 IOC - 8f31f69f88a75d5faab4f94cfc2ec8a649fe1a24
id: e8f54039-2649-4b2d-99c6-5ac3ca17687f
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The DragonForce
  Cartel: Scattered Spider at the gate'' (690b1a8fb4a0df0cf6a16178).'
author: AlienVault
date: '2025-11-05'
references:
- https://www.acronis.com/en/tru/posts/the-dragonforce-cartel-scattered-spider-at-the-gate/
tags:
- conti
- dragonforce
- social engineering
- global
- scattered spider
- ransomware
- cartel
- byovd
- encryption
- mamona
- devman
- affiliate program
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 8f31f69f88a75d5faab4f94cfc2ec8a649fe1a24
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
