title: OTX FileHash-MD5 IOC - beadd181d0dbbbe36e0e311c5211a5dd
id: 43a80383-e139-4b71-af39-7bea020d8bec
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The DragonForce
  Cartel: Scattered Spider at the gate'' (690b1a8fb4a0df0cf6a16178).'
author: AlienVault
date: '2025-11-05'
references:
- https://www.acronis.com/en/tru/posts/the-dragonforce-cartel-scattered-spider-at-the-gate/
tags:
- conti
- dragonforce
- social engineering
- global
- scattered spider
- ransomware
- cartel
- byovd
- encryption
- mamona
- devman
- affiliate program
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: beadd181d0dbbbe36e0e311c5211a5dd
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
