title: OTX FileHash-MD5 IOC - e84270afa3030b48dc9e0c53a35c65aa
id: 13fec679-840f-40d5-8633-07e9162b806e
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The DragonForce
  Cartel: Scattered Spider at the gate'' (690b1a8fb4a0df0cf6a16178).'
author: AlienVault
date: '2025-11-05'
references:
- https://www.acronis.com/en/tru/posts/the-dragonforce-cartel-scattered-spider-at-the-gate/
tags:
- conti
- dragonforce
- social engineering
- global
- scattered spider
- ransomware
- cartel
- byovd
- encryption
- mamona
- devman
- affiliate program
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: e84270afa3030b48dc9e0c53a35c65aa
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
