title: OTX FileHash-SHA256 IOC - f5df98b344242c5eaad1fce421c640fadd71f7f21379d2bf7309001dfeb25972
id: bc749f71-3f70-49f2-9eda-4b3daa502d95
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The DragonForce
  Cartel: Scattered Spider at the gate'' (690b1a8fb4a0df0cf6a16178).'
author: AlienVault
date: '2025-11-05'
references:
- https://www.acronis.com/en/tru/posts/the-dragonforce-cartel-scattered-spider-at-the-gate/
tags:
- conti
- dragonforce
- social engineering
- global
- scattered spider
- ransomware
- cartel
- byovd
- encryption
- mamona
- devman
- affiliate program
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: f5df98b344242c5eaad1fce421c640fadd71f7f21379d2bf7309001dfeb25972
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
