title: OTX FileHash-SHA1 IOC - 818d0e9047f538fa85283d3343bd7d75e5bfc49f
id: 513eab4d-930d-4c74-802e-1bd592dbccca
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The DragonForce
  Cartel: Scattered Spider at the gate'' (690b1a8fb4a0df0cf6a16178).'
author: AlienVault
date: '2025-11-05'
references:
- https://www.acronis.com/en/tru/posts/the-dragonforce-cartel-scattered-spider-at-the-gate/
tags:
- conti
- dragonforce
- social engineering
- global
- scattered spider
- ransomware
- cartel
- byovd
- encryption
- mamona
- devman
- affiliate program
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 818d0e9047f538fa85283d3343bd7d75e5bfc49f
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
