title: OTX FileHash-SHA1 IOC - 716cb58d66e5a59b53c90d427d17c5cc53a68f80
id: f86fee27-18ee-45b9-863c-3d134513073d
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The DragonForce
  Cartel: Scattered Spider at the gate'' (690b1a8fb4a0df0cf6a16178).'
author: AlienVault
date: '2025-11-05'
references:
- https://www.acronis.com/en/tru/posts/the-dragonforce-cartel-scattered-spider-at-the-gate/
tags:
- conti
- dragonforce
- social engineering
- global
- scattered spider
- ransomware
- cartel
- byovd
- encryption
- mamona
- devman
- affiliate program
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 716cb58d66e5a59b53c90d427d17c5cc53a68f80
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
