title: OTX FileHash-MD5 IOC - e67e7b8e0fb6baff4f25bb05dd5a5e21
id: 30bb9e40-7e16-45d0-a961-a6ccd34728ec
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The DragonForce
  Cartel: Scattered Spider at the gate'' (690b1a8fb4a0df0cf6a16178).'
author: AlienVault
date: '2025-11-05'
references:
- https://www.acronis.com/en/tru/posts/the-dragonforce-cartel-scattered-spider-at-the-gate/
tags:
- conti
- dragonforce
- social engineering
- global
- scattered spider
- ransomware
- cartel
- byovd
- encryption
- mamona
- devman
- affiliate program
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: e67e7b8e0fb6baff4f25bb05dd5a5e21
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
