title: OTX FileHash-SHA1 IOC - e8ad966042f179c415c605750488c9df353e4d2e
id: 4a35d5d9-4e20-401b-b5e6-5e2b20e290df
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The DragonForce
  Cartel: Scattered Spider at the gate'' (690b1a8fb4a0df0cf6a16178).'
author: AlienVault
date: '2025-11-05'
references:
- https://www.acronis.com/en/tru/posts/the-dragonforce-cartel-scattered-spider-at-the-gate/
tags:
- conti
- dragonforce
- social engineering
- global
- scattered spider
- ransomware
- cartel
- byovd
- encryption
- mamona
- devman
- affiliate program
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: e8ad966042f179c415c605750488c9df353e4d2e
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
