title: OTX FileHash-MD5 IOC - 3357b96f7baef169e28ed5a24ea79f59
id: a07ed28a-ef6b-44a3-9ebf-50bd87e6814d
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The DragonForce
  Cartel: Scattered Spider at the gate'' (690b1a8fb4a0df0cf6a16178).'
author: AlienVault
date: '2025-11-05'
references:
- https://www.acronis.com/en/tru/posts/the-dragonforce-cartel-scattered-spider-at-the-gate/
tags:
- conti
- dragonforce
- social engineering
- global
- scattered spider
- ransomware
- cartel
- byovd
- encryption
- mamona
- devman
- affiliate program
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 3357b96f7baef169e28ed5a24ea79f59
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
