title: OTX FileHash-SHA1 IOC - 6d38ab49155bda7ed79a0eec8fbb7fb3d37166b1
id: ad06cbc7-9912-4580-ad57-ad2e3f64bfd8
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The DragonForce
  Cartel: Scattered Spider at the gate'' (690b1a8fb4a0df0cf6a16178).'
author: AlienVault
date: '2025-11-05'
references:
- https://www.acronis.com/en/tru/posts/the-dragonforce-cartel-scattered-spider-at-the-gate/
tags:
- conti
- dragonforce
- social engineering
- global
- scattered spider
- ransomware
- cartel
- byovd
- encryption
- mamona
- devman
- affiliate program
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 6d38ab49155bda7ed79a0eec8fbb7fb3d37166b1
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
