title: OTX FileHash-MD5 IOC - ada4e228e982a7e309bb6a3308e4872d
id: 1a74f421-0af1-40ab-90a0-73012007be40
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The DragonForce
  Cartel: Scattered Spider at the gate'' (690b1a8fb4a0df0cf6a16178).'
author: AlienVault
date: '2025-11-05'
references:
- https://www.acronis.com/en/tru/posts/the-dragonforce-cartel-scattered-spider-at-the-gate/
tags:
- conti
- dragonforce
- social engineering
- global
- scattered spider
- ransomware
- cartel
- byovd
- encryption
- mamona
- devman
- affiliate program
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: ada4e228e982a7e309bb6a3308e4872d
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
