title: OTX FileHash-SHA256 IOC - b10129c175c007148dd4f5aff4d7fb61eb3e4b0ed4897fea6b33e90555f2b845
id: 1eeeb65a-8da5-4905-9065-00a3c19834d8
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The DragonForce
  Cartel: Scattered Spider at the gate'' (690b1a8fb4a0df0cf6a16178).'
author: AlienVault
date: '2025-11-05'
references:
- https://www.acronis.com/en/tru/posts/the-dragonforce-cartel-scattered-spider-at-the-gate/
tags:
- conti
- dragonforce
- social engineering
- global
- scattered spider
- ransomware
- cartel
- byovd
- encryption
- mamona
- devman
- affiliate program
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: b10129c175c007148dd4f5aff4d7fb61eb3e4b0ed4897fea6b33e90555f2b845
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
