title: OTX FileHash-MD5 IOC - 333d79fc5f5d53d7f4fa285d588982ff
id: 4df25966-6854-435e-81f7-bf0dfc338d56
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The DragonForce
  Cartel: Scattered Spider at the gate'' (690b1a8fb4a0df0cf6a16178).'
author: AlienVault
date: '2025-11-05'
references:
- https://www.acronis.com/en/tru/posts/the-dragonforce-cartel-scattered-spider-at-the-gate/
tags:
- conti
- dragonforce
- social engineering
- global
- scattered spider
- ransomware
- cartel
- byovd
- encryption
- mamona
- devman
- affiliate program
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 333d79fc5f5d53d7f4fa285d588982ff
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
