title: OTX FileHash-SHA1 IOC - 3e01df0155a539fe6d802ee9e9226d8c77fd96c9
id: bf920404-b348-4e4f-8d6f-451a8babf9ce
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Cat''s Got Your
  Files: Lynx Ransomware'' (691b65be81167e8300b087de).'
author: AlienVault
date: '2025-11-17'
references:
- https://thedfirreport.com/2025/11/17/cats-got-your-files-lynx-ransomware
tags:
- network reconnaissance
- lynx ransomware
- rdp
- backup deletion
- credential abuse
- data exfiltration
- ransomware
- lateral movement
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha1: 3e01df0155a539fe6d802ee9e9226d8c77fd96c9
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
