title: OTX FileHash-MD5 IOC - 3073af95dfc18361caebccd69d0021a2
id: 363f9c10-0b22-408b-9d25-b788e9bdbc6a
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Cat''s Got Your
  Files: Lynx Ransomware'' (691b65be81167e8300b087de).'
author: AlienVault
date: '2025-11-17'
references:
- https://thedfirreport.com/2025/11/17/cats-got-your-files-lynx-ransomware
tags:
- network reconnaissance
- lynx ransomware
- rdp
- backup deletion
- credential abuse
- data exfiltration
- ransomware
- lateral movement
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: 3073af95dfc18361caebccd69d0021a2
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
