title: OTX FileHash-MD5 IOC - e2179046b86deca297ebf7398b95e438
id: 76d39822-5012-42ba-8379-202ba6a11e81
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Cat''s Got Your
  Files: Lynx Ransomware'' (691b65be81167e8300b087de).'
author: AlienVault
date: '2025-11-17'
references:
- https://thedfirreport.com/2025/11/17/cats-got-your-files-lynx-ransomware
tags:
- network reconnaissance
- lynx ransomware
- rdp
- backup deletion
- credential abuse
- data exfiltration
- ransomware
- lateral movement
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: e2179046b86deca297ebf7398b95e438
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
