title: OTX FileHash-SHA256 IOC - 3e131fe553009de2645b0c68a4a731114973ddef040d313028499972d127182d
id: ee5b5b91-ba78-4a3a-943b-6067e7250382
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Stories from the
  SOC: Mystery of the postponed proxyware install'' (6924c9aad09e7e30fb5d9b70).'
author: AlienVault
date: '2025-11-24'
references:
- https://expel.com/blog/stories-from-the-soc-mystery-of-the-postponed-proxyware-install
tags:
- download cradle
- node.js
- unauthorized software
- in-memory execution
- c2 server
- disk-cleaning utility
- proxyware
- powershell
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 3e131fe553009de2645b0c68a4a731114973ddef040d313028499972d127182d
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
