title: OTX FileHash-SHA256 IOC - 9e694f03742aa171cc0d4c84127e4fc8d3ae187ebb1c6905f144a744ce030577
id: 8bff4f62-fa0e-4200-b61a-c30ab9b9574f
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Stories from the
  SOC: Mystery of the postponed proxyware install'' (6924c9aad09e7e30fb5d9b70).'
author: AlienVault
date: '2025-11-24'
references:
- https://expel.com/blog/stories-from-the-soc-mystery-of-the-postponed-proxyware-install
tags:
- download cradle
- node.js
- unauthorized software
- in-memory execution
- c2 server
- disk-cleaning utility
- proxyware
- powershell
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.sha256: 9e694f03742aa171cc0d4c84127e4fc8d3ae187ebb1c6905f144a744ce030577
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
