title: OTX FileHash-MD5 IOC - bfc34934a91a4893817098f73415917a
id: 692aa65f-3cfd-4d5a-a093-3af1b185a1cb
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Stories from the
  SOC: Mystery of the postponed proxyware install'' (6924c9aad09e7e30fb5d9b70).'
author: AlienVault
date: '2025-11-24'
references:
- https://expel.com/blog/stories-from-the-soc-mystery-of-the-postponed-proxyware-install
tags:
- download cradle
- node.js
- unauthorized software
- in-memory execution
- c2 server
- disk-cleaning utility
- proxyware
- powershell
- otx
- threat-intel
logsource:
  category: file
detection:
  selection:
    file.hash.md5: bfc34934a91a4893817098f73415917a
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
