title: OTX IPv4 IOC - 179.60.149.244
id: 9384e281-32c8-48f7-93aa-3c4749b7e455
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''CLOP RANSOMWARE:
  DISSECTING NETWORK - THE RAVEN FILE'' (690b1b175f4f05eaf8f6c0e0).'
author: AlienVault
date: '2025-11-05'
references:
- https://theravenfile.com/2025/11/04/clop-ransomware-dissecting-network/
tags:
- cve-2025-61882
- cve-2023-0669
- cyclops blink
- cryptomix
- infrastructure
- oracle ebs
- cve-2023-34362
- ransomware
- fingerprints
- ip addresses
- network analysis
- otx
- threat-intel
logsource:
  category: network
detection:
  selection:
    dst_ip: 179.60.149.244
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
