title: OTX IPv4 IOC - 5.188.87.49
id: 0aee21ce-0e0d-40b6-a76f-e0343e059fd7
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''CLOP RANSOMWARE:
  DISSECTING NETWORK - THE RAVEN FILE'' (690b1b175f4f05eaf8f6c0e0).'
author: AlienVault
date: '2025-11-05'
references:
- https://theravenfile.com/2025/11/04/clop-ransomware-dissecting-network/
tags:
- cve-2025-61882
- cve-2023-0669
- cyclops blink
- cryptomix
- infrastructure
- oracle ebs
- cve-2023-34362
- ransomware
- fingerprints
- ip addresses
- network analysis
- otx
- threat-intel
logsource:
  category: network
detection:
  selection:
    dst_ip: 5.188.87.49
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
