title: OTX IPv4 IOC - 178.32.224.219
id: 660298b7-b108-410a-a3cd-d765b0efde0d
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Gootloader Returns:
  What Goodies Did They Bring?'' (690cadc6a4a3c3370cc2e697).'
author: AlienVault
date: '2025-11-06'
references:
- https://www.huntress.com/blog/gootloader-threat-detection-woff2-obfuscation
tags:
- vanilla tempest
- lateral movement
- noberus
- ransomware
- obfuscation
- gootloader
- quantum locker
- seo poisoning
- rhysida
- wordpress exploitation
- zeppelin
- javascript
- blackcat
- alphv
- supper socks5 backdoor
- otx
- threat-intel
logsource:
  category: network
detection:
  selection:
    dst_ip: 178.32.224.219
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
