title: OTX IPv4 IOC - 77.83.207.106
id: 94a7538b-fef6-4e54-b8f4-72a91772e3b1
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Booking.com Phishing
  Campaign Targeting Hotels and Customers' (690dba690d5c272baae78d78).
author: AlienVault
date: '2025-11-07'
references:
- https://blog.sekoia.io/phishing-campaigns-i-paid-twice-targeting-booking-com-hotels-and-customers/
tags:
- phishing
- social engineering
- clickfix
- hospitality
- booking.com
- purerat
- cybercrime
- otx
- threat-intel
logsource:
  category: network
detection:
  selection:
    dst_ip: 77.83.207.106
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
