title: OTX IPv4 IOC - 195.211.190.189
id: 5027d39b-ed7f-444d-b4cb-62b3df325e05
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Cat''s Got Your
  Files: Lynx Ransomware'' (691b65be81167e8300b087de).'
author: AlienVault
date: '2025-11-17'
references:
- https://thedfirreport.com/2025/11/17/cats-got-your-files-lynx-ransomware
tags:
- network reconnaissance
- lynx ransomware
- rdp
- backup deletion
- credential abuse
- data exfiltration
- ransomware
- lateral movement
- otx
- threat-intel
logsource:
  category: network
detection:
  selection:
    dst_ip: 195.211.190.189
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
