title: OTX domain IOC - cc-newton.info
id: 99922bef-29c4-44de-a17a-5171e0e55b25
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Iranian Educated Manticore
  Targets Leading Tech Academics' (685db537f7a98c26737b6b3b).
author: AlienVault
date: '2025-06-26'
references:
- https://research.checkpoint.com/2025/iranian-educated-manticore-targets-leading-tech-academics/
tags:
- Educated Manticore
- Iran
- APT42
- Charming Kitten
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: cc-newton.info
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
