title: OTX domain IOC - northumbra.com
id: 4cb74b4c-e4b4-4492-bf6c-8a78de99c7c6
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Checking all the
  Boxes: LapDogs, The New ORB in Town'' (685db8478a9e8c6ccdbd2255).'
author: AlienVault
date: '2025-06-26'
references:
- https://securityscorecard.com/wp-content/uploads/2025/06/LapDogs-STRIKE-Report-June-2025.pdf
tags:
- orb
- shortleash
- tls certificates
- soho devices
- southeast asia
- cve-2017-17663
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: northumbra.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
