title: OTX domain IOC - mhbr.live
id: a1bde667-3acc-4895-bae4-e9ea8285159c
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Fix the Click: Preventing
  the ClickFix Attack Vector'' (686ffe0f30bfbdfa037e4168).'
author: AlienVault
date: '2025-07-10'
references:
- https://unit42.paloaltonetworks.com/preventing-clickfix-attack-vector
tags:
- latrodectus
- typosquatting
- powershell
- clipboard hijacking
- autoit
- social engineering
- clickfix
- rat
- infostealer
- netsupport rat
- lumma stealer
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: mhbr.live
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
