title: OTX domain IOC - lmfao.su
id: 39f462f5-98e3-49e2-9c39-50e99473e714
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'The Solidity Language
  open-source package was used in a $500,000 crypto heist' (6870b25f4c4c81689f7f0c75).
author: AlienVault
date: '2025-07-11'
references:
- https://securelist.com/open-source-package-for-cursor-ai-turned-into-a-crypto-heist/116908/
tags:
- developers
- heur:trojan-psw.msil.purelogs.gen
- blockchain
- open-source
- vmdetector
- solidity
- cursor ai
- cryptocurrency
- quasar
- malicious extension
- data theft
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: lmfao.su
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
