title: OTX domain IOC - rv0777.com
id: 6f3095b2-9f60-4329-972f-eaee6e1176d4
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Chinese Malware
  Delivery Domains: Part III'' (6879f8fcecc13fd4ad77e76d).'
author: AlienVault
date: '2025-07-18'
references:
- https://dti.domaintools.com/chinese-malware-delivery-domains-part-iii
tags:
- fake-updates
- windows
- phishing
- cryptocurrency
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: rv0777.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
