title: OTX domain IOC - pokeabdi.com
id: 79150f81-d526-49d7-ba15-d9f0a7c36e4c
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Chinese Malware
  Delivery Domains: Part III'' (6879f8fcecc13fd4ad77e76d).'
author: AlienVault
date: '2025-07-18'
references:
- https://dti.domaintools.com/chinese-malware-delivery-domains-part-iii
tags:
- fake-updates
- windows
- phishing
- cryptocurrency
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: pokeabdi.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
