title: OTX domain IOC - supernegro.mom
id: 484f6717-4757-47e3-b366-945c3f8900fa
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Sealed Chain of
  Deception: Actors leveraging Node.JS to Launch JSCeal'' (688b3d58e80e0edcd1cb1e22).'
author: AlienVault
date: '2025-07-31'
references:
- https://research.checkpoint.com/2025/jsceal-targets-crypto-apps/
tags:
- fake apps
- stealer
- cryptocurrency
- malvertising
- multi-stage
- node.js
- evasion
- jsceal
- jsc
- powershell
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: supernegro.mom
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
