title: OTX domain IOC - app-pc-download.com
id: 665b6d9b-60cc-4c64-ad9f-5f61c6982c62
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Sealed Chain of
  Deception: Actors leveraging Node.JS to Launch JSCeal'' (688b3d58e80e0edcd1cb1e22).'
author: AlienVault
date: '2025-07-31'
references:
- https://research.checkpoint.com/2025/jsceal-targets-crypto-apps/
tags:
- fake apps
- stealer
- cryptocurrency
- malvertising
- multi-stage
- node.js
- evasion
- jsceal
- jsc
- powershell
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: app-pc-download.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
