title: OTX hostname IOC - indianarmy.nic.in.ministryofdefenceindia.org
id: 857431b3-7505-4b9d-a9aa-537f93664d1e
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Indian Infrastructure
  Targeted with Desktop Lures and Poseidon Backdoor' (688cb39bdc1c258f2b66a6e8).
author: AlienVault
date: '2025-08-01'
references:
- https://hunt.io/blog/apt36-india-infrastructure-attacks
tags:
- poseidon backdoor
- government impersonation
- mythic framework
- infrastructure
- desktop lures
- phishing
- poseidon
- india
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: indianarmy.nic.in.ministryofdefenceindia.org
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
