title: OTX domain IOC - knvocjqt6znfp4lba3j237i5kjnxgmk6niqk72w3wb22bfif6i7wufad.onion
id: 34535709-4d99-468e-9b56-1b8e44543190
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Raspberry Robin:
  Latest Updates and Improvements'' (68920b2a624f32c4343ef884).'
author: AlienVault
date: '2025-08-05'
references: []
tags:
- encryption
- roshtyak
- usb
- privilege-escalation
- obfuscation
- tor
- raspberry robin
- cve-2024-38196
- downloader
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: knvocjqt6znfp4lba3j237i5kjnxgmk6niqk72w3wb22bfif6i7wufad.onion
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
