title: OTX domain IOC - 42lidqllkggf7tsgymwk4jzfmawdinwav5vkii3l3wsqcrk4k5ncrrad.onion
id: c193c2aa-ba91-4de0-8fe2-75ce4616ed95
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Raspberry Robin:
  Latest Updates and Improvements'' (68920b2a624f32c4343ef884).'
author: AlienVault
date: '2025-08-05'
references: []
tags:
- encryption
- roshtyak
- usb
- privilege-escalation
- obfuscation
- tor
- raspberry robin
- cve-2024-38196
- downloader
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: 42lidqllkggf7tsgymwk4jzfmawdinwav5vkii3l3wsqcrk4k5ncrrad.onion
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
