title: OTX domain IOC - 852346031.xyz
id: 7d27979c-6d2a-4f3b-bfe5-05be3b7a8dbb
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: 852346031.xyz
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
