title: OTX domain IOC - grossmankelly.online
id: 1bbadebb-1582-43c4-8bc3-78105c59e6bb
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence InfoStealer'' (6894566bd94b79b7fbdbade1).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: grossmankelly.online
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
