title: OTX hostname IOC - managerbank.bluetrait.io
id: 70d49d42-3d22-4ece-bbca-fd51b9bf874a
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Email-Delivered
  RMM: Abusing PDFs for Silent Initial Access'' (6894c40fb08284d4bdc0c05a).'
author: AlienVault
date: '2025-08-07'
references:
- https://labs.withsecure.com/publications/email-delivered-rmm
tags:
- phishing
- pdf
- initial access
- rmm
- social engineering
- france
- luxembourg
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: managerbank.bluetrait.io
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
