title: OTX domain IOC - wubiump.net
id: 45f17a58-e8b9-4c73-8250-93bdba3b817e
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: wubiump.net
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
