title: OTX domain IOC - celestialcupcake.click
id: 88e68a36-6c44-4719-904e-a19f7f8e867b
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence InfoStealer'' (6894566bd94b79b7fbdbade1).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: celestialcupcake.click
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
