title: OTX domain IOC - wolfpackinnovations.site
id: cbfb1fe2-1584-4def-8664-4d1282fccc91
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: wolfpackinnovations.site
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
