title: OTX domain IOC - xqqqcxcvbvc.com
id: 5835b4bf-ed6d-4849-a88b-d3458acabdb3
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: xqqqcxcvbvc.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
