title: OTX domain IOC - chickenargen.site
id: 68514a1d-a3aa-430f-a75b-1a400432b8e6
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: chickenargen.site
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
