title: OTX domain IOC - coinzebra.xyz
id: ee90f3be-6b05-4b2c-912c-32475f80a0b0
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: coinzebra.xyz
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
