title: OTX domain IOC - geoffreyxxx.xyz
id: 20635d0a-36bc-40ff-a391-bfed1f77b7c0
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: geoffreyxxx.xyz
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
