title: OTX domain IOC - uniquemotoringevents.online
id: 492d3c9f-2d1f-48e2-9383-11d5cf72bdc0
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: uniquemotoringevents.online
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
