title: OTX domain IOC - repliqueluxemontre.run
id: de62ded5-efa6-4131-a40a-d0d6a3c7e851
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: repliqueluxemontre.run
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
