title: OTX domain IOC - 777crawler.xyz
id: 59cb82ec-b657-49c7-ba6e-5b0cf1a7bb22
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: 777crawler.xyz
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
