title: OTX domain IOC - reflexes-uncross.online
id: eb2444d2-78eb-40d5-b95c-fd33b43f9502
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: reflexes-uncross.online
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
