title: OTX hostname IOC - moduleadobeu.bluetrait.io
id: b4d5675f-fc5b-46cb-a027-eacd9bc8d7fe
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Email-Delivered
  RMM: Abusing PDFs for Silent Initial Access'' (6894c40fb08284d4bdc0c05a).'
author: AlienVault
date: '2025-08-07'
references:
- https://labs.withsecure.com/publications/email-delivered-rmm
tags:
- phishing
- pdf
- initial access
- rmm
- social engineering
- france
- luxembourg
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: moduleadobeu.bluetrait.io
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
