title: OTX domain IOC - adrianobet.xyz
id: 3c457463-3a09-4633-933f-941fffe50140
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: adrianobet.xyz
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
