title: OTX domain IOC - articlecrazy.xyz
id: 3b95d6e7-eb17-4d23-910f-28c019f8d4d0
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: articlecrazy.xyz
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
