title: OTX domain IOC - camillaejunior.site
id: 2c36b72b-f851-43f9-8295-7cf1c9b5da0d
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: camillaejunior.site
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
