title: OTX domain IOC - v1qxmzu18bo96vvy9.shop
id: 2b08e842-4d7f-4458-9f01-39b113324392
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: v1qxmzu18bo96vvy9.shop
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
