title: OTX domain IOC - 88offering.xyz
id: 9bcd8e50-5902-4445-b13d-d478f0ecae7d
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: 88offering.xyz
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
