title: OTX domain IOC - albgby.org
id: abd023a4-4a58-428d-ab78-47dd9e657f0c
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: albgby.org
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
