title: OTX domain IOC - atakatitanovvseseriimpj.online
id: da5e2873-8d78-4058-814c-a058e264864a
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Infrastructure of
  Interest: Medium Confidence Detection'' (6894583edc4b67d5c7c5cb34).'
author: AlienVault
date: '2025-08-07'
references: []
tags:
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: atakatitanovvseseriimpj.online
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
