title: OTX domain IOC - campanole.com
id: d1d9ab63-d9d5-4292-b8ab-de8e1f4034f9
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Update WinRAR tools
  now: RomCom and others exploiting zero-day vulnerability'' (689a04b1cf818643f79c1bd3).'
author: AlienVault
date: '2025-08-11'
references:
- https://www.welivesecurity.com/en/eset-research/update-winrar-tools-now-romcom-and-others-exploiting-zero-day-vulnerability
tags:
- rustyclaw
- winrar
- vulnerability
- mythic
- zero-day
- spearphishing
- russia-aligned
- cve-2025-8088
- backdoor
- exploit
- snipbot
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: campanole.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
