title: OTX hostname IOC - www.yobox.store
id: 619e915f-e762-49b7-9852-e221461a0fd5
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''CryptoJacking is
  dead: long live CryptoJacking'' (68a5a893d0e6cf5fee6c45a2).'
author: AlienVault
date: '2025-08-20'
references:
- https://cside.dev/blog/cryptojacking-is-dead-long-live-cryptojacking
tags:
- cryptojacking
- webassembly
- monero
- stealth mining
- web workers
- obfuscation
- websockets
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: www.yobox.store
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
