title: OTX domain IOC - dpblast.fun
id: 179afb07-4601-4307-94ca-f81b9970fc48
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: dpblast.fun
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
