title: OTX domain IOC - dpbots.online
id: 0391f68d-31e9-4c02-9bd4-445f76d04ea9
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: dpbots.online
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
