title: OTX domain IOC - zifirwera.ru
id: 6c754948-3af6-4e21-a787-461d0e68d195
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Android backdoor spies
  on Russian business employees' (68ac4107332fb8f01c93e2ac).
author: AlienVault
date: '2025-08-25'
references:
- http://news.drweb.ru/show/?i=15047&lng=ru
- https://raw.githubusercontent.com/DoctorWebLtd/malware-iocs/refs/heads/master/Android.Backdoor.916.origin/README.adoc
tags:
- russian
- mobile-malware
- spyware
- backdoor
- business
- android.backdoor.916.origin
- surveillance
- android
- targeted-attack
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: zifirwera.ru
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
