title: OTX domain IOC - lvprocurement.com
id: f8c17736-9ba9-40c8-9427-8ece85429cb8
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'ZipLine Phishing Campaign
  Targets U.S. Manufacturing' (68af58ce8cb7bcf7195c203f).
author: AlienVault
date: '2025-08-27'
references:
- A sophisticated phishing campaign called ZipLine is targeting U.S. manufacturing
  companies, especially those in supply chain-critical sectors. The attackers initiate
  contact through company contact forms, leading to weeks-long email conversations
  before delivering malicious payloads. They use legitimate-looking business interactions
  and AI-related pretexts to build trust. The campaign employs a custom malware called
  MixShell, which uses DNS TXT tunneling for command and control. The attackers utilize
  domain
tags:
- Phishing
- manufacturing
- MixShell
- DNS Tunneling
- ZipLine
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: lvprocurement.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
