title: OTX domain IOC - heartlandenergy.ai
id: ad7b36b6-521e-436f-afc7-c679194f03b8
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Like PuTTY in Admin's
  Hands' (68af30b5c4033492fe0be98f).
author: AlienVault
date: '2025-08-27'
references:
- https://levelblue.com/blogs/security-essentials/like-putty-in-admins-hands
tags:
- kerberoasting
- malvertising
- oyster
- putty
- broomstick
- trojanized
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: heartlandenergy.ai
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
