title: OTX domain IOC - deloittesharepoint.com
id: 8a2f88bf-e1f5-409f-98f5-3a284597b7c2
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Hunting Laundry
  Bear: Infrastructure Analysis Guide and Findings'' (68b19acb28e88648ad2c0ff1).'
author: AlienVault
date: '2025-08-29'
references:
- https://www.validin.com/blog/laundry_bear_infrastructure_analysis
tags:
- infrastructure analysis
- russian threat actor
- domain typosquatting
- ukraine targets
- apt
- spear-phishing
- nato targets
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: deloittesharepoint.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
