title: OTX hostname IOC - khbw.gwyhhcorybwjwuzh.live
id: a56c0242-dc3f-4562-a07f-de6a2c699045
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: khbw.gwyhhcorybwjwuzh.live
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
