title: OTX hostname IOC - khbw.zkuafimfdwvetxjq.live
id: 70d72d34-d67a-4391-8e65-b23e51647de5
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: khbw.zkuafimfdwvetxjq.live
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
