title: OTX hostname IOC - eicp.gwyhhcorybwjwuzh.info
id: 9256a2ba-cf63-49d3-bf57-47b2f68a7a95
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Dissecting RapperBot
  Botnet: From Infection to DDoS & More'' (68b7d8c30d43bf797983c817).'
author: AlienVault
date: '2025-09-03'
references:
- https://www.bitsight.com/blog/rapperbot-infection-ddos-split-second
tags:
- infrastructure
- ddos
- nvr
- dns
- rapperbot
- botnet
- iot
- encryption
- exploit
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: eicp.gwyhhcorybwjwuzh.info
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
