title: OTX domain IOC - pdfappsuite.com
id: 868b5e4e-451e-4420-a1c1-e4520b698832
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'New malware campaign
  discovered via ManualFinder' (68b8a1182ec5c19a3c05af6f).
author: AlienVault
date: '2025-09-03'
references:
- https://www.ncsc.nl/actueel/nieuws/2025/08/29/nieuwe-malwarecampagne-ontdekt-via-manualfinder
tags:
- onestart browser
- certificate abuse
- pdf-editor
- javascript
- manualfinder
- trojan:win64/infostealer!msr
- trojan:win32/malgent!msr
- windows
- residential proxy
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: pdfappsuite.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
