title: OTX domain IOC - star-bucks.cfd
id: b9934318-bb7d-44bf-8cff-ea50be0a30fd
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Contagious Interview
  | North Korean Threat Actors Reveal Plans and Ops by Abusing Cyber Intel Platforms'
  (68b9d266a57b122998115dc6).
author: AlienVault
date: '2025-09-04'
references:
- https://www.sentinelone.com/labs/contagious-interview-threat-actors-scout-cyber-intel-platforms-reveal-plans-and-ops
tags:
- cyber espionage
- social engineering
- north korea
- job seeker targeting
- clickfix
- lazarus
- infrastructure monitoring
- cryptocurrency
- contagiousdrop
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: star-bucks.cfd
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
