title: OTX domain IOC - talesseries.com
id: 43dda2a7-227e-4522-aaf7-28ac4d13ab7d
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Contagious Interview
  | North Korean Threat Actors Reveal Plans and Ops by Abusing Cyber Intel Platforms'
  (68b9d266a57b122998115dc6).
author: AlienVault
date: '2025-09-04'
references:
- https://www.sentinelone.com/labs/contagious-interview-threat-actors-scout-cyber-intel-platforms-reveal-plans-and-ops
tags:
- cyber espionage
- social engineering
- north korea
- job seeker targeting
- clickfix
- lazarus
- infrastructure monitoring
- cryptocurrency
- contagiousdrop
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: talesseries.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
