title: OTX domain IOC - managed7.com
id: c3e97440-1c99-4027-91dc-74375f33f7f7
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''From Compromised
  Keys to Phishing Campaigns: Inside a Cloud Email Service Takeover'' (68ba2388d5fc0ba4d6317ac6).'
author: AlienVault
date: '2025-09-04'
references:
- https://www.wiz.io/blog/wiz-discovers-cloud-email-abuse-campaign
tags:
- cloud security
- aws
- sandbox escape
- phishing
- email service
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: managed7.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
