title: OTX domain IOC - webcloud-notice.com
id: aeca2b51-1b0a-4808-9954-a76613be3f70
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Inside the Kimsuky
  Leak: How the ''Kim'' Dump Exposed North Korea''s Credential Theft Playbook'' (68bea37d4c7b1bb28149b407).'
author: AlienVault
date: '2025-09-08'
references:
- https://dti.domaintools.com/inside-the-kimsuky-leak-how-the-kim-dump-exposed-north-koreas-credential-theft-playbook/
tags:
- north korea
- hybrid attribution
- phishing
- rootkit
- vmmisc.ko
- credential theft
- south korea
- gpki
- ocr
- taiwan
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: webcloud-notice.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
