title: OTX domain IOC - network.target
id: 5e6885f2-49cc-48de-b9a7-ac18f5ded155
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''ZynorRAT technical
  analysis: Reverse engineering a novel, Turkish Go-based RAT'' (68c12ec5eb851e4417b21f49).'
author: AlienVault
date: '2025-09-10'
references:
- https://www.sysdig.com/blog/zynorrat-technical-analysis-reverse-engineering-a-novel-turkish-go-based-rat
tags:
- remote access trojan
- zynorrat
- go-based
- turkish
- linux
- telegram
- windows
- c2
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: network.target
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
