title: OTX hostname IOC - tulicrp.engajroker.cyou
id: a3084c4c-1710-4c6a-a32f-0075147674e4
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''AsyncRAT Campaigns
  Uncovered: How Attackers Abuse ScreenConnect and Open Directories'' (68cd7f421874e12c34532ccf).'
author: AlienVault
date: '2025-09-19'
references:
- https://hunt.io/blog/asyncrat-screenconnect-open-directory-campaigns#ConnectWise_ScreenConnect_Network_Observables_and_Indicators_of_Compromise_IOCs
tags:
- phishing
- open directories
- screenconnect
- remote access trojan
- powershell rat
- c2 infrastructure
- payload staging
- persistence
- asyncrat
- cve-2025-3935
- obfuscation
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: tulicrp.engajroker.cyou
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
