title: OTX domain IOC - loadinnnhr.today
id: 33febdf5-dc7c-4bf0-89d8-690387ae21e0
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''DeerStealer Malware
  Campaign: Stealth, Persistence, and Rootkit-Like Capabilities'' (68ce938ae34f725fce8b67a4).'
author: AlienVault
date: '2025-09-20'
references:
- https://www.cyfirma.com/research/deerstealer-malware-campaign-stealth-persistence-and-rootkit-like-capabilities
tags:
- multi-stage-execution
- rootkit
- data-exfiltration
- xfiles spyware
- persistence
- deerstealer
- uac-bypass
- information-stealing
- stealth
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: loadinnnhr.today
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
