title: OTX domain IOC - nacreousoculus.pro
id: f2f2c09c-9104-4cd7-9e6c-41ee706a30bd
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''DeerStealer Malware
  Campaign: Stealth, Persistence, and Rootkit-Like Capabilities'' (68ce938ae34f725fce8b67a4).'
author: AlienVault
date: '2025-09-20'
references:
- https://www.cyfirma.com/research/deerstealer-malware-campaign-stealth-persistence-and-rootkit-like-capabilities
tags:
- multi-stage-execution
- rootkit
- data-exfiltration
- xfiles spyware
- persistence
- deerstealer
- uac-bypass
- information-stealing
- stealth
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: nacreousoculus.pro
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
