title: OTX domain IOC - storsvc-win.com
id: 9fc16e8f-cb43-4555-ad9e-3e4f6011e1a7
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''WARMCOOKIE One Year
  Later: New Features and Fresh Insights'' (68e377d0b3f8991035cc2a27).'
author: AlienVault
date: '2025-10-06'
references:
- https://www.elastic.co/security-labs/revisiting-warmcookie
tags:
- warmcookie
- malware-as-a-service
- castlebot
- backdoor
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: storsvc-win.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
