title: OTX hostname IOC - host.404111.xyz
id: 160b702b-276a-4faa-b7b0-43635e4bc949
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The Crown Prince,
  Nezha: A New Tool Favored by China-Nexus Threat Actors'' (68e7e51909bb02e0f22bfc5a).'
author: AlienVault
date: '2025-10-09'
references:
- https://www.huntress.com/blog/nezha-china-nexus-threat-actor-tool
tags:
- log poisoning
- nezha
- web shell
- china chopper
- server monitoring
- ghost rat
- antsword
- remote access trojan
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: host.404111.xyz
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
