title: OTX hostname IOC - gd.bj2.xyz
id: 4f90c409-3c14-44dc-9cf4-e12977a4e5a0
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''The Crown Prince,
  Nezha: A New Tool Favored by China-Nexus Threat Actors'' (68e7e51909bb02e0f22bfc5a).'
author: AlienVault
date: '2025-10-09'
references:
- https://www.huntress.com/blog/nezha-china-nexus-threat-actor-tool
tags:
- log poisoning
- nezha
- web shell
- china chopper
- server monitoring
- ghost rat
- antsword
- remote access trojan
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: gd.bj2.xyz
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
