title: OTX domain IOC - intlspring.com
id: a335a7b5-6e2d-4522-8b13-d50c6f20b9d2
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''When the monster
  bytes: tracking TA585 and its arsenal'' (68edc60d33bbc8833d677ae6).'
author: AlienVault
date: '2025-10-14'
references:
- https://www.proofpoint.com/us/blog/threat-insight/when-monster-bytes-tracking-ta585-and-its-arsenal
tags:
- stealer
- clickfix
- github
- rhadamanthys
- stealc version 2
- monsterv2
- web injection
- remote access trojan
- lumma stealer
- remcos
- soniccrypt
- cybercrime
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: intlspring.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
