title: OTX hostname IOC - trisinsil.medicesterium.help
id: 8f19a5b4-a373-4526-8589-2a127c2f211e
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Banking Trojan Abusing
  GitHub for Resilience' (68ee1391e202d5db1c015e71).
author: AlienVault
date: '2025-10-14'
references: []
tags:
- guildma
- github abuse
- banking trojan
- cryptocurrency
- steganography
- keylogging
- astaroth
- south america
- phishing
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: trisinsil.medicesterium.help
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
