title: OTX hostname IOC - stroal.medicoassocidos.beauty
id: 6e893576-8ceb-4298-9939-6facb7b30995
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Banking Trojan Abusing
  GitHub for Resilience' (68ee1391e202d5db1c015e71).
author: AlienVault
date: '2025-10-14'
references: []
tags:
- guildma
- github abuse
- banking trojan
- cryptocurrency
- steganography
- keylogging
- astaroth
- south america
- phishing
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: stroal.medicoassocidos.beauty
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
