title: OTX domain IOC - pdfplugins.com
id: 6ae1cca9-92c9-4713-89bb-4a877f749a5f
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Mysterious Elephant
  APT: TTPs and tools'' (68efd379576217166803e5e1).'
author: AlienVault
date: '2025-10-15'
references:
- https://securelist.com/mysterious-elephant-apt-ttps-and-tools/117596/
tags:
- custom tools
- babshell
- stom exfiltrator
- foreign affairs
- memloader hidendesk
- whatsapp exploitation
- memloader edge
- uplo exfiltrator
- government targets
- remcos
- chromestealer exfiltrator
- vrat
- exfiltration
- apt
- asia-pacific
- spear phishing
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: pdfplugins.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
