title: OTX hostname IOC - fileshare-avp.ddns.net
id: c781d46d-4af7-4ea8-abc8-9f0ef1eb4a9c
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Mysterious Elephant
  APT: TTPs and tools'' (68efd379576217166803e5e1).'
author: AlienVault
date: '2025-10-15'
references:
- https://securelist.com/mysterious-elephant-apt-ttps-and-tools/117596/
tags:
- custom tools
- babshell
- stom exfiltrator
- foreign affairs
- memloader hidendesk
- whatsapp exploitation
- memloader edge
- uplo exfiltrator
- government targets
- remcos
- chromestealer exfiltrator
- vrat
- exfiltration
- apt
- asia-pacific
- spear phishing
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: fileshare-avp.ddns.net
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
