title: OTX hostname IOC - stat.bluetroniq.vip
id: ea233992-7d60-4380-a325-78a8fcd7b99b
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''New Group on the
  Block: UNC5142 Leverages EtherHiding to Distribute Malware'' (68f130fe56a14a2de8f391b4).'
author: AlienVault
date: '2025-10-16'
references:
- https://cloud.google.com/blog/topics/threat-intelligence/unc5142-etherhiding-distribute-malware
tags:
- smart contracts
- blockchain
- cloudflare pages
- bnb smart chain
- atomic
- lummac.v2
- vidar
- infostealers
- radthief
- clearshort
- wordpress
- etherhiding
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: stat.bluetroniq.vip
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
