title: OTX domain IOC - holapor67.top
id: fb7ee8b8-5214-4431-aebf-3916d3aee230
status: experimental
description: Indicator of compromise from AlienVault OTX pulse 'Uncovering Qilin attack
  methods exposed through multiple cases' (68ff293c6892fe669c7aa472).
author: AlienVault
date: '2025-10-27'
references:
- https://blog.talosintelligence.com/uncovering-qilin-attack-methods-exposed-through-multiple-cases/
tags:
- manufacturing
- ransomware
- systembc
- cobalt strike
- qilin
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: holapor67.top
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
