title: OTX domain IOC - indebt-faturas.com
id: 333a354c-c50f-43d8-9957-f398ab2460d0
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''From Brazil with
  Love: New Tactics from Lampion'' (6904825c8b7788f09d0d5ce2).'
author: AlienVault
date: '2025-10-31'
references:
- https://www.bitsight.com/blog/brazil-love-new-tactics-lampion
tags:
- lampion
- clickfix
- banking trojan
- lampion stealer
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: indebt-faturas.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
