title: OTX domain IOC - portal-das-financas-pt.com
id: f3f9b88c-ee2c-48a3-b8a6-b5dc95976a5a
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''From Brazil with
  Love: New Tactics from Lampion'' (6904825c8b7788f09d0d5ce2).'
author: AlienVault
date: '2025-10-31'
references:
- https://www.bitsight.com/blog/brazil-love-new-tactics-lampion
tags:
- lampion
- clickfix
- banking trojan
- lampion stealer
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: portal-das-financas-pt.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
