title: OTX domain IOC - atportal-das-financas.com
id: f580da15-4a7a-4479-9679-123e0710be3c
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''From Brazil with
  Love: New Tactics from Lampion'' (6904825c8b7788f09d0d5ce2).'
author: AlienVault
date: '2025-10-31'
references:
- https://www.bitsight.com/blog/brazil-love-new-tactics-lampion
tags:
- lampion
- clickfix
- banking trojan
- lampion stealer
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: atportal-das-financas.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
