title: OTX domain IOC - at-portaldasfinancas.com
id: 755e4f1d-4aba-4f12-b46b-391d46d3bfca
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''From Brazil with
  Love: New Tactics from Lampion'' (6904825c8b7788f09d0d5ce2).'
author: AlienVault
date: '2025-10-31'
references:
- https://www.bitsight.com/blog/brazil-love-new-tactics-lampion
tags:
- lampion
- clickfix
- banking trojan
- lampion stealer
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: at-portaldasfinancas.com
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
