title: OTX domain IOC - portal-das-financas-pt.org
id: 8bd611f2-5140-48f4-9ef6-7b6159522dc5
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''From Brazil with
  Love: New Tactics from Lampion'' (6904825c8b7788f09d0d5ce2).'
author: AlienVault
date: '2025-10-31'
references:
- https://www.bitsight.com/blog/brazil-love-new-tactics-lampion
tags:
- lampion
- clickfix
- banking trojan
- lampion stealer
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: portal-das-financas-pt.org
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
