title: OTX hostname IOC - national.shitposting.agency
id: 370b4783-e0a7-4b28-8b65-a7a31612af5e
status: experimental
description: 'Indicator of compromise from AlienVault OTX pulse ''Cat''s Got Your
  Files: Lynx Ransomware'' (691b65be81167e8300b087de).'
author: AlienVault
date: '2025-11-17'
references:
- https://thedfirreport.com/2025/11/17/cats-got-your-files-lynx-ransomware
tags:
- network reconnaissance
- lynx ransomware
- rdp
- backup deletion
- credential abuse
- data exfiltration
- ransomware
- lateral movement
- otx
- threat-intel
logsource:
  category: dns
detection:
  selection:
    dns.question.name: national.shitposting.agency
  condition: selection
falsepositives:
- Unknown – verify this IOC against your environment.
level: medium
